mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#include "core_cm0plus.h"                       /*!< ARM Cortex-M0+ processor and core peripherals                             */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                         XIP_CTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief QSPI flash execute-in-place block (XIP_CTRL)
  */

typedef struct {                                /*!< XIP_CTRL Structure                                                        */

  union {
    __IOM uint32_t CTRL;                        /*!< Cache control                                                             */

    struct {
      __IOM uint32_t EN         : 1;            /*!< When 1, enable the cache. When the cache is disabled, all XIP
                                                     accesses
                                                     will go straight to the flash, without querying the cache.
                                                     When enabled,
                                                     cacheable XIP accesses will query the cache, and the flash
                                                     will

                                                     ot be accessed if the tag matches and the valid bit is
                                                     set.

                                                     If the cache is enabled, cache-as-SRAM accesses have no
                                                     effect on the
                                                     cache data RAM, and will produce a bus error response.                    */
      __IOM uint32_t ERR_BADWRITE : 1;          /*!< When 1, writes to any alias other than 0x0 (caching, allocating)
                                                     will produce a bus fault. When 0, these writes are silently
                                                     ignored.
                                                     In either case, writes to the 0x0 alias will deallocate
                                                     on tag match,
                                                     as usual.                                                                 */
            uint32_t            : 1;
      __IOM uint32_t POWER_DOWN : 1;            /*!< When 1, the cache memories are powered down. They retain state,
                                                     but can not be accessed. This reduces static power dissipation.
                                                     Writing 1 to this bit forces CTRL_EN to 0, i.e. the cache
                                                     cannot
                                                     be enabled when powered down.
                                                     Cache-as-SRAM accesses will produce a bus error response
                                                     when
                                                     the cache is powered down.                                                */
            uint32_t            : 28;
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t FLUSH;                       /*!< Cache Flush control                                                       */

    struct {
      __IOM uint32_t FLUSH      : 1;            /*!< Write 1 to flush the cache. This clears the tag memory, but
                                                     the data memory retains its contents. (This means cache-as-SRAM
                                                     contents is not affected by flush or reset.)
                                                     Reading will hold the bus (stall the processor) until the
                                                     flush
                                                     completes. Alternatively STAT can be polled until completion.             */
            uint32_t            : 31;
    } FLUSH_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< Cache Status                                                              */

