mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t FLUSH_READY : 1;           /*!< Reads as 0 while a cache flush is in progress, and 1 otherwise.
                                                     The cache is flushed whenever the XIP block is reset, and
                                                     also
                                                     when requested via the FLUSH register.                                    */
      __IM  uint32_t FIFO_EMPTY : 1;            /*!< When 1, indicates the XIP streaming FIFO is completely empty.             */
      __IM  uint32_t FIFO_FULL  : 1;            /*!< When 1, indicates the XIP streaming FIFO is completely full.
                                                     The streaming FIFO is 2 entries deep, so the full and empty
                                                     flag allow its level to be ascertained.                                   */
            uint32_t            : 29;
    } STAT_b;
  } ;
  __IOM uint32_t  CTR_HIT;                      /*!< Cache Hit counter
                                                     A 32 bit saturating counter that increments upon each cache
                                                     hit,
                                                     i.e. when an XIP access is serviced directly from cached
                                                     data.
                                                     Write any value to clear.                                                 */
  __IOM uint32_t  CTR_ACC;                      /*!< Cache Access counter
                                                     A 32 bit saturating counter that increments upon each XIP
                                                     access,
                                                     whether the cache is hit or not. This includes noncacheable
                                                     accesses.
                                                     Write any value to clear.                                                 */

  union {
    __IOM uint32_t STREAM_ADDR;                 /*!< FIFO stream address                                                       */

    struct {
            uint32_t            : 2;
      __IOM uint32_t STREAM_ADDR : 30;          /*!< The address of the next word to be streamed from flash to the
                                                     streaming FIFO.
                                                     Increments automatically after each flash access.
                                                     Write the initial access address here before starting a
                                                     streaming read.                                                           */
    } STREAM_ADDR_b;
  } ;

  union {
    __IOM uint32_t STREAM_CTR;                  /*!< FIFO stream control                                                       */

    struct {
      __IOM uint32_t STREAM_CTR : 22;           /*!< Write a nonzero value to start a streaming read. This will then
                                                     progress in the background, using flash idle cycles to
                                                     transfer
                                                     a linear data block from flash to the streaming FIFO.
                                                     Decrements automatically (1 at a time) as the stream
                                                     progresses, and halts on reaching 0.
                                                     Write 0 to halt an in-progress stream, and discard any
                                                     in-flight
                                                     read, so that a new stream can immediately be started (after
                                                     draining the FIFO and reinitialising STREAM_ADDR)                         */
            uint32_t            : 10;
    } STREAM_CTR_b;
  } ;
  __IM  uint32_t  STREAM_FIFO;                  /*!< FIFO stream data
                                                     Streamed data is buffered here, for retrieval by the system
                                                     DMA.
                                                     This FIFO can also be accessed via the XIP_AUX slave, to
                                                     avoid exposing
                                                     the DMA to bus stalls caused by other XIP traffic.                        */
} XIP_CTRL_Type;                                /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                          XIP_SSI                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief DW_apb_ssi has the following features:
        * APB interface – Allows for easy integration into a DesignWare Synthesizable Components for AMBA 2 implementation.
        * APB3 and APB4 protocol support.
        * Scalable APB data bus width – Supports APB data bus widths of 8, 16, and 32 bits.
        * Serial-master or serial-slave operation – Enables serial communication with serial-master or serial-slave peripheral devices.
        * Programmable Dual/Quad/Octal SPI support in Master Mode.
        * Dual Data Rate (DDR) and Read Data Strobe (RDS) Support - Enables the DW_apb_ssi master to perform operations with the device in DDR and RDS modes when working in Dual/Quad/Octal mode of operation.
        * Data Mask Support - Enables the DW_apb_ssi to selectively update the bytes in the device. This feature is applicable only in enhanced SPI modes.
        * eXecute-In-Place (XIP) support - Enables the DW_apb_ssi master to behave as a memory mapped I/O and fetches the data from the device based on the APB read request. This feature is applicable only in enhanced SPI modes.
        * DMA Controller Interface – Enables the DW_apb_ssi to interface to a DMA controller over the bus using a handshaking interface for transfer requests.
        * Independent masking of interrupts – Master collision, transmit FIFO overflow, transmit FIFO empty, receive FIFO full, receive FIFO underflow, and receive FIFO overflow interrupts can all be masked independently.
        * Multi-master contention detection – Informs the processor of multiple serial-master accesses on the serial bus.
        * Bypass of meta-stability flip-flops for synchronous clocks – When the APB clock (pclk) and the DW_apb_ssi serial clock (ssi_clk) are synchronous, meta-stable flip-flops are not used when transferring control signals across these clock domains.
        * Programmable delay on the sample time of the received serial data bit (rxd); enables programmable control of routing delays resulting in higher serial data-bit rates.
        * Programmable features:
        - Serial interface operation – Choice of Motorola SPI, Texas Instruments Synchronous Serial Protocol or National Semiconductor Microwire.
        - Clock bit-rate – Dynamic control of the serial bit rate of the data transfer; used in only serial-master mode of operation.
        - Data Item size (4 to 32 bits) – Item size of each data transfer under the control of the programmer.
        * Configured features:
        - FIFO depth – 16 words deep. The FIFO width is fixed at 32 bits.
        - 1 slave select output.
        - Hardware slave-select – Dedicated hardware slave-select line.
        - Combined interrupt line - one combined interrupt line from the DW_apb_ssi to the interrupt controller.
        - Interrupt polarity – active high interrupt lines.
        - Serial clock polarity – low serial-clock polarity directly after reset.
        - Serial clock phase – capture on first edge of serial-clock directly after reset. (XIP_SSI)
  */

typedef struct {                                /*!< XIP_SSI Structure                                                         */

  union {
    __IOM uint32_t CTRLR0;                      /*!< Control register 0                                                        */

