mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t DFS        : 4;            /*!< Data frame size                                                           */
      __IOM uint32_t FRF        : 2;            /*!< Frame format                                                              */
      __IOM uint32_t SCPH       : 1;            /*!< Serial clock phase                                                        */
      __IOM uint32_t SCPOL      : 1;            /*!< Serial clock polarity                                                     */
      __IOM uint32_t TMOD       : 2;            /*!< Transfer mode                                                             */
      __IOM uint32_t SLV_OE     : 1;            /*!< Slave output enable                                                       */
      __IOM uint32_t SRL        : 1;            /*!< Shift register loop (test mode)                                           */
      __IOM uint32_t CFS        : 4;            /*!< Control frame size
                                                     Value of n -> n+1 clocks per frame.                                       */
      __IOM uint32_t DFS_32     : 5;            /*!< Data frame size in 32b transfer mode
                                                     Value of n -> n+1 clocks per frame.                                       */
      __IOM uint32_t SPI_FRF    : 2;            /*!< SPI frame format                                                          */
            uint32_t            : 1;
      __IOM uint32_t SSTE       : 1;            /*!< Slave select toggle enable                                                */
            uint32_t            : 7;
    } CTRLR0_b;
  } ;

  union {
    __IOM uint32_t CTRLR1;                      /*!< Master Control register 1                                                 */

    struct {
      __IOM uint32_t NDF        : 16;           /*!< Number of data frames                                                     */
            uint32_t            : 16;
    } CTRLR1_b;
  } ;

  union {
    __IOM uint32_t SSIENR;                      /*!< SSI Enable                                                                */

    struct {
      __IOM uint32_t SSI_EN     : 1;            /*!< SSI enable                                                                */
            uint32_t            : 31;
    } SSIENR_b;
  } ;

  union {
    __IOM uint32_t MWCR;                        /*!< Microwire Control                                                         */

    struct {
      __IOM uint32_t MWMOD      : 1;            /*!< Microwire transfer mode                                                   */
      __IOM uint32_t MDD        : 1;            /*!< Microwire control                                                         */
      __IOM uint32_t MHS        : 1;            /*!< Microwire handshaking                                                     */
            uint32_t            : 29;
    } MWCR_b;
  } ;

  union {
    __IOM uint32_t SER;                         /*!< Slave enable                                                              */

    struct {
      __IOM uint32_t SER        : 1;            /*!< For each bit:
                                                     0 -> slave not selected
                                                     1 -> slave selected                                                       */
            uint32_t            : 31;
    } SER_b;
  } ;

  union {
    __IOM uint32_t BAUDR;                       /*!< Baud rate                                                                 */

    struct {
      __IOM uint32_t SCKDV      : 16;           /*!< SSI clock divider                                                         */
            uint32_t            : 16;
    } BAUDR_b;
  } ;

  union {
    __IOM uint32_t TXFTLR;                      /*!< TX FIFO threshold level                                                   */

    struct {
      __IOM uint32_t TFT        : 8;            /*!< Transmit FIFO threshold                                                   */
            uint32_t            : 24;
    } TXFTLR_b;
  } ;

  union {
    __IOM uint32_t RXFTLR;                      /*!< RX FIFO threshold level                                                   */

    struct {
      __IOM uint32_t RFT        : 8;            /*!< Receive FIFO threshold                                                    */
            uint32_t            : 24;
    } RXFTLR_b;
  } ;

  union {
    __IOM uint32_t TXFLR;                       /*!< TX FIFO level                                                             */

    struct {
      __IM  uint32_t TFTFL      : 8;            /*!< Transmit FIFO level                                                       */
            uint32_t            : 24;
    } TXFLR_b;
  } ;

  union {
    __IOM uint32_t RXFLR;                       /*!< RX FIFO level                                                             */

    struct {
      __IM  uint32_t RXTFL      : 8;            /*!< Receive FIFO level                                                        */
            uint32_t            : 24;
    } RXFLR_b;
  } ;

  union {
    __IOM uint32_t SR;                          /*!< Status register                                                           */

    struct {
      __IM  uint32_t BUSY       : 1;            /*!< SSI busy flag                                                             */
      __IM  uint32_t TFNF       : 1;            /*!< Transmit FIFO not full                                                    */
      __IM  uint32_t TFE        : 1;            /*!< Transmit FIFO empty                                                       */
      __IM  uint32_t RFNE       : 1;            /*!< Receive FIFO not empty                                                    */
      __IM  uint32_t RFF        : 1;            /*!< Receive FIFO full                                                         */
      __IM  uint32_t TXE        : 1;            /*!< Transmission error                                                        */
      __IM  uint32_t DCOL       : 1;            /*!< Data collision error                                                      */
            uint32_t            : 25;
    } SR_b;
  } ;

  union {
    __IOM uint32_t IMR;                         /*!< Interrupt mask                                                            */

