mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t TXEIM      : 1;            /*!< Transmit FIFO empty interrupt mask                                        */
      __IOM uint32_t TXOIM      : 1;            /*!< Transmit FIFO overflow interrupt mask                                     */
      __IOM uint32_t RXUIM      : 1;            /*!< Receive FIFO underflow interrupt mask                                     */
      __IOM uint32_t RXOIM      : 1;            /*!< Receive FIFO overflow interrupt mask                                      */
      __IOM uint32_t RXFIM      : 1;            /*!< Receive FIFO full interrupt mask                                          */
      __IOM uint32_t MSTIM      : 1;            /*!< Multi-master contention interrupt mask                                    */
            uint32_t            : 26;
    } IMR_b;
  } ;

  union {
    __IOM uint32_t ISR;                         /*!< Interrupt status                                                          */

    struct {
      __IM  uint32_t TXEIS      : 1;            /*!< Transmit FIFO empty interrupt status                                      */
      __IM  uint32_t TXOIS      : 1;            /*!< Transmit FIFO overflow interrupt status                                   */
      __IM  uint32_t RXUIS      : 1;            /*!< Receive FIFO underflow interrupt status                                   */
      __IM  uint32_t RXOIS      : 1;            /*!< Receive FIFO overflow interrupt status                                    */
      __IM  uint32_t RXFIS      : 1;            /*!< Receive FIFO full interrupt status                                        */
      __IM  uint32_t MSTIS      : 1;            /*!< Multi-master contention interrupt status                                  */
            uint32_t            : 26;
    } ISR_b;
  } ;

  union {
    __IOM uint32_t RISR;                        /*!< Raw interrupt status                                                      */

    struct {
      __IM  uint32_t TXEIR      : 1;            /*!< Transmit FIFO empty raw interrupt status                                  */
      __IM  uint32_t TXOIR      : 1;            /*!< Transmit FIFO overflow raw interrupt status                               */
      __IM  uint32_t RXUIR      : 1;            /*!< Receive FIFO underflow raw interrupt status                               */
      __IM  uint32_t RXOIR      : 1;            /*!< Receive FIFO overflow raw interrupt status                                */
      __IM  uint32_t RXFIR      : 1;            /*!< Receive FIFO full raw interrupt status                                    */
      __IM  uint32_t MSTIR      : 1;            /*!< Multi-master contention raw interrupt status                              */
            uint32_t            : 26;
    } RISR_b;
  } ;

  union {
    __IOM uint32_t TXOICR;                      /*!< TX FIFO overflow interrupt clear                                          */

    struct {
      __IM  uint32_t TXOICR     : 1;            /*!< Clear-on-read transmit FIFO overflow interrupt                            */
            uint32_t            : 31;
    } TXOICR_b;
  } ;

  union {
    __IOM uint32_t RXOICR;                      /*!< RX FIFO overflow interrupt clear                                          */

    struct {
      __IM  uint32_t RXOICR     : 1;            /*!< Clear-on-read receive FIFO overflow interrupt                             */
            uint32_t            : 31;
    } RXOICR_b;
  } ;

  union {
    __IOM uint32_t RXUICR;                      /*!< RX FIFO underflow interrupt clear                                         */

    struct {
      __IM  uint32_t RXUICR     : 1;            /*!< Clear-on-read receive FIFO underflow interrupt                            */
            uint32_t            : 31;
    } RXUICR_b;
  } ;

  union {
    __IOM uint32_t MSTICR;                      /*!< Multi-master interrupt clear                                              */

    struct {
      __IM  uint32_t MSTICR     : 1;            /*!< Clear-on-read multi-master contention interrupt                           */
            uint32_t            : 31;
    } MSTICR_b;
  } ;

  union {
    __IOM uint32_t ICR;                         /*!< Interrupt clear                                                           */

    struct {
      __IM  uint32_t ICR        : 1;            /*!< Clear-on-read all active interrupts                                       */
            uint32_t            : 31;
    } ICR_b;
  } ;

  union {
    __IOM uint32_t DMACR;                       /*!< DMA control                                                               */

    struct {
      __IOM uint32_t RDMAE      : 1;            /*!< Receive DMA enable                                                        */
      __IOM uint32_t TDMAE      : 1;            /*!< Transmit DMA enable                                                       */
            uint32_t            : 30;
    } DMACR_b;
  } ;

  union {
    __IOM uint32_t DMATDLR;                     /*!< DMA TX data level                                                         */

    struct {
      __IOM uint32_t DMATDL     : 8;            /*!< Transmit data watermark level                                             */
            uint32_t            : 24;
    } DMATDLR_b;
  } ;

  union {
    __IOM uint32_t DMARDLR;                     /*!< DMA RX data level                                                         */

    struct {
      __IOM uint32_t DMARDL     : 8;            /*!< Receive data watermark level (DMARDLR+1)                                  */
            uint32_t            : 24;
    } DMARDLR_b;
  } ;

  union {
    __IOM uint32_t IDR;                         /*!< Identification register                                                   */

    struct {
      __IM  uint32_t IDCODE     : 32;           /*!< Peripheral dentification code                                             */
    } IDR_b;
  } ;

  union {
    __IOM uint32_t SSI_VERSION_ID;              /*!< Version ID                                                                */

