mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t SSI_COMP_VERSION : 32;     /*!< SNPS component version (format X.YY)                                      */
    } SSI_VERSION_ID_b;
  } ;

  union {
    __IOM uint32_t DR0;                         /*!< Data Register 0 (of 36)                                                   */

    struct {
      __IOM uint32_t DR         : 32;           /*!< First data register of 36                                                 */
    } DR0_b;
  } ;
  __IM  uint32_t  RESERVED[35];

  union {
    __IOM uint32_t RX_SAMPLE_DLY;               /*!< RX sample delay                                                           */

    struct {
      __IOM uint32_t RSD        : 8;            /*!< RXD sample delay (in SCLK cycles)                                         */
            uint32_t            : 24;
    } RX_SAMPLE_DLY_b;
  } ;

  union {
    __IOM uint32_t SPI_CTRLR0;                  /*!< SPI control                                                               */

    struct {
      __IOM uint32_t TRANS_TYPE : 2;            /*!< Address and instruction transfer format                                   */
      __IOM uint32_t ADDR_L     : 4;            /*!< Address length (0b-60b in 4b increments)                                  */
            uint32_t            : 2;
      __IOM uint32_t INST_L     : 2;            /*!< Instruction length (0/4/8/16b)                                            */
            uint32_t            : 1;
      __IOM uint32_t WAIT_CYCLES : 5;           /*!< Wait cycles between control frame transmit and data reception
                                                     (in SCLK cycles)                                                          */
      __IOM uint32_t SPI_DDR_EN : 1;            /*!< SPI DDR transfer enable                                                   */
      __IOM uint32_t INST_DDR_EN : 1;           /*!< Instruction DDR transfer enable                                           */
      __IOM uint32_t SPI_RXDS_EN : 1;           /*!< Read data strobe enable                                                   */
            uint32_t            : 5;
      __IOM uint32_t XIP_CMD    : 8;            /*!< SPI Command to send in XIP mode (INST_L = 8-bit) or to append
                                                     to Address (INST_L = 0-bit)                                               */
    } SPI_CTRLR0_b;
  } ;

  union {
    __IOM uint32_t TXD_DRIVE_EDGE;              /*!< TX drive edge                                                             */

    struct {
      __IOM uint32_t TDE        : 8;            /*!< TXD drive edge                                                            */
            uint32_t            : 24;
    } TXD_DRIVE_EDGE_b;
  } ;
} XIP_SSI_Type;                                 /*!< Size = 252 (0xfc)                                                         */



/* =========================================================================================================================== */
/* ================                                          SYSINFO                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief SYSINFO (SYSINFO)
  */

typedef struct {                                /*!< SYSINFO Structure                                                         */

  union {
    __IOM uint32_t CHIP_ID;                     /*!< JEDEC JEP-106 compliant chip identifier.                                  */

    struct {
      __IM  uint32_t MANUFACTURER : 12;         /*!< MANUFACTURER                                                              */
      __IM  uint32_t PART       : 16;           /*!< PART                                                                      */
      __IM  uint32_t REVISION   : 4;            /*!< REVISION                                                                  */
    } CHIP_ID_b;
  } ;

  union {
    __IOM uint32_t PLATFORM;                    /*!< Platform register. Allows software to know what environment
                                                     it is running in.                                                         */

    struct {
      __IM  uint32_t FPGA       : 1;            /*!< FPGA                                                                      */
      __IM  uint32_t ASIC       : 1;            /*!< ASIC                                                                      */
            uint32_t            : 30;
    } PLATFORM_b;
  } ;
  __IM  uint32_t  RESERVED[14];
  __IM  uint32_t  GITREF_RP2040;                /*!< Git hash of the chip source. Used to identify chip version.               */
} SYSINFO_Type;                                 /*!< Size = 68 (0x44)                                                          */



/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Register block for various chip control signals (SYSCFG)
  */

typedef struct {                                /*!< SYSCFG Structure                                                          */
  __IOM uint32_t  PROC0_NMI_MASK;               /*!< Processor core 0 NMI source mask
                                                     Set a bit high to enable NMI from that IRQ                                */
  __IOM uint32_t  PROC1_NMI_MASK;               /*!< Processor core 1 NMI source mask
                                                     Set a bit high to enable NMI from that IRQ                                */

  union {
    __IOM uint32_t PROC_CONFIG;                 /*!< Configuration for processors                                              */

