mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t PROC0_HALTED : 1;          /*!< Indication that proc0 has halted                                          */
      __IM  uint32_t PROC1_HALTED : 1;          /*!< Indication that proc1 has halted                                          */
            uint32_t            : 22;
      __IOM uint32_t PROC0_DAP_INSTID : 4;      /*!< Configure proc0 DAP instance ID.
                                                     Recommend that this is NOT changed until you require debug
                                                     access in multi-chip environment
                                                     WARNING: do not set to 15 as this is reserved for RescueDP                */
      __IOM uint32_t PROC1_DAP_INSTID : 4;      /*!< Configure proc1 DAP instance ID.
                                                     Recommend that this is NOT changed until you require debug
                                                     access in multi-chip environment
                                                     WARNING: do not set to 15 as this is reserved for RescueDP                */
    } PROC_CONFIG_b;
  } ;

  union {
    __IOM uint32_t PROC_IN_SYNC_BYPASS;         /*!< For each bit, if 1, bypass the input synchronizer between that
                                                     GPIO
                                                     and the GPIO input register in the SIO. The input synchronizers
                                                     should
                                                     generally be unbypassed, to avoid injecting metastabilities
                                                     into processors.
                                                     If you're feeling brave, you can bypass to save two cycles
                                                     of input
                                                     latency. This register applies to GPIO 0...29.                            */

    struct {
      __IOM uint32_t PROC_IN_SYNC_BYPASS : 30;  /*!< PROC_IN_SYNC_BYPASS                                                       */
            uint32_t            : 2;
    } PROC_IN_SYNC_BYPASS_b;
  } ;

  union {
    __IOM uint32_t PROC_IN_SYNC_BYPASS_HI;      /*!< For each bit, if 1, bypass the input synchronizer between that
                                                     GPIO
                                                     and the GPIO input register in the SIO. The input synchronizers
                                                     should
                                                     generally be unbypassed, to avoid injecting metastabilities
                                                     into processors.
                                                     If you're feeling brave, you can bypass to save two cycles
                                                     of input
                                                     latency. This register applies to GPIO 30...35 (the QSPI
                                                     IOs).                                                                     */

    struct {
      __IOM uint32_t PROC_IN_SYNC_BYPASS_HI : 6;/*!< PROC_IN_SYNC_BYPASS_HI                                                    */
            uint32_t            : 26;
    } PROC_IN_SYNC_BYPASS_HI_b;
  } ;

  union {
    __IOM uint32_t DBGFORCE;                    /*!< Directly control the SWD debug port of either processor                   */

    struct {
      __IM  uint32_t PROC0_SWDO : 1;            /*!< Observe the value of processor 0 SWDIO output.                            */
      __IOM uint32_t PROC0_SWDI : 1;            /*!< Directly drive processor 0 SWDIO input, if PROC0_ATTACH is set            */
      __IOM uint32_t PROC0_SWCLK : 1;           /*!< Directly drive processor 0 SWCLK, if PROC0_ATTACH is set                  */
      __IOM uint32_t PROC0_ATTACH : 1;          /*!< Attach processor 0 debug port to syscfg controls, and disconnect
                                                     it from external SWD pads.                                                */
      __IM  uint32_t PROC1_SWDO : 1;            /*!< Observe the value of processor 1 SWDIO output.                            */
      __IOM uint32_t PROC1_SWDI : 1;            /*!< Directly drive processor 1 SWDIO input, if PROC1_ATTACH is set            */
      __IOM uint32_t PROC1_SWCLK : 1;           /*!< Directly drive processor 1 SWCLK, if PROC1_ATTACH is set                  */
      __IOM uint32_t PROC1_ATTACH : 1;          /*!< Attach processor 1 debug port to syscfg controls, and disconnect
                                                     it from external SWD pads.                                                */
            uint32_t            : 24;
    } DBGFORCE_b;
  } ;

  union {
    __IOM uint32_t MEMPOWERDOWN;                /*!< Control power downs to memories. Set high to power down memories.
                                                     Use with extreme caution                                                  */

    struct {
      __IOM uint32_t SRAM0      : 1;            /*!< SRAM0                                                                     */
      __IOM uint32_t SRAM1      : 1;            /*!< SRAM1                                                                     */
      __IOM uint32_t SRAM2      : 1;            /*!< SRAM2                                                                     */
      __IOM uint32_t SRAM3      : 1;            /*!< SRAM3                                                                     */
      __IOM uint32_t SRAM4      : 1;            /*!< SRAM4                                                                     */
      __IOM uint32_t SRAM5      : 1;            /*!< SRAM5                                                                     */
      __IOM uint32_t USB        : 1;            /*!< USB                                                                       */
      __IOM uint32_t ROM        : 1;            /*!< ROM                                                                       */
            uint32_t            : 24;
    } MEMPOWERDOWN_b;
  } ;
} SYSCFG_Type;                                  /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                          CLOCKS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief CLOCKS (CLOCKS)
  */

typedef struct {                                /*!< CLOCKS Structure                                                          */

  union {
    __IOM uint32_t CLK_GPOUT0_CTRL;             /*!< Clock control, can be changed on-the-fly (except for auxsrc)              */

