mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
            uint32_t            : 5;
      __IOM uint32_t AUXSRC     : 4;            /*!< Selects the auxiliary clock source, will glitch when switching            */
            uint32_t            : 1;
      __IOM uint32_t KILL       : 1;            /*!< Asynchronously kills the clock generator                                  */
      __IOM uint32_t ENABLE     : 1;            /*!< Starts and stops the clock generator cleanly                              */
      __IOM uint32_t DC50       : 1;            /*!< Enables duty cycle correction for odd divisors                            */
            uint32_t            : 3;
      __IOM uint32_t PHASE      : 2;            /*!< This delays the enable signal by up to 3 cycles of the input
                                                     clock
                                                     This must be set before the clock is enabled to have any
                                                     effect                                                                    */
            uint32_t            : 2;
      __IOM uint32_t NUDGE      : 1;            /*!< An edge on this signal shifts the phase of the output by 1 cycle
                                                     of the input clock
                                                     This can be done at any time                                              */
            uint32_t            : 11;
    } CLK_GPOUT0_CTRL_b;
  } ;

  union {
    __IOM uint32_t CLK_GPOUT0_DIV;              /*!< Clock divisor, can be changed on-the-fly                                  */

    struct {
      __IOM uint32_t FRAC       : 8;            /*!< Fractional component of the divisor                                       */
      __IOM uint32_t INT        : 24;           /*!< Integer component of the divisor, 0 -> divide by 2^16                     */
    } CLK_GPOUT0_DIV_b;
  } ;
  __IM  uint32_t  CLK_GPOUT0_SELECTED;          /*!< Indicates which SRC is currently selected by the glitchless
                                                     mux (one-hot).
                                                     This slice does not have a glitchless mux (only the AUX_SRC
                                                     field is present, not SRC) so this register is hardwired
                                                     to 0x1.                                                                   */

  union {
    __IOM uint32_t CLK_GPOUT1_CTRL;             /*!< Clock control, can be changed on-the-fly (except for auxsrc)              */

    struct {
            uint32_t            : 5;
      __IOM uint32_t AUXSRC     : 4;            /*!< Selects the auxiliary clock source, will glitch when switching            */
            uint32_t            : 1;
      __IOM uint32_t KILL       : 1;            /*!< Asynchronously kills the clock generator                                  */
      __IOM uint32_t ENABLE     : 1;            /*!< Starts and stops the clock generator cleanly                              */
      __IOM uint32_t DC50       : 1;            /*!< Enables duty cycle correction for odd divisors                            */
            uint32_t            : 3;
      __IOM uint32_t PHASE      : 2;            /*!< This delays the enable signal by up to 3 cycles of the input
                                                     clock
                                                     This must be set before the clock is enabled to have any
                                                     effect                                                                    */
            uint32_t            : 2;
      __IOM uint32_t NUDGE      : 1;            /*!< An edge on this signal shifts the phase of the output by 1 cycle
                                                     of the input clock
                                                     This can be done at any time                                              */
            uint32_t            : 11;
    } CLK_GPOUT1_CTRL_b;
  } ;

  union {
    __IOM uint32_t CLK_GPOUT1_DIV;              /*!< Clock divisor, can be changed on-the-fly                                  */

    struct {
      __IOM uint32_t FRAC       : 8;            /*!< Fractional component of the divisor                                       */
      __IOM uint32_t INT        : 24;           /*!< Integer component of the divisor, 0 -> divide by 2^16                     */
    } CLK_GPOUT1_DIV_b;
  } ;
  __IM  uint32_t  CLK_GPOUT1_SELECTED;          /*!< Indicates which SRC is currently selected by the glitchless
                                                     mux (one-hot).
                                                     This slice does not have a glitchless mux (only the AUX_SRC
                                                     field is present, not SRC) so this register is hardwired
                                                     to 0x1.                                                                   */

  union {
    __IOM uint32_t CLK_GPOUT2_CTRL;             /*!< Clock control, can be changed on-the-fly (except for auxsrc)              */

    struct {
            uint32_t            : 5;
      __IOM uint32_t AUXSRC     : 4;            /*!< Selects the auxiliary clock source, will glitch when switching            */
            uint32_t            : 1;
      __IOM uint32_t KILL       : 1;            /*!< Asynchronously kills the clock generator                                  */
      __IOM uint32_t ENABLE     : 1;            /*!< Starts and stops the clock generator cleanly                              */
      __IOM uint32_t DC50       : 1;            /*!< Enables duty cycle correction for odd divisors                            */
            uint32_t            : 3;
      __IOM uint32_t PHASE      : 2;            /*!< This delays the enable signal by up to 3 cycles of the input
                                                     clock
                                                     This must be set before the clock is enabled to have any
                                                     effect                                                                    */
            uint32_t            : 2;
      __IOM uint32_t NUDGE      : 1;            /*!< An edge on this signal shifts the phase of the output by 1 cycle
                                                     of the input clock
                                                     This can be done at any time                                              */
            uint32_t            : 11;
    } CLK_GPOUT2_CTRL_b;
  } ;

  union {
    __IOM uint32_t CLK_GPOUT2_DIV;              /*!< Clock divisor, can be changed on-the-fly                                  */

