mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t FRAC       : 8;            /*!< Fractional component of the divisor                                       */
      __IOM uint32_t INT        : 24;           /*!< Integer component of the divisor, 0 -> divide by 2^16                     */
    } CLK_SYS_DIV_b;
  } ;
  __IM  uint32_t  CLK_SYS_SELECTED;             /*!< Indicates which SRC is currently selected by the glitchless
                                                     mux (one-hot).
                                                     The glitchless multiplexer does not switch instantaneously
                                                     (to avoid glitches), so software should poll this register
                                                     to wait for the switch to complete. This register contains
                                                     one decoded bit for each of the clock sources enumerated
                                                     in the CTRL SRC field. At most one of these bits will be
                                                     set at any time, indicating that clock is currently present
                                                     at the output of the glitchless mux. Whilst switching is
                                                     in progress, this register may briefly show all-0s.                       */

  union {
    __IOM uint32_t CLK_PERI_CTRL;               /*!< Clock control, can be changed on-the-fly (except for auxsrc)              */

    struct {
            uint32_t            : 5;
      __IOM uint32_t AUXSRC     : 3;            /*!< Selects the auxiliary clock source, will glitch when switching            */
            uint32_t            : 2;
      __IOM uint32_t KILL       : 1;            /*!< Asynchronously kills the clock generator                                  */
      __IOM uint32_t ENABLE     : 1;            /*!< Starts and stops the clock generator cleanly                              */
            uint32_t            : 20;
    } CLK_PERI_CTRL_b;
  } ;
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  CLK_PERI_SELECTED;            /*!< Indicates which SRC is currently selected by the glitchless
                                                     mux (one-hot).
                                                     This slice does not have a glitchless mux (only the AUX_SRC
                                                     field is present, not SRC) so this register is hardwired
                                                     to 0x1.                                                                   */

  union {
    __IOM uint32_t CLK_USB_CTRL;                /*!< Clock control, can be changed on-the-fly (except for auxsrc)              */

    struct {
            uint32_t            : 5;
      __IOM uint32_t AUXSRC     : 3;            /*!< Selects the auxiliary clock source, will glitch when switching            */
            uint32_t            : 2;
      __IOM uint32_t KILL       : 1;            /*!< Asynchronously kills the clock generator                                  */
      __IOM uint32_t ENABLE     : 1;            /*!< Starts and stops the clock generator cleanly                              */
            uint32_t            : 4;
      __IOM uint32_t PHASE      : 2;            /*!< This delays the enable signal by up to 3 cycles of the input
                                                     clock
                                                     This must be set before the clock is enabled to have any
                                                     effect                                                                    */
            uint32_t            : 2;
      __IOM uint32_t NUDGE      : 1;            /*!< An edge on this signal shifts the phase of the output by 1 cycle
                                                     of the input clock
                                                     This can be done at any time                                              */
            uint32_t            : 11;
    } CLK_USB_CTRL_b;
  } ;

  union {
    __IOM uint32_t CLK_USB_DIV;                 /*!< Clock divisor, can be changed on-the-fly                                  */

    struct {
            uint32_t            : 8;
      __IOM uint32_t INT        : 2;            /*!< Integer component of the divisor, 0 -> divide by 2^16                     */
            uint32_t            : 22;
    } CLK_USB_DIV_b;
  } ;
  __IM  uint32_t  CLK_USB_SELECTED;             /*!< Indicates which SRC is currently selected by the glitchless
                                                     mux (one-hot).
                                                     This slice does not have a glitchless mux (only the AUX_SRC
                                                     field is present, not SRC) so this register is hardwired
                                                     to 0x1.                                                                   */

  union {
    __IOM uint32_t CLK_ADC_CTRL;                /*!< Clock control, can be changed on-the-fly (except for auxsrc)              */

    struct {
            uint32_t            : 5;
      __IOM uint32_t AUXSRC     : 3;            /*!< Selects the auxiliary clock source, will glitch when switching            */
            uint32_t            : 2;
      __IOM uint32_t KILL       : 1;            /*!< Asynchronously kills the clock generator                                  */
      __IOM uint32_t ENABLE     : 1;            /*!< Starts and stops the clock generator cleanly                              */
            uint32_t            : 4;
      __IOM uint32_t PHASE      : 2;            /*!< This delays the enable signal by up to 3 cycles of the input
                                                     clock
                                                     This must be set before the clock is enabled to have any
                                                     effect                                                                    */
            uint32_t            : 2;
      __IOM uint32_t NUDGE      : 1;            /*!< An edge on this signal shifts the phase of the output by 1 cycle
                                                     of the input clock
                                                     This can be done at any time                                              */
            uint32_t            : 11;
    } CLK_ADC_CTRL_b;
  } ;

  union {
    __IOM uint32_t CLK_ADC_DIV;                 /*!< Clock divisor, can be changed on-the-fly                                  */

