mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t INT        : 2;            /*!< Integer component of the divisor, 0 -> divide by 2^16                     */
            uint32_t            : 22;
    } CLK_ADC_DIV_b;
  } ;
  __IM  uint32_t  CLK_ADC_SELECTED;             /*!< Indicates which SRC is currently selected by the glitchless
                                                     mux (one-hot).
                                                     This slice does not have a glitchless mux (only the AUX_SRC
                                                     field is present, not SRC) so this register is hardwired
                                                     to 0x1.                                                                   */

  union {
    __IOM uint32_t CLK_RTC_CTRL;                /*!< Clock control, can be changed on-the-fly (except for auxsrc)              */

    struct {
            uint32_t            : 5;
      __IOM uint32_t AUXSRC     : 3;            /*!< Selects the auxiliary clock source, will glitch when switching            */
            uint32_t            : 2;
      __IOM uint32_t KILL       : 1;            /*!< Asynchronously kills the clock generator                                  */
      __IOM uint32_t ENABLE     : 1;            /*!< Starts and stops the clock generator cleanly                              */
            uint32_t            : 4;
      __IOM uint32_t PHASE      : 2;            /*!< This delays the enable signal by up to 3 cycles of the input
                                                     clock
                                                     This must be set before the clock is enabled to have any
                                                     effect                                                                    */
            uint32_t            : 2;
      __IOM uint32_t NUDGE      : 1;            /*!< An edge on this signal shifts the phase of the output by 1 cycle
                                                     of the input clock
                                                     This can be done at any time                                              */
            uint32_t            : 11;
    } CLK_RTC_CTRL_b;
  } ;

  union {
    __IOM uint32_t CLK_RTC_DIV;                 /*!< Clock divisor, can be changed on-the-fly                                  */

    struct {
      __IOM uint32_t FRAC       : 8;            /*!< Fractional component of the divisor                                       */
      __IOM uint32_t INT        : 24;           /*!< Integer component of the divisor, 0 -> divide by 2^16                     */
    } CLK_RTC_DIV_b;
  } ;
  __IM  uint32_t  CLK_RTC_SELECTED;             /*!< Indicates which SRC is currently selected by the glitchless
                                                     mux (one-hot).
                                                     This slice does not have a glitchless mux (only the AUX_SRC
                                                     field is present, not SRC) so this register is hardwired
                                                     to 0x1.                                                                   */

  union {
    __IOM uint32_t CLK_SYS_RESUS_CTRL;          /*!< CLK_SYS_RESUS_CTRL                                                        */

    struct {
      __IOM uint32_t TIMEOUT    : 8;            /*!< This is expressed as a number of clk_ref cycles
                                                     and must be >= 2x clk_ref_freq/min_clk_tst_freq                           */
      __IOM uint32_t ENABLE     : 1;            /*!< Enable resus                                                              */
            uint32_t            : 3;
      __IOM uint32_t FRCE       : 1;            /*!< Force a resus, for test purposes only                                     */
            uint32_t            : 3;
      __IOM uint32_t CLEAR      : 1;            /*!< For clearing the resus after the fault that triggered it has
                                                     been corrected                                                            */
            uint32_t            : 15;
    } CLK_SYS_RESUS_CTRL_b;
  } ;

  union {
    __IOM uint32_t CLK_SYS_RESUS_STATUS;        /*!< CLK_SYS_RESUS_STATUS                                                      */

    struct {
      __IM  uint32_t RESUSSED   : 1;            /*!< Clock has been resuscitated, correct the error then send ctrl_clear=1     */
            uint32_t            : 31;
    } CLK_SYS_RESUS_STATUS_b;
  } ;

  union {
    __IOM uint32_t FC0_REF_KHZ;                 /*!< Reference clock frequency in kHz                                          */

    struct {
      __IOM uint32_t FC0_REF_KHZ : 20;          /*!< FC0_REF_KHZ                                                               */
            uint32_t            : 12;
    } FC0_REF_KHZ_b;
  } ;

  union {
    __IOM uint32_t FC0_MIN_KHZ;                 /*!< Minimum pass frequency in kHz. This is optional. Set to 0 if
                                                     you are not using the pass/fail flags                                     */

    struct {
      __IOM uint32_t FC0_MIN_KHZ : 25;          /*!< FC0_MIN_KHZ                                                               */
            uint32_t            : 7;
    } FC0_MIN_KHZ_b;
  } ;

  union {
    __IOM uint32_t FC0_MAX_KHZ;                 /*!< Maximum pass frequency in kHz. This is optional. Set to 0x1ffffff
                                                     if you are not using the pass/fail flags                                  */

    struct {
      __IOM uint32_t FC0_MAX_KHZ : 25;          /*!< FC0_MAX_KHZ                                                               */
            uint32_t            : 7;
    } FC0_MAX_KHZ_b;
  } ;

  union {
    __IOM uint32_t FC0_DELAY;                   /*!< Delays the start of frequency counting to allow the mux to settle
                                                     Delay is measured in multiples of the reference clock period              */

