mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t FC0_DELAY  : 3;            /*!< FC0_DELAY                                                                 */
            uint32_t            : 29;
    } FC0_DELAY_b;
  } ;

  union {
    __IOM uint32_t FC0_INTERVAL;                /*!< The test interval is 0.98us * 2**interval, but let's call it
                                                     1us * 2**interval
                                                     The default gives a test interval of 250us                                */

    struct {
      __IOM uint32_t FC0_INTERVAL : 4;          /*!< FC0_INTERVAL                                                              */
            uint32_t            : 28;
    } FC0_INTERVAL_b;
  } ;

  union {
    __IOM uint32_t FC0_SRC;                     /*!< Clock sent to frequency counter, set to 0 when not required
                                                     Writing to this register initiates the frequency count                    */

    struct {
      __IOM uint32_t FC0_SRC    : 8;            /*!< FC0_SRC                                                                   */
            uint32_t            : 24;
    } FC0_SRC_b;
  } ;

  union {
    __IOM uint32_t FC0_STATUS;                  /*!< Frequency counter status                                                  */

    struct {
      __IM  uint32_t PASS       : 1;            /*!< Test passed                                                               */
            uint32_t            : 3;
      __IM  uint32_t DONE       : 1;            /*!< Test complete                                                             */
            uint32_t            : 3;
      __IM  uint32_t RUNNING    : 1;            /*!< Test running                                                              */
            uint32_t            : 3;
      __IM  uint32_t WAITING    : 1;            /*!< Waiting for test clock to start                                           */
            uint32_t            : 3;
      __IM  uint32_t FAIL       : 1;            /*!< Test failed                                                               */
            uint32_t            : 3;
      __IM  uint32_t SLOW       : 1;            /*!< Test clock slower than expected, only valid when status_done=1            */
            uint32_t            : 3;
      __IM  uint32_t FAST       : 1;            /*!< Test clock faster than expected, only valid when status_done=1            */
            uint32_t            : 3;
      __IM  uint32_t DIED       : 1;            /*!< Test clock stopped during test                                            */
            uint32_t            : 3;
    } FC0_STATUS_b;
  } ;

  union {
    __IOM uint32_t FC0_RESULT;                  /*!< Result of frequency measurement, only valid when status_done=1            */

    struct {
      __IM  uint32_t FRAC       : 5;            /*!< FRAC                                                                      */
      __IM  uint32_t KHZ        : 25;           /*!< KHZ                                                                       */
            uint32_t            : 2;
    } FC0_RESULT_b;
  } ;

  union {
    __IOM uint32_t WAKE_EN0;                    /*!< enable clock in wake mode                                                 */

    struct {
      __IOM uint32_t clk_sys_clocks : 1;        /*!< clk_sys_clocks                                                            */
      __IOM uint32_t clk_adc_adc : 1;           /*!< clk_adc_adc                                                               */
      __IOM uint32_t clk_sys_adc : 1;           /*!< clk_sys_adc                                                               */
      __IOM uint32_t clk_sys_busctrl : 1;       /*!< clk_sys_busctrl                                                           */
      __IOM uint32_t clk_sys_busfabric : 1;     /*!< clk_sys_busfabric                                                         */
      __IOM uint32_t clk_sys_dma : 1;           /*!< clk_sys_dma                                                               */
      __IOM uint32_t clk_sys_i2c0 : 1;          /*!< clk_sys_i2c0                                                              */
      __IOM uint32_t clk_sys_i2c1 : 1;          /*!< clk_sys_i2c1                                                              */
      __IOM uint32_t clk_sys_io : 1;            /*!< clk_sys_io                                                                */
      __IOM uint32_t clk_sys_jtag : 1;          /*!< clk_sys_jtag                                                              */
      __IOM uint32_t clk_sys_vreg_and_chip_reset : 1;/*!< clk_sys_vreg_and_chip_reset                                          */
      __IOM uint32_t clk_sys_pads : 1;          /*!< clk_sys_pads                                                              */
      __IOM uint32_t clk_sys_pio0 : 1;          /*!< clk_sys_pio0                                                              */
      __IOM uint32_t clk_sys_pio1 : 1;          /*!< clk_sys_pio1                                                              */
      __IOM uint32_t clk_sys_pll_sys : 1;       /*!< clk_sys_pll_sys                                                           */
      __IOM uint32_t clk_sys_pll_usb : 1;       /*!< clk_sys_pll_usb                                                           */
      __IOM uint32_t clk_sys_psm : 1;           /*!< clk_sys_psm                                                               */
      __IOM uint32_t clk_sys_pwm : 1;           /*!< clk_sys_pwm                                                               */
      __IOM uint32_t clk_sys_resets : 1;        /*!< clk_sys_resets                                                            */
      __IOM uint32_t clk_sys_rom : 1;           /*!< clk_sys_rom                                                               */
      __IOM uint32_t clk_sys_rosc : 1;          /*!< clk_sys_rosc                                                              */
      __IOM uint32_t clk_rtc_rtc : 1;           /*!< clk_rtc_rtc                                                               */
      __IOM uint32_t clk_sys_rtc : 1;           /*!< clk_sys_rtc                                                               */
      __IOM uint32_t clk_sys_sio : 1;           /*!< clk_sys_sio                                                               */
      __IOM uint32_t clk_peri_spi0 : 1;         /*!< clk_peri_spi0                                                             */
      __IOM uint32_t clk_sys_spi0 : 1;          /*!< clk_sys_spi0                                                              */
      __IOM uint32_t clk_peri_spi1 : 1;         /*!< clk_peri_spi1                                                             */
      __IOM uint32_t clk_sys_spi1 : 1;          /*!< clk_sys_spi1                                                              */
      __IOM uint32_t clk_sys_sram0 : 1;         /*!< clk_sys_sram0                                                             */
      __IOM uint32_t clk_sys_sram1 : 1;         /*!< clk_sys_sram1                                                             */
      __IOM uint32_t clk_sys_sram2 : 1;         /*!< clk_sys_sram2                                                             */
      __IOM uint32_t clk_sys_sram3 : 1;         /*!< clk_sys_sram3                                                             */
    } WAKE_EN0_b;
  } ;

  union {
    __IOM uint32_t WAKE_EN1;                    /*!< enable clock in wake mode                                                 */

