mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t clk_sys_sram4 : 1;         /*!< clk_sys_sram4                                                             */
      __IOM uint32_t clk_sys_sram5 : 1;         /*!< clk_sys_sram5                                                             */
      __IOM uint32_t clk_sys_syscfg : 1;        /*!< clk_sys_syscfg                                                            */
      __IOM uint32_t clk_sys_sysinfo : 1;       /*!< clk_sys_sysinfo                                                           */
      __IOM uint32_t clk_sys_tbman : 1;         /*!< clk_sys_tbman                                                             */
      __IOM uint32_t clk_sys_timer : 1;         /*!< clk_sys_timer                                                             */
      __IOM uint32_t clk_peri_uart0 : 1;        /*!< clk_peri_uart0                                                            */
      __IOM uint32_t clk_sys_uart0 : 1;         /*!< clk_sys_uart0                                                             */
      __IOM uint32_t clk_peri_uart1 : 1;        /*!< clk_peri_uart1                                                            */
      __IOM uint32_t clk_sys_uart1 : 1;         /*!< clk_sys_uart1                                                             */
      __IOM uint32_t clk_sys_usbctrl : 1;       /*!< clk_sys_usbctrl                                                           */
      __IOM uint32_t clk_usb_usbctrl : 1;       /*!< clk_usb_usbctrl                                                           */
      __IOM uint32_t clk_sys_watchdog : 1;      /*!< clk_sys_watchdog                                                          */
      __IOM uint32_t clk_sys_xip : 1;           /*!< clk_sys_xip                                                               */
      __IOM uint32_t clk_sys_xosc : 1;          /*!< clk_sys_xosc                                                              */
            uint32_t            : 17;
    } WAKE_EN1_b;
  } ;

  union {
    __IOM uint32_t SLEEP_EN0;                   /*!< enable clock in sleep mode                                                */

    struct {
      __IOM uint32_t clk_sys_clocks : 1;        /*!< clk_sys_clocks                                                            */
      __IOM uint32_t clk_adc_adc : 1;           /*!< clk_adc_adc                                                               */
      __IOM uint32_t clk_sys_adc : 1;           /*!< clk_sys_adc                                                               */
      __IOM uint32_t clk_sys_busctrl : 1;       /*!< clk_sys_busctrl                                                           */
      __IOM uint32_t clk_sys_busfabric : 1;     /*!< clk_sys_busfabric                                                         */
      __IOM uint32_t clk_sys_dma : 1;           /*!< clk_sys_dma                                                               */
      __IOM uint32_t clk_sys_i2c0 : 1;          /*!< clk_sys_i2c0                                                              */
      __IOM uint32_t clk_sys_i2c1 : 1;          /*!< clk_sys_i2c1                                                              */
      __IOM uint32_t clk_sys_io : 1;            /*!< clk_sys_io                                                                */
      __IOM uint32_t clk_sys_jtag : 1;          /*!< clk_sys_jtag                                                              */
      __IOM uint32_t clk_sys_vreg_and_chip_reset : 1;/*!< clk_sys_vreg_and_chip_reset                                          */
      __IOM uint32_t clk_sys_pads : 1;          /*!< clk_sys_pads                                                              */
      __IOM uint32_t clk_sys_pio0 : 1;          /*!< clk_sys_pio0                                                              */
      __IOM uint32_t clk_sys_pio1 : 1;          /*!< clk_sys_pio1                                                              */
      __IOM uint32_t clk_sys_pll_sys : 1;       /*!< clk_sys_pll_sys                                                           */
      __IOM uint32_t clk_sys_pll_usb : 1;       /*!< clk_sys_pll_usb                                                           */
      __IOM uint32_t clk_sys_psm : 1;           /*!< clk_sys_psm                                                               */
      __IOM uint32_t clk_sys_pwm : 1;           /*!< clk_sys_pwm                                                               */
      __IOM uint32_t clk_sys_resets : 1;        /*!< clk_sys_resets                                                            */
      __IOM uint32_t clk_sys_rom : 1;           /*!< clk_sys_rom                                                               */
      __IOM uint32_t clk_sys_rosc : 1;          /*!< clk_sys_rosc                                                              */
      __IOM uint32_t clk_rtc_rtc : 1;           /*!< clk_rtc_rtc                                                               */
      __IOM uint32_t clk_sys_rtc : 1;           /*!< clk_sys_rtc                                                               */
      __IOM uint32_t clk_sys_sio : 1;           /*!< clk_sys_sio                                                               */
      __IOM uint32_t clk_peri_spi0 : 1;         /*!< clk_peri_spi0                                                             */
      __IOM uint32_t clk_sys_spi0 : 1;          /*!< clk_sys_spi0                                                              */
      __IOM uint32_t clk_peri_spi1 : 1;         /*!< clk_peri_spi1                                                             */
      __IOM uint32_t clk_sys_spi1 : 1;          /*!< clk_sys_spi1                                                              */
      __IOM uint32_t clk_sys_sram0 : 1;         /*!< clk_sys_sram0                                                             */
      __IOM uint32_t clk_sys_sram1 : 1;         /*!< clk_sys_sram1                                                             */
      __IOM uint32_t clk_sys_sram2 : 1;         /*!< clk_sys_sram2                                                             */
      __IOM uint32_t clk_sys_sram3 : 1;         /*!< clk_sys_sram3                                                             */
    } SLEEP_EN0_b;
  } ;

  union {
    __IOM uint32_t SLEEP_EN1;                   /*!< enable clock in sleep mode                                                */

