mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t clk_sys_sram4 : 1;         /*!< clk_sys_sram4                                                             */
      __IM  uint32_t clk_sys_sram5 : 1;         /*!< clk_sys_sram5                                                             */
      __IM  uint32_t clk_sys_syscfg : 1;        /*!< clk_sys_syscfg                                                            */
      __IM  uint32_t clk_sys_sysinfo : 1;       /*!< clk_sys_sysinfo                                                           */
      __IM  uint32_t clk_sys_tbman : 1;         /*!< clk_sys_tbman                                                             */
      __IM  uint32_t clk_sys_timer : 1;         /*!< clk_sys_timer                                                             */
      __IM  uint32_t clk_peri_uart0 : 1;        /*!< clk_peri_uart0                                                            */
      __IM  uint32_t clk_sys_uart0 : 1;         /*!< clk_sys_uart0                                                             */
      __IM  uint32_t clk_peri_uart1 : 1;        /*!< clk_peri_uart1                                                            */
      __IM  uint32_t clk_sys_uart1 : 1;         /*!< clk_sys_uart1                                                             */
      __IM  uint32_t clk_sys_usbctrl : 1;       /*!< clk_sys_usbctrl                                                           */
      __IM  uint32_t clk_usb_usbctrl : 1;       /*!< clk_usb_usbctrl                                                           */
      __IM  uint32_t clk_sys_watchdog : 1;      /*!< clk_sys_watchdog                                                          */
      __IM  uint32_t clk_sys_xip : 1;           /*!< clk_sys_xip                                                               */
      __IM  uint32_t clk_sys_xosc : 1;          /*!< clk_sys_xosc                                                              */
            uint32_t            : 17;
    } ENABLED1_b;
  } ;

  union {
    __IOM uint32_t INTR;                        /*!< Raw Interrupts                                                            */

    struct {
      __IM  uint32_t CLK_SYS_RESUS : 1;         /*!< CLK_SYS_RESUS                                                             */
            uint32_t            : 31;
    } INTR_b;
  } ;

  union {
    __IOM uint32_t INTE;                        /*!< Interrupt Enable                                                          */

    struct {
      __IOM uint32_t CLK_SYS_RESUS : 1;         /*!< CLK_SYS_RESUS                                                             */
            uint32_t            : 31;
    } INTE_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< Interrupt Force                                                           */

    struct {
      __IOM uint32_t CLK_SYS_RESUS : 1;         /*!< CLK_SYS_RESUS                                                             */
            uint32_t            : 31;
    } INTF_b;
  } ;

  union {
    __IOM uint32_t INTS;                        /*!< Interrupt status after masking & forcing                                  */

    struct {
      __IM  uint32_t CLK_SYS_RESUS : 1;         /*!< CLK_SYS_RESUS                                                             */
            uint32_t            : 31;
    } INTS_b;
  } ;
} CLOCKS_Type;                                  /*!< Size = 200 (0xc8)                                                         */



/* =========================================================================================================================== */
/* ================                                          RESETS                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief RESETS (RESETS)
  */

typedef struct {                                /*!< RESETS Structure                                                          */

  union {
    __IOM uint32_t RESET;                       /*!< Reset control. If a bit is set it means the peripheral is in
                                                     reset. 0 means the peripheral's reset is deasserted.                      */

    struct {
      __IOM uint32_t adc        : 1;            /*!< adc                                                                       */
      __IOM uint32_t busctrl    : 1;            /*!< busctrl                                                                   */
      __IOM uint32_t dma        : 1;            /*!< dma                                                                       */
      __IOM uint32_t i2c0       : 1;            /*!< i2c0                                                                      */
      __IOM uint32_t i2c1       : 1;            /*!< i2c1                                                                      */
      __IOM uint32_t io_bank0   : 1;            /*!< io_bank0                                                                  */
      __IOM uint32_t io_qspi    : 1;            /*!< io_qspi                                                                   */
      __IOM uint32_t jtag       : 1;            /*!< jtag                                                                      */
      __IOM uint32_t pads_bank0 : 1;            /*!< pads_bank0                                                                */
      __IOM uint32_t pads_qspi  : 1;            /*!< pads_qspi                                                                 */
      __IOM uint32_t pio0       : 1;            /*!< pio0                                                                      */
      __IOM uint32_t pio1       : 1;            /*!< pio1                                                                      */
      __IOM uint32_t pll_sys    : 1;            /*!< pll_sys                                                                   */
      __IOM uint32_t pll_usb    : 1;            /*!< pll_usb                                                                   */
      __IOM uint32_t pwm        : 1;            /*!< pwm                                                                       */
      __IOM uint32_t rtc        : 1;            /*!< rtc                                                                       */
      __IOM uint32_t spi0       : 1;            /*!< spi0                                                                      */
      __IOM uint32_t spi1       : 1;            /*!< spi1                                                                      */
      __IOM uint32_t syscfg     : 1;            /*!< syscfg                                                                    */
      __IOM uint32_t sysinfo    : 1;            /*!< sysinfo                                                                   */
      __IOM uint32_t tbman      : 1;            /*!< tbman                                                                     */
      __IOM uint32_t timer      : 1;            /*!< timer                                                                     */
      __IOM uint32_t uart0      : 1;            /*!< uart0                                                                     */
      __IOM uint32_t uart1      : 1;            /*!< uart1                                                                     */
      __IOM uint32_t usbctrl    : 1;            /*!< usbctrl                                                                   */
            uint32_t            : 7;
    } RESET_b;
  } ;

  union {
    __IOM uint32_t WDSEL;                       /*!< Watchdog select. If a bit is set then the watchdog will reset
                                                     this peripheral when the watchdog fires.                                  */

