mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t adc        : 1;            /*!< adc                                                                       */
      __IOM uint32_t busctrl    : 1;            /*!< busctrl                                                                   */
      __IOM uint32_t dma        : 1;            /*!< dma                                                                       */
      __IOM uint32_t i2c0       : 1;            /*!< i2c0                                                                      */
      __IOM uint32_t i2c1       : 1;            /*!< i2c1                                                                      */
      __IOM uint32_t io_bank0   : 1;            /*!< io_bank0                                                                  */
      __IOM uint32_t io_qspi    : 1;            /*!< io_qspi                                                                   */
      __IOM uint32_t jtag       : 1;            /*!< jtag                                                                      */
      __IOM uint32_t pads_bank0 : 1;            /*!< pads_bank0                                                                */
      __IOM uint32_t pads_qspi  : 1;            /*!< pads_qspi                                                                 */
      __IOM uint32_t pio0       : 1;            /*!< pio0                                                                      */
      __IOM uint32_t pio1       : 1;            /*!< pio1                                                                      */
      __IOM uint32_t pll_sys    : 1;            /*!< pll_sys                                                                   */
      __IOM uint32_t pll_usb    : 1;            /*!< pll_usb                                                                   */
      __IOM uint32_t pwm        : 1;            /*!< pwm                                                                       */
      __IOM uint32_t rtc        : 1;            /*!< rtc                                                                       */
      __IOM uint32_t spi0       : 1;            /*!< spi0                                                                      */
      __IOM uint32_t spi1       : 1;            /*!< spi1                                                                      */
      __IOM uint32_t syscfg     : 1;            /*!< syscfg                                                                    */
      __IOM uint32_t sysinfo    : 1;            /*!< sysinfo                                                                   */
      __IOM uint32_t tbman      : 1;            /*!< tbman                                                                     */
      __IOM uint32_t timer      : 1;            /*!< timer                                                                     */
      __IOM uint32_t uart0      : 1;            /*!< uart0                                                                     */
      __IOM uint32_t uart1      : 1;            /*!< uart1                                                                     */
      __IOM uint32_t usbctrl    : 1;            /*!< usbctrl                                                                   */
            uint32_t            : 7;
    } WDSEL_b;
  } ;

  union {
    __IOM uint32_t RESET_DONE;                  /*!< Reset done. If a bit is set then a reset done signal has been
                                                     returned by the peripheral. This indicates that the peripheral's
                                                     registers are ready to be accessed.                                       */

    struct {
      __IM  uint32_t adc        : 1;            /*!< adc                                                                       */
      __IM  uint32_t busctrl    : 1;            /*!< busctrl                                                                   */
      __IM  uint32_t dma        : 1;            /*!< dma                                                                       */
      __IM  uint32_t i2c0       : 1;            /*!< i2c0                                                                      */
      __IM  uint32_t i2c1       : 1;            /*!< i2c1                                                                      */
      __IM  uint32_t io_bank0   : 1;            /*!< io_bank0                                                                  */
      __IM  uint32_t io_qspi    : 1;            /*!< io_qspi                                                                   */
      __IM  uint32_t jtag       : 1;            /*!< jtag                                                                      */
      __IM  uint32_t pads_bank0 : 1;            /*!< pads_bank0                                                                */
      __IM  uint32_t pads_qspi  : 1;            /*!< pads_qspi                                                                 */
      __IM  uint32_t pio0       : 1;            /*!< pio0                                                                      */
      __IM  uint32_t pio1       : 1;            /*!< pio1                                                                      */
      __IM  uint32_t pll_sys    : 1;            /*!< pll_sys                                                                   */
      __IM  uint32_t pll_usb    : 1;            /*!< pll_usb                                                                   */
      __IM  uint32_t pwm        : 1;            /*!< pwm                                                                       */
      __IM  uint32_t rtc        : 1;            /*!< rtc                                                                       */
      __IM  uint32_t spi0       : 1;            /*!< spi0                                                                      */
      __IM  uint32_t spi1       : 1;            /*!< spi1                                                                      */
      __IM  uint32_t syscfg     : 1;            /*!< syscfg                                                                    */
      __IM  uint32_t sysinfo    : 1;            /*!< sysinfo                                                                   */
      __IM  uint32_t tbman      : 1;            /*!< tbman                                                                     */
      __IM  uint32_t timer      : 1;            /*!< timer                                                                     */
      __IM  uint32_t uart0      : 1;            /*!< uart0                                                                     */
      __IM  uint32_t uart1      : 1;            /*!< uart1                                                                     */
      __IM  uint32_t usbctrl    : 1;            /*!< usbctrl                                                                   */
            uint32_t            : 7;
    } RESET_DONE_b;
  } ;
} RESETS_Type;                                  /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            PSM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PSM (PSM)
  */

typedef struct {                                /*!< PSM Structure                                                             */

  union {
    __IOM uint32_t FRCE_ON;                     /*!< Force block out of reset (i.e. power it on)                               */

