mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t rosc       : 1;            /*!< rosc                                                                      */
      __IOM uint32_t xosc       : 1;            /*!< xosc                                                                      */
      __IOM uint32_t clocks     : 1;            /*!< clocks                                                                    */
      __IOM uint32_t resets     : 1;            /*!< resets                                                                    */
      __IOM uint32_t busfabric  : 1;            /*!< busfabric                                                                 */
      __IOM uint32_t rom        : 1;            /*!< rom                                                                       */
      __IOM uint32_t sram0      : 1;            /*!< sram0                                                                     */
      __IOM uint32_t sram1      : 1;            /*!< sram1                                                                     */
      __IOM uint32_t sram2      : 1;            /*!< sram2                                                                     */
      __IOM uint32_t sram3      : 1;            /*!< sram3                                                                     */
      __IOM uint32_t sram4      : 1;            /*!< sram4                                                                     */
      __IOM uint32_t sram5      : 1;            /*!< sram5                                                                     */
      __IOM uint32_t xip        : 1;            /*!< xip                                                                       */
      __IOM uint32_t vreg_and_chip_reset : 1;   /*!< vreg_and_chip_reset                                                       */
      __IOM uint32_t sio        : 1;            /*!< sio                                                                       */
      __IOM uint32_t proc0      : 1;            /*!< proc0                                                                     */
      __IOM uint32_t proc1      : 1;            /*!< proc1                                                                     */
            uint32_t            : 15;
    } FRCE_ON_b;
  } ;

  union {
    __IOM uint32_t FRCE_OFF;                    /*!< Force into reset (i.e. power it off)                                      */

    struct {
      __IOM uint32_t rosc       : 1;            /*!< rosc                                                                      */
      __IOM uint32_t xosc       : 1;            /*!< xosc                                                                      */
      __IOM uint32_t clocks     : 1;            /*!< clocks                                                                    */
      __IOM uint32_t resets     : 1;            /*!< resets                                                                    */
      __IOM uint32_t busfabric  : 1;            /*!< busfabric                                                                 */
      __IOM uint32_t rom        : 1;            /*!< rom                                                                       */
      __IOM uint32_t sram0      : 1;            /*!< sram0                                                                     */
      __IOM uint32_t sram1      : 1;            /*!< sram1                                                                     */
      __IOM uint32_t sram2      : 1;            /*!< sram2                                                                     */
      __IOM uint32_t sram3      : 1;            /*!< sram3                                                                     */
      __IOM uint32_t sram4      : 1;            /*!< sram4                                                                     */
      __IOM uint32_t sram5      : 1;            /*!< sram5                                                                     */
      __IOM uint32_t xip        : 1;            /*!< xip                                                                       */
      __IOM uint32_t vreg_and_chip_reset : 1;   /*!< vreg_and_chip_reset                                                       */
      __IOM uint32_t sio        : 1;            /*!< sio                                                                       */
      __IOM uint32_t proc0      : 1;            /*!< proc0                                                                     */
      __IOM uint32_t proc1      : 1;            /*!< proc1                                                                     */
            uint32_t            : 15;
    } FRCE_OFF_b;
  } ;

  union {
    __IOM uint32_t WDSEL;                       /*!< Set to 1 if this peripheral should be reset when the watchdog
                                                     fires.                                                                    */

    struct {
      __IOM uint32_t rosc       : 1;            /*!< rosc                                                                      */
      __IOM uint32_t xosc       : 1;            /*!< xosc                                                                      */
      __IOM uint32_t clocks     : 1;            /*!< clocks                                                                    */
      __IOM uint32_t resets     : 1;            /*!< resets                                                                    */
      __IOM uint32_t busfabric  : 1;            /*!< busfabric                                                                 */
      __IOM uint32_t rom        : 1;            /*!< rom                                                                       */
      __IOM uint32_t sram0      : 1;            /*!< sram0                                                                     */
      __IOM uint32_t sram1      : 1;            /*!< sram1                                                                     */
      __IOM uint32_t sram2      : 1;            /*!< sram2                                                                     */
      __IOM uint32_t sram3      : 1;            /*!< sram3                                                                     */
      __IOM uint32_t sram4      : 1;            /*!< sram4                                                                     */
      __IOM uint32_t sram5      : 1;            /*!< sram5                                                                     */
      __IOM uint32_t xip        : 1;            /*!< xip                                                                       */
      __IOM uint32_t vreg_and_chip_reset : 1;   /*!< vreg_and_chip_reset                                                       */
      __IOM uint32_t sio        : 1;            /*!< sio                                                                       */
      __IOM uint32_t proc0      : 1;            /*!< proc0                                                                     */
      __IOM uint32_t proc1      : 1;            /*!< proc1                                                                     */
            uint32_t            : 15;
    } WDSEL_b;
  } ;

  union {
    __IOM uint32_t DONE;                        /*!< Indicates the peripheral's registers are ready to access.                 */

