mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t rosc       : 1;            /*!< rosc                                                                      */
      __IM  uint32_t xosc       : 1;            /*!< xosc                                                                      */
      __IM  uint32_t clocks     : 1;            /*!< clocks                                                                    */
      __IM  uint32_t resets     : 1;            /*!< resets                                                                    */
      __IM  uint32_t busfabric  : 1;            /*!< busfabric                                                                 */
      __IM  uint32_t rom        : 1;            /*!< rom                                                                       */
      __IM  uint32_t sram0      : 1;            /*!< sram0                                                                     */
      __IM  uint32_t sram1      : 1;            /*!< sram1                                                                     */
      __IM  uint32_t sram2      : 1;            /*!< sram2                                                                     */
      __IM  uint32_t sram3      : 1;            /*!< sram3                                                                     */
      __IM  uint32_t sram4      : 1;            /*!< sram4                                                                     */
      __IM  uint32_t sram5      : 1;            /*!< sram5                                                                     */
      __IM  uint32_t xip        : 1;            /*!< xip                                                                       */
      __IM  uint32_t vreg_and_chip_reset : 1;   /*!< vreg_and_chip_reset                                                       */
      __IM  uint32_t sio        : 1;            /*!< sio                                                                       */
      __IM  uint32_t proc0      : 1;            /*!< proc0                                                                     */
      __IM  uint32_t proc1      : 1;            /*!< proc1                                                                     */
            uint32_t            : 15;
    } DONE_b;
  } ;
} PSM_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                         IO_BANK0                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief IO_BANK0 (IO_BANK0)
  */

typedef struct {                                /*!< IO_BANK0 Structure                                                        */

  struct GPIOx {
  union {
    __IOM uint32_t STATUS;                /*!< GPIO status                                                               */

    struct {
            uint32_t            : 8;
      __IM  uint32_t OUTFROMPERI : 1;           /*!< output signal from selected peripheral, before register override
                                                     is applied                                                                */
      __IM  uint32_t OUTTOPAD   : 1;            /*!< output signal to pad after register override is applied                   */
            uint32_t            : 2;
      __IM  uint32_t OEFROMPERI : 1;            /*!< output enable from selected peripheral, before register override
                                                     is applied                                                                */
      __IM  uint32_t OETOPAD    : 1;            /*!< output enable to pad after register override is applied                   */
            uint32_t            : 3;
      __IM  uint32_t INFROMPAD  : 1;            /*!< input signal from pad, before override is applied                         */
            uint32_t            : 1;
      __IM  uint32_t INTOPERI   : 1;            /*!< input signal to peripheral, after override is applied                     */
            uint32_t            : 4;
      __IM  uint32_t IRQFROMPAD : 1;            /*!< interrupt from pad before override is applied                             */
            uint32_t            : 1;
      __IM  uint32_t IRQTOPROC  : 1;            /*!< interrupt to processors, after override is applied                        */
            uint32_t            : 5;
    } STATUS_b;
  };

  union {
    __IOM uint32_t CTRL;                  /*!< GPIO control including function select and overrides.                     */

    struct {
      __IOM uint32_t FUNCSEL    : 5;            /*!< 0-31 -> selects pin function according to the gpio table
                                                     31 == NULL                                                                */
            uint32_t            : 3;
      __IOM uint32_t OUTOVER    : 2;            /*!< OUTOVER                                                                   */
            uint32_t            : 2;
      __IOM uint32_t OEOVER     : 2;            /*!< OEOVER                                                                    */
            uint32_t            : 2;
      __IOM uint32_t INOVER     : 2;            /*!< INOVER                                                                    */
            uint32_t            : 10;
      __IOM uint32_t IRQOVER    : 2;            /*!< IRQOVER                                                                   */
            uint32_t            : 2;
    } CTRL_b;
  };
  };

  struct GPIOx GPIO[30];

  union {
    __IOM uint32_t INTR0;                       /*!< Raw Interrupts                                                            */

    struct {
      __IM  uint32_t GPIO0_LEVEL_LOW : 1;       /*!< GPIO0_LEVEL_LOW                                                           */
      __IM  uint32_t GPIO0_LEVEL_HIGH : 1;      /*!< GPIO0_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO0_EDGE_LOW : 1;        /*!< GPIO0_EDGE_LOW                                                            */
      __IOM uint32_t GPIO0_EDGE_HIGH : 1;       /*!< GPIO0_EDGE_HIGH                                                           */
      __IM  uint32_t GPIO1_LEVEL_LOW : 1;       /*!< GPIO1_LEVEL_LOW                                                           */
      __IM  uint32_t GPIO1_LEVEL_HIGH : 1;      /*!< GPIO1_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO1_EDGE_LOW : 1;        /*!< GPIO1_EDGE_LOW                                                            */
      __IOM uint32_t GPIO1_EDGE_HIGH : 1;       /*!< GPIO1_EDGE_HIGH                                                           */
      __IM  uint32_t GPIO2_LEVEL_LOW : 1;       /*!< GPIO2_LEVEL_LOW                                                           */
      __IM  uint32_t GPIO2_LEVEL_HIGH : 1;      /*!< GPIO2_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO2_EDGE_LOW : 1;        /*!< GPIO2_EDGE_LOW                                                            */
      __IOM uint32_t GPIO2_EDGE_HIGH : 1;       /*!< GPIO2_EDGE_HIGH                                                           */
      __IM  uint32_t GPIO3_LEVEL_LOW : 1;       /*!< GPIO3_LEVEL_LOW                                                           */
      __IM  uint32_t GPIO3_LEVEL_HIGH : 1;      /*!< GPIO3_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO3_EDGE_LOW : 1;        /*!< GPIO3_EDGE_LOW                                                            */
      __IOM uint32_t GPIO3_EDGE_HIGH : 1;       /*!< GPIO3_EDGE_HIGH                                                           */
      __IM  uint32_t GPIO4_LEVEL_LOW : 1;       /*!< GPIO4_LEVEL_LOW                                                           */
      __IM  uint32_t GPIO4_LEVEL_HIGH : 1;      /*!< GPIO4_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO4_EDGE_LOW : 1;        /*!< GPIO4_EDGE_LOW                                                            */
      __IOM uint32_t GPIO4_EDGE_HIGH : 1;       /*!< GPIO4_EDGE_HIGH                                                           */
      __IM  uint32_t GPIO5_LEVEL_LOW : 1;       /*!< GPIO5_LEVEL_LOW                                                           */
      __IM  uint32_t GPIO5_LEVEL_HIGH : 1;      /*!< GPIO5_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO5_EDGE_LOW : 1;        /*!< GPIO5_EDGE_LOW                                                            */
      __IOM uint32_t GPIO5_EDGE_HIGH : 1;       /*!< GPIO5_EDGE_HIGH                                                           */
      __IM  uint32_t GPIO6_LEVEL_LOW : 1;       /*!< GPIO6_LEVEL_LOW                                                           */
      __IM  uint32_t GPIO6_LEVEL_HIGH : 1;      /*!< GPIO6_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO6_EDGE_LOW : 1;        /*!< GPIO6_EDGE_LOW                                                            */
      __IOM uint32_t GPIO6_EDGE_HIGH : 1;       /*!< GPIO6_EDGE_HIGH                                                           */
      __IM  uint32_t GPIO7_LEVEL_LOW : 1;       /*!< GPIO7_LEVEL_LOW                                                           */
      __IM  uint32_t GPIO7_LEVEL_HIGH : 1;      /*!< GPIO7_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO7_EDGE_LOW : 1;        /*!< GPIO7_EDGE_LOW                                                            */
      __IOM uint32_t GPIO7_EDGE_HIGH : 1;       /*!< GPIO7_EDGE_HIGH                                                           */
    } INTR0_b;
  } ;

  union {
    __IOM uint32_t INTR1;                       /*!< Raw Interrupts                                                            */

