mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t GPIO24_LEVEL_LOW : 1;      /*!< GPIO24_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO24_LEVEL_HIGH : 1;     /*!< GPIO24_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO24_EDGE_LOW : 1;       /*!< GPIO24_EDGE_LOW                                                           */
      __IOM uint32_t GPIO24_EDGE_HIGH : 1;      /*!< GPIO24_EDGE_HIGH                                                          */
      __IM  uint32_t GPIO25_LEVEL_LOW : 1;      /*!< GPIO25_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO25_LEVEL_HIGH : 1;     /*!< GPIO25_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO25_EDGE_LOW : 1;       /*!< GPIO25_EDGE_LOW                                                           */
      __IOM uint32_t GPIO25_EDGE_HIGH : 1;      /*!< GPIO25_EDGE_HIGH                                                          */
      __IM  uint32_t GPIO26_LEVEL_LOW : 1;      /*!< GPIO26_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO26_LEVEL_HIGH : 1;     /*!< GPIO26_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO26_EDGE_LOW : 1;       /*!< GPIO26_EDGE_LOW                                                           */
      __IOM uint32_t GPIO26_EDGE_HIGH : 1;      /*!< GPIO26_EDGE_HIGH                                                          */
      __IM  uint32_t GPIO27_LEVEL_LOW : 1;      /*!< GPIO27_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO27_LEVEL_HIGH : 1;     /*!< GPIO27_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO27_EDGE_LOW : 1;       /*!< GPIO27_EDGE_LOW                                                           */
      __IOM uint32_t GPIO27_EDGE_HIGH : 1;      /*!< GPIO27_EDGE_HIGH                                                          */
      __IM  uint32_t GPIO28_LEVEL_LOW : 1;      /*!< GPIO28_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO28_LEVEL_HIGH : 1;     /*!< GPIO28_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO28_EDGE_LOW : 1;       /*!< GPIO28_EDGE_LOW                                                           */
      __IOM uint32_t GPIO28_EDGE_HIGH : 1;      /*!< GPIO28_EDGE_HIGH                                                          */
      __IM  uint32_t GPIO29_LEVEL_LOW : 1;      /*!< GPIO29_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO29_LEVEL_HIGH : 1;     /*!< GPIO29_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO29_EDGE_LOW : 1;       /*!< GPIO29_EDGE_LOW                                                           */
      __IOM uint32_t GPIO29_EDGE_HIGH : 1;      /*!< GPIO29_EDGE_HIGH                                                          */
            uint32_t            : 8;
    } INTR3_b;
  } ;

  union {
    __IOM uint32_t PROC0_INTE0;                 /*!< Interrupt Enable for proc0                                                */

    struct {
      __IOM uint32_t GPIO0_LEVEL_LOW : 1;       /*!< GPIO0_LEVEL_LOW                                                           */
      __IOM uint32_t GPIO0_LEVEL_HIGH : 1;      /*!< GPIO0_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO0_EDGE_LOW : 1;        /*!< GPIO0_EDGE_LOW                                                            */
      __IOM uint32_t GPIO0_EDGE_HIGH : 1;       /*!< GPIO0_EDGE_HIGH                                                           */
      __IOM uint32_t GPIO1_LEVEL_LOW : 1;       /*!< GPIO1_LEVEL_LOW                                                           */
      __IOM uint32_t GPIO1_LEVEL_HIGH : 1;      /*!< GPIO1_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO1_EDGE_LOW : 1;        /*!< GPIO1_EDGE_LOW                                                            */
      __IOM uint32_t GPIO1_EDGE_HIGH : 1;       /*!< GPIO1_EDGE_HIGH                                                           */
      __IOM uint32_t GPIO2_LEVEL_LOW : 1;       /*!< GPIO2_LEVEL_LOW                                                           */
      __IOM uint32_t GPIO2_LEVEL_HIGH : 1;      /*!< GPIO2_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO2_EDGE_LOW : 1;        /*!< GPIO2_EDGE_LOW                                                            */
      __IOM uint32_t GPIO2_EDGE_HIGH : 1;       /*!< GPIO2_EDGE_HIGH                                                           */
      __IOM uint32_t GPIO3_LEVEL_LOW : 1;       /*!< GPIO3_LEVEL_LOW                                                           */
      __IOM uint32_t GPIO3_LEVEL_HIGH : 1;      /*!< GPIO3_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO3_EDGE_LOW : 1;        /*!< GPIO3_EDGE_LOW                                                            */
      __IOM uint32_t GPIO3_EDGE_HIGH : 1;       /*!< GPIO3_EDGE_HIGH                                                           */
      __IOM uint32_t GPIO4_LEVEL_LOW : 1;       /*!< GPIO4_LEVEL_LOW                                                           */
      __IOM uint32_t GPIO4_LEVEL_HIGH : 1;      /*!< GPIO4_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO4_EDGE_LOW : 1;        /*!< GPIO4_EDGE_LOW                                                            */
      __IOM uint32_t GPIO4_EDGE_HIGH : 1;       /*!< GPIO4_EDGE_HIGH                                                           */
      __IOM uint32_t GPIO5_LEVEL_LOW : 1;       /*!< GPIO5_LEVEL_LOW                                                           */
      __IOM uint32_t GPIO5_LEVEL_HIGH : 1;      /*!< GPIO5_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO5_EDGE_LOW : 1;        /*!< GPIO5_EDGE_LOW                                                            */
      __IOM uint32_t GPIO5_EDGE_HIGH : 1;       /*!< GPIO5_EDGE_HIGH                                                           */
      __IOM uint32_t GPIO6_LEVEL_LOW : 1;       /*!< GPIO6_LEVEL_LOW                                                           */
      __IOM uint32_t GPIO6_LEVEL_HIGH : 1;      /*!< GPIO6_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO6_EDGE_LOW : 1;        /*!< GPIO6_EDGE_LOW                                                            */
      __IOM uint32_t GPIO6_EDGE_HIGH : 1;       /*!< GPIO6_EDGE_HIGH                                                           */
      __IOM uint32_t GPIO7_LEVEL_LOW : 1;       /*!< GPIO7_LEVEL_LOW                                                           */
      __IOM uint32_t GPIO7_LEVEL_HIGH : 1;      /*!< GPIO7_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO7_EDGE_LOW : 1;        /*!< GPIO7_EDGE_LOW                                                            */
      __IOM uint32_t GPIO7_EDGE_HIGH : 1;       /*!< GPIO7_EDGE_HIGH                                                           */
    } PROC0_INTE0_b;
  } ;

  union {
    __IOM uint32_t PROC0_INTE1;                 /*!< Interrupt Enable for proc0                                                */

