mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t GPIO8_LEVEL_LOW : 1;       /*!< GPIO8_LEVEL_LOW                                                           */
      __IOM uint32_t GPIO8_LEVEL_HIGH : 1;      /*!< GPIO8_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO8_EDGE_LOW : 1;        /*!< GPIO8_EDGE_LOW                                                            */
      __IOM uint32_t GPIO8_EDGE_HIGH : 1;       /*!< GPIO8_EDGE_HIGH                                                           */
      __IOM uint32_t GPIO9_LEVEL_LOW : 1;       /*!< GPIO9_LEVEL_LOW                                                           */
      __IOM uint32_t GPIO9_LEVEL_HIGH : 1;      /*!< GPIO9_LEVEL_HIGH                                                          */
      __IOM uint32_t GPIO9_EDGE_LOW : 1;        /*!< GPIO9_EDGE_LOW                                                            */
      __IOM uint32_t GPIO9_EDGE_HIGH : 1;       /*!< GPIO9_EDGE_HIGH                                                           */
      __IOM uint32_t GPIO10_LEVEL_LOW : 1;      /*!< GPIO10_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO10_LEVEL_HIGH : 1;     /*!< GPIO10_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO10_EDGE_LOW : 1;       /*!< GPIO10_EDGE_LOW                                                           */
      __IOM uint32_t GPIO10_EDGE_HIGH : 1;      /*!< GPIO10_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO11_LEVEL_LOW : 1;      /*!< GPIO11_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO11_LEVEL_HIGH : 1;     /*!< GPIO11_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO11_EDGE_LOW : 1;       /*!< GPIO11_EDGE_LOW                                                           */
      __IOM uint32_t GPIO11_EDGE_HIGH : 1;      /*!< GPIO11_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO12_LEVEL_LOW : 1;      /*!< GPIO12_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO12_LEVEL_HIGH : 1;     /*!< GPIO12_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO12_EDGE_LOW : 1;       /*!< GPIO12_EDGE_LOW                                                           */
      __IOM uint32_t GPIO12_EDGE_HIGH : 1;      /*!< GPIO12_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO13_LEVEL_LOW : 1;      /*!< GPIO13_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO13_LEVEL_HIGH : 1;     /*!< GPIO13_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO13_EDGE_LOW : 1;       /*!< GPIO13_EDGE_LOW                                                           */
      __IOM uint32_t GPIO13_EDGE_HIGH : 1;      /*!< GPIO13_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO14_LEVEL_LOW : 1;      /*!< GPIO14_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO14_LEVEL_HIGH : 1;     /*!< GPIO14_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO14_EDGE_LOW : 1;       /*!< GPIO14_EDGE_LOW                                                           */
      __IOM uint32_t GPIO14_EDGE_HIGH : 1;      /*!< GPIO14_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO15_LEVEL_LOW : 1;      /*!< GPIO15_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO15_LEVEL_HIGH : 1;     /*!< GPIO15_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO15_EDGE_LOW : 1;       /*!< GPIO15_EDGE_LOW                                                           */
      __IOM uint32_t GPIO15_EDGE_HIGH : 1;      /*!< GPIO15_EDGE_HIGH                                                          */
    } PROC0_INTF1_b;
  } ;

  union {
    __IOM uint32_t PROC0_INTF2;                 /*!< Interrupt Force for proc0                                                 */

    struct {
      __IOM uint32_t GPIO16_LEVEL_LOW : 1;      /*!< GPIO16_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO16_LEVEL_HIGH : 1;     /*!< GPIO16_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO16_EDGE_LOW : 1;       /*!< GPIO16_EDGE_LOW                                                           */
      __IOM uint32_t GPIO16_EDGE_HIGH : 1;      /*!< GPIO16_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO17_LEVEL_LOW : 1;      /*!< GPIO17_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO17_LEVEL_HIGH : 1;     /*!< GPIO17_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO17_EDGE_LOW : 1;       /*!< GPIO17_EDGE_LOW                                                           */
      __IOM uint32_t GPIO17_EDGE_HIGH : 1;      /*!< GPIO17_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO18_LEVEL_LOW : 1;      /*!< GPIO18_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO18_LEVEL_HIGH : 1;     /*!< GPIO18_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO18_EDGE_LOW : 1;       /*!< GPIO18_EDGE_LOW                                                           */
      __IOM uint32_t GPIO18_EDGE_HIGH : 1;      /*!< GPIO18_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO19_LEVEL_LOW : 1;      /*!< GPIO19_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO19_LEVEL_HIGH : 1;     /*!< GPIO19_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO19_EDGE_LOW : 1;       /*!< GPIO19_EDGE_LOW                                                           */
      __IOM uint32_t GPIO19_EDGE_HIGH : 1;      /*!< GPIO19_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO20_LEVEL_LOW : 1;      /*!< GPIO20_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO20_LEVEL_HIGH : 1;     /*!< GPIO20_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO20_EDGE_LOW : 1;       /*!< GPIO20_EDGE_LOW                                                           */
      __IOM uint32_t GPIO20_EDGE_HIGH : 1;      /*!< GPIO20_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO21_LEVEL_LOW : 1;      /*!< GPIO21_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO21_LEVEL_HIGH : 1;     /*!< GPIO21_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO21_EDGE_LOW : 1;       /*!< GPIO21_EDGE_LOW                                                           */
      __IOM uint32_t GPIO21_EDGE_HIGH : 1;      /*!< GPIO21_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO22_LEVEL_LOW : 1;      /*!< GPIO22_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO22_LEVEL_HIGH : 1;     /*!< GPIO22_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO22_EDGE_LOW : 1;       /*!< GPIO22_EDGE_LOW                                                           */
      __IOM uint32_t GPIO22_EDGE_HIGH : 1;      /*!< GPIO22_EDGE_HIGH                                                          */
      __IOM uint32_t GPIO23_LEVEL_LOW : 1;      /*!< GPIO23_LEVEL_LOW                                                          */
      __IOM uint32_t GPIO23_LEVEL_HIGH : 1;     /*!< GPIO23_LEVEL_HIGH                                                         */
      __IOM uint32_t GPIO23_EDGE_LOW : 1;       /*!< GPIO23_EDGE_LOW                                                           */
      __IOM uint32_t GPIO23_EDGE_HIGH : 1;      /*!< GPIO23_EDGE_HIGH                                                          */
    } PROC0_INTF2_b;
  } ;

  union {
    __IOM uint32_t PROC0_INTF3;                 /*!< Interrupt Force for proc0                                                 */

