mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t GPIO24_LEVEL_LOW : 1;      /*!< GPIO24_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO24_LEVEL_HIGH : 1;     /*!< GPIO24_LEVEL_HIGH                                                         */
      __IM  uint32_t GPIO24_EDGE_LOW : 1;       /*!< GPIO24_EDGE_LOW                                                           */
      __IM  uint32_t GPIO24_EDGE_HIGH : 1;      /*!< GPIO24_EDGE_HIGH                                                          */
      __IM  uint32_t GPIO25_LEVEL_LOW : 1;      /*!< GPIO25_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO25_LEVEL_HIGH : 1;     /*!< GPIO25_LEVEL_HIGH                                                         */
      __IM  uint32_t GPIO25_EDGE_LOW : 1;       /*!< GPIO25_EDGE_LOW                                                           */
      __IM  uint32_t GPIO25_EDGE_HIGH : 1;      /*!< GPIO25_EDGE_HIGH                                                          */
      __IM  uint32_t GPIO26_LEVEL_LOW : 1;      /*!< GPIO26_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO26_LEVEL_HIGH : 1;     /*!< GPIO26_LEVEL_HIGH                                                         */
      __IM  uint32_t GPIO26_EDGE_LOW : 1;       /*!< GPIO26_EDGE_LOW                                                           */
      __IM  uint32_t GPIO26_EDGE_HIGH : 1;      /*!< GPIO26_EDGE_HIGH                                                          */
      __IM  uint32_t GPIO27_LEVEL_LOW : 1;      /*!< GPIO27_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO27_LEVEL_HIGH : 1;     /*!< GPIO27_LEVEL_HIGH                                                         */
      __IM  uint32_t GPIO27_EDGE_LOW : 1;       /*!< GPIO27_EDGE_LOW                                                           */
      __IM  uint32_t GPIO27_EDGE_HIGH : 1;      /*!< GPIO27_EDGE_HIGH                                                          */
      __IM  uint32_t GPIO28_LEVEL_LOW : 1;      /*!< GPIO28_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO28_LEVEL_HIGH : 1;     /*!< GPIO28_LEVEL_HIGH                                                         */
      __IM  uint32_t GPIO28_EDGE_LOW : 1;       /*!< GPIO28_EDGE_LOW                                                           */
      __IM  uint32_t GPIO28_EDGE_HIGH : 1;      /*!< GPIO28_EDGE_HIGH                                                          */
      __IM  uint32_t GPIO29_LEVEL_LOW : 1;      /*!< GPIO29_LEVEL_LOW                                                          */
      __IM  uint32_t GPIO29_LEVEL_HIGH : 1;     /*!< GPIO29_LEVEL_HIGH                                                         */
      __IM  uint32_t GPIO29_EDGE_LOW : 1;       /*!< GPIO29_EDGE_LOW                                                           */
      __IM  uint32_t GPIO29_EDGE_HIGH : 1;      /*!< GPIO29_EDGE_HIGH                                                          */
            uint32_t            : 8;
    } DORMANT_WAKE_INTS3_b;
  } ;
} IO_BANK0_Type;                                /*!< Size = 400 (0x190)                                                        */



/* =========================================================================================================================== */
/* ================                                          IO_QSPI                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief IO_QSPI (IO_QSPI)
  */

typedef struct {                                /*!< IO_QSPI Structure                                                         */

  union {
    __IOM uint32_t GPIO_QSPI_SCLK_STATUS;       /*!< GPIO status                                                               */

    struct {
            uint32_t            : 8;
      __IM  uint32_t OUTFROMPERI : 1;           /*!< output signal from selected peripheral, before register override
                                                     is applied                                                                */
      __IM  uint32_t OUTTOPAD   : 1;            /*!< output signal to pad after register override is applied                   */
            uint32_t            : 2;
      __IM  uint32_t OEFROMPERI : 1;            /*!< output enable from selected peripheral, before register override
                                                     is applied                                                                */
      __IM  uint32_t OETOPAD    : 1;            /*!< output enable to pad after register override is applied                   */
            uint32_t            : 3;
      __IM  uint32_t INFROMPAD  : 1;            /*!< input signal from pad, before override is applied                         */
            uint32_t            : 1;
      __IM  uint32_t INTOPERI   : 1;            /*!< input signal to peripheral, after override is applied                     */
            uint32_t            : 4;
      __IM  uint32_t IRQFROMPAD : 1;            /*!< interrupt from pad before override is applied                             */
            uint32_t            : 1;
      __IM  uint32_t IRQTOPROC  : 1;            /*!< interrupt to processors, after override is applied                        */
            uint32_t            : 5;
    } GPIO_QSPI_SCLK_STATUS_b;
  } ;

  union {
    __IOM uint32_t GPIO_QSPI_SCLK_CTRL;         /*!< GPIO control including function select and overrides.                     */

    struct {
      __IOM uint32_t FUNCSEL    : 5;            /*!< 0-31 -> selects pin function according to the gpio table
                                                     31 == NULL                                                                */
            uint32_t            : 3;
      __IOM uint32_t OUTOVER    : 2;            /*!< OUTOVER                                                                   */
            uint32_t            : 2;
      __IOM uint32_t OEOVER     : 2;            /*!< OEOVER                                                                    */
            uint32_t            : 2;
      __IOM uint32_t INOVER     : 2;            /*!< INOVER                                                                    */
            uint32_t            : 10;
      __IOM uint32_t IRQOVER    : 2;            /*!< IRQOVER                                                                   */
            uint32_t            : 2;
    } GPIO_QSPI_SCLK_CTRL_b;
  } ;

  union {
    __IOM uint32_t GPIO_QSPI_SS_STATUS;         /*!< GPIO status                                                               */

