mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
            uint32_t            : 8;
      __IM  uint32_t OUTFROMPERI : 1;           /*!< output signal from selected peripheral, before register override
                                                     is applied                                                                */
      __IM  uint32_t OUTTOPAD   : 1;            /*!< output signal to pad after register override is applied                   */
            uint32_t            : 2;
      __IM  uint32_t OEFROMPERI : 1;            /*!< output enable from selected peripheral, before register override
                                                     is applied                                                                */
      __IM  uint32_t OETOPAD    : 1;            /*!< output enable to pad after register override is applied                   */
            uint32_t            : 3;
      __IM  uint32_t INFROMPAD  : 1;            /*!< input signal from pad, before override is applied                         */
            uint32_t            : 1;
      __IM  uint32_t INTOPERI   : 1;            /*!< input signal to peripheral, after override is applied                     */
            uint32_t            : 4;
      __IM  uint32_t IRQFROMPAD : 1;            /*!< interrupt from pad before override is applied                             */
            uint32_t            : 1;
      __IM  uint32_t IRQTOPROC  : 1;            /*!< interrupt to processors, after override is applied                        */
            uint32_t            : 5;
    } GPIO_QSPI_SS_STATUS_b;
  } ;

  union {
    __IOM uint32_t GPIO_QSPI_SS_CTRL;           /*!< GPIO control including function select and overrides.                     */

    struct {
      __IOM uint32_t FUNCSEL    : 5;            /*!< 0-31 -> selects pin function according to the gpio table
                                                     31 == NULL                                                                */
            uint32_t            : 3;
      __IOM uint32_t OUTOVER    : 2;            /*!< OUTOVER                                                                   */
            uint32_t            : 2;
      __IOM uint32_t OEOVER     : 2;            /*!< OEOVER                                                                    */
            uint32_t            : 2;
      __IOM uint32_t INOVER     : 2;            /*!< INOVER                                                                    */
            uint32_t            : 10;
      __IOM uint32_t IRQOVER    : 2;            /*!< IRQOVER                                                                   */
            uint32_t            : 2;
    } GPIO_QSPI_SS_CTRL_b;
  } ;

  union {
    __IOM uint32_t GPIO_QSPI_SD0_STATUS;        /*!< GPIO status                                                               */

    struct {
            uint32_t            : 8;
      __IM  uint32_t OUTFROMPERI : 1;           /*!< output signal from selected peripheral, before register override
                                                     is applied                                                                */
      __IM  uint32_t OUTTOPAD   : 1;            /*!< output signal to pad after register override is applied                   */
            uint32_t            : 2;
      __IM  uint32_t OEFROMPERI : 1;            /*!< output enable from selected peripheral, before register override
                                                     is applied                                                                */
      __IM  uint32_t OETOPAD    : 1;            /*!< output enable to pad after register override is applied                   */
            uint32_t            : 3;
      __IM  uint32_t INFROMPAD  : 1;            /*!< input signal from pad, before override is applied                         */
            uint32_t            : 1;
      __IM  uint32_t INTOPERI   : 1;            /*!< input signal to peripheral, after override is applied                     */
            uint32_t            : 4;
      __IM  uint32_t IRQFROMPAD : 1;            /*!< interrupt from pad before override is applied                             */
            uint32_t            : 1;
      __IM  uint32_t IRQTOPROC  : 1;            /*!< interrupt to processors, after override is applied                        */
            uint32_t            : 5;
    } GPIO_QSPI_SD0_STATUS_b;
  } ;

  union {
    __IOM uint32_t GPIO_QSPI_SD0_CTRL;          /*!< GPIO control including function select and overrides.                     */

    struct {
      __IOM uint32_t FUNCSEL    : 5;            /*!< 0-31 -> selects pin function according to the gpio table
                                                     31 == NULL                                                                */
            uint32_t            : 3;
      __IOM uint32_t OUTOVER    : 2;            /*!< OUTOVER                                                                   */
            uint32_t            : 2;
      __IOM uint32_t OEOVER     : 2;            /*!< OEOVER                                                                    */
            uint32_t            : 2;
      __IOM uint32_t INOVER     : 2;            /*!< INOVER                                                                    */
            uint32_t            : 10;
      __IOM uint32_t IRQOVER    : 2;            /*!< IRQOVER                                                                   */
            uint32_t            : 2;
    } GPIO_QSPI_SD0_CTRL_b;
  } ;

  union {
    __IOM uint32_t GPIO_QSPI_SD1_STATUS;        /*!< GPIO status                                                               */

    struct {
            uint32_t            : 8;
      __IM  uint32_t OUTFROMPERI : 1;           /*!< output signal from selected peripheral, before register override
                                                     is applied                                                                */
      __IM  uint32_t OUTTOPAD   : 1;            /*!< output signal to pad after register override is applied                   */
            uint32_t            : 2;
      __IM  uint32_t OEFROMPERI : 1;            /*!< output enable from selected peripheral, before register override
                                                     is applied                                                                */
      __IM  uint32_t OETOPAD    : 1;            /*!< output enable to pad after register override is applied                   */
            uint32_t            : 3;
      __IM  uint32_t INFROMPAD  : 1;            /*!< input signal from pad, before override is applied                         */
            uint32_t            : 1;
      __IM  uint32_t INTOPERI   : 1;            /*!< input signal to peripheral, after override is applied                     */
            uint32_t            : 4;
      __IM  uint32_t IRQFROMPAD : 1;            /*!< interrupt from pad before override is applied                             */
            uint32_t            : 1;
      __IM  uint32_t IRQTOPROC  : 1;            /*!< interrupt to processors, after override is applied                        */
            uint32_t            : 5;
    } GPIO_QSPI_SD1_STATUS_b;
  } ;

  union {
    __IOM uint32_t GPIO_QSPI_SD1_CTRL;          /*!< GPIO control including function select and overrides.                     */

