mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t GPIO_QSPI_SCLK_LEVEL_LOW : 1;/*!< GPIO_QSPI_SCLK_LEVEL_LOW                                                */
      __IM  uint32_t GPIO_QSPI_SCLK_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SCLK_LEVEL_HIGH                                              */
      __IOM uint32_t GPIO_QSPI_SCLK_EDGE_LOW : 1;/*!< GPIO_QSPI_SCLK_EDGE_LOW                                                  */
      __IOM uint32_t GPIO_QSPI_SCLK_EDGE_HIGH : 1;/*!< GPIO_QSPI_SCLK_EDGE_HIGH                                                */
      __IM  uint32_t GPIO_QSPI_SS_LEVEL_LOW : 1;/*!< GPIO_QSPI_SS_LEVEL_LOW                                                    */
      __IM  uint32_t GPIO_QSPI_SS_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SS_LEVEL_HIGH                                                  */
      __IOM uint32_t GPIO_QSPI_SS_EDGE_LOW : 1; /*!< GPIO_QSPI_SS_EDGE_LOW                                                     */
      __IOM uint32_t GPIO_QSPI_SS_EDGE_HIGH : 1;/*!< GPIO_QSPI_SS_EDGE_HIGH                                                    */
      __IM  uint32_t GPIO_QSPI_SD0_LEVEL_LOW : 1;/*!< GPIO_QSPI_SD0_LEVEL_LOW                                                  */
      __IM  uint32_t GPIO_QSPI_SD0_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SD0_LEVEL_HIGH                                                */
      __IOM uint32_t GPIO_QSPI_SD0_EDGE_LOW : 1;/*!< GPIO_QSPI_SD0_EDGE_LOW                                                    */
      __IOM uint32_t GPIO_QSPI_SD0_EDGE_HIGH : 1;/*!< GPIO_QSPI_SD0_EDGE_HIGH                                                  */
      __IM  uint32_t GPIO_QSPI_SD1_LEVEL_LOW : 1;/*!< GPIO_QSPI_SD1_LEVEL_LOW                                                  */
      __IM  uint32_t GPIO_QSPI_SD1_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SD1_LEVEL_HIGH                                                */
      __IOM uint32_t GPIO_QSPI_SD1_EDGE_LOW : 1;/*!< GPIO_QSPI_SD1_EDGE_LOW                                                    */
      __IOM uint32_t GPIO_QSPI_SD1_EDGE_HIGH : 1;/*!< GPIO_QSPI_SD1_EDGE_HIGH                                                  */
      __IM  uint32_t GPIO_QSPI_SD2_LEVEL_LOW : 1;/*!< GPIO_QSPI_SD2_LEVEL_LOW                                                  */
      __IM  uint32_t GPIO_QSPI_SD2_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SD2_LEVEL_HIGH                                                */
      __IOM uint32_t GPIO_QSPI_SD2_EDGE_LOW : 1;/*!< GPIO_QSPI_SD2_EDGE_LOW                                                    */
      __IOM uint32_t GPIO_QSPI_SD2_EDGE_HIGH : 1;/*!< GPIO_QSPI_SD2_EDGE_HIGH                                                  */
      __IM  uint32_t GPIO_QSPI_SD3_LEVEL_LOW : 1;/*!< GPIO_QSPI_SD3_LEVEL_LOW                                                  */
      __IM  uint32_t GPIO_QSPI_SD3_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SD3_LEVEL_HIGH                                                */
      __IOM uint32_t GPIO_QSPI_SD3_EDGE_LOW : 1;/*!< GPIO_QSPI_SD3_EDGE_LOW                                                    */
      __IOM uint32_t GPIO_QSPI_SD3_EDGE_HIGH : 1;/*!< GPIO_QSPI_SD3_EDGE_HIGH                                                  */
            uint32_t            : 8;
    } INTR_b;
  } ;

  union {
    __IOM uint32_t PROC0_INTE;                  /*!< Interrupt Enable for proc0                                                */

    struct {
      __IOM uint32_t GPIO_QSPI_SCLK_LEVEL_LOW : 1;/*!< GPIO_QSPI_SCLK_LEVEL_LOW                                                */
      __IOM uint32_t GPIO_QSPI_SCLK_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SCLK_LEVEL_HIGH                                              */
      __IOM uint32_t GPIO_QSPI_SCLK_EDGE_LOW : 1;/*!< GPIO_QSPI_SCLK_EDGE_LOW                                                  */
      __IOM uint32_t GPIO_QSPI_SCLK_EDGE_HIGH : 1;/*!< GPIO_QSPI_SCLK_EDGE_HIGH                                                */
      __IOM uint32_t GPIO_QSPI_SS_LEVEL_LOW : 1;/*!< GPIO_QSPI_SS_LEVEL_LOW                                                    */
      __IOM uint32_t GPIO_QSPI_SS_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SS_LEVEL_HIGH                                                  */
      __IOM uint32_t GPIO_QSPI_SS_EDGE_LOW : 1; /*!< GPIO_QSPI_SS_EDGE_LOW                                                     */
      __IOM uint32_t GPIO_QSPI_SS_EDGE_HIGH : 1;/*!< GPIO_QSPI_SS_EDGE_HIGH                                                    */
      __IOM uint32_t GPIO_QSPI_SD0_LEVEL_LOW : 1;/*!< GPIO_QSPI_SD0_LEVEL_LOW                                                  */
      __IOM uint32_t GPIO_QSPI_SD0_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SD0_LEVEL_HIGH                                                */
      __IOM uint32_t GPIO_QSPI_SD0_EDGE_LOW : 1;/*!< GPIO_QSPI_SD0_EDGE_LOW                                                    */
      __IOM uint32_t GPIO_QSPI_SD0_EDGE_HIGH : 1;/*!< GPIO_QSPI_SD0_EDGE_HIGH                                                  */
      __IOM uint32_t GPIO_QSPI_SD1_LEVEL_LOW : 1;/*!< GPIO_QSPI_SD1_LEVEL_LOW                                                  */
      __IOM uint32_t GPIO_QSPI_SD1_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SD1_LEVEL_HIGH                                                */
      __IOM uint32_t GPIO_QSPI_SD1_EDGE_LOW : 1;/*!< GPIO_QSPI_SD1_EDGE_LOW                                                    */
      __IOM uint32_t GPIO_QSPI_SD1_EDGE_HIGH : 1;/*!< GPIO_QSPI_SD1_EDGE_HIGH                                                  */
      __IOM uint32_t GPIO_QSPI_SD2_LEVEL_LOW : 1;/*!< GPIO_QSPI_SD2_LEVEL_LOW                                                  */
      __IOM uint32_t GPIO_QSPI_SD2_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SD2_LEVEL_HIGH                                                */
      __IOM uint32_t GPIO_QSPI_SD2_EDGE_LOW : 1;/*!< GPIO_QSPI_SD2_EDGE_LOW                                                    */
      __IOM uint32_t GPIO_QSPI_SD2_EDGE_HIGH : 1;/*!< GPIO_QSPI_SD2_EDGE_HIGH                                                  */
      __IOM uint32_t GPIO_QSPI_SD3_LEVEL_LOW : 1;/*!< GPIO_QSPI_SD3_LEVEL_LOW                                                  */
      __IOM uint32_t GPIO_QSPI_SD3_LEVEL_HIGH : 1;/*!< GPIO_QSPI_SD3_LEVEL_HIGH                                                */
      __IOM uint32_t GPIO_QSPI_SD3_EDGE_LOW : 1;/*!< GPIO_QSPI_SD3_EDGE_LOW                                                    */
      __IOM uint32_t GPIO_QSPI_SD3_EDGE_HIGH : 1;/*!< GPIO_QSPI_SD3_EDGE_HIGH                                                  */
            uint32_t            : 8;
    } PROC0_INTE_b;
  } ;

  union {
    __IOM uint32_t PROC0_INTF;                  /*!< Interrupt Force for proc0                                                 */

