mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t SLEWFAST   : 1;            /*!< Slew rate control. 1 = Fast, 0 = Slow                                     */
      __IOM uint32_t SCHMITT    : 1;            /*!< Enable schmitt trigger                                                    */
      __IOM uint32_t PDE        : 1;            /*!< Pull down enable                                                          */
      __IOM uint32_t PUE        : 1;            /*!< Pull up enable                                                            */
      __IOM uint32_t DRIVE      : 2;            /*!< Drive strength.                                                           */
      __IOM uint32_t IE         : 1;            /*!< Input enable                                                              */
      __IOM uint32_t OD         : 1;            /*!< Output disable. Has priority over output enable from peripherals          */
            uint32_t            : 24;
    } GPIO12_b;
  } ;

  union {
    __IOM uint32_t GPIO13;                      /*!< Pad control register                                                      */

    struct {
      __IOM uint32_t SLEWFAST   : 1;            /*!< Slew rate control. 1 = Fast, 0 = Slow                                     */
      __IOM uint32_t SCHMITT    : 1;            /*!< Enable schmitt trigger                                                    */
      __IOM uint32_t PDE        : 1;            /*!< Pull down enable                                                          */
      __IOM uint32_t PUE        : 1;            /*!< Pull up enable                                                            */
      __IOM uint32_t DRIVE      : 2;            /*!< Drive strength.                                                           */
      __IOM uint32_t IE         : 1;            /*!< Input enable                                                              */
      __IOM uint32_t OD         : 1;            /*!< Output disable. Has priority over output enable from peripherals          */
            uint32_t            : 24;
    } GPIO13_b;
  } ;

  union {
    __IOM uint32_t GPIO14;                      /*!< Pad control register                                                      */

    struct {
      __IOM uint32_t SLEWFAST   : 1;            /*!< Slew rate control. 1 = Fast, 0 = Slow                                     */
      __IOM uint32_t SCHMITT    : 1;            /*!< Enable schmitt trigger                                                    */
      __IOM uint32_t PDE        : 1;            /*!< Pull down enable                                                          */
      __IOM uint32_t PUE        : 1;            /*!< Pull up enable                                                            */
      __IOM uint32_t DRIVE      : 2;            /*!< Drive strength.                                                           */
      __IOM uint32_t IE         : 1;            /*!< Input enable                                                              */
      __IOM uint32_t OD         : 1;            /*!< Output disable. Has priority over output enable from peripherals          */
            uint32_t            : 24;
    } GPIO14_b;
  } ;

  union {
    __IOM uint32_t GPIO15;                      /*!< Pad control register                                                      */

    struct {
      __IOM uint32_t SLEWFAST   : 1;            /*!< Slew rate control. 1 = Fast, 0 = Slow                                     */
      __IOM uint32_t SCHMITT    : 1;            /*!< Enable schmitt trigger                                                    */
      __IOM uint32_t PDE        : 1;            /*!< Pull down enable                                                          */
      __IOM uint32_t PUE        : 1;            /*!< Pull up enable                                                            */
      __IOM uint32_t DRIVE      : 2;            /*!< Drive strength.                                                           */
      __IOM uint32_t IE         : 1;            /*!< Input enable                                                              */
      __IOM uint32_t OD         : 1;            /*!< Output disable. Has priority over output enable from peripherals          */
            uint32_t            : 24;
    } GPIO15_b;
  } ;

  union {
    __IOM uint32_t GPIO16;                      /*!< Pad control register                                                      */

    struct {
      __IOM uint32_t SLEWFAST   : 1;            /*!< Slew rate control. 1 = Fast, 0 = Slow                                     */
      __IOM uint32_t SCHMITT    : 1;            /*!< Enable schmitt trigger                                                    */
      __IOM uint32_t PDE        : 1;            /*!< Pull down enable                                                          */
      __IOM uint32_t PUE        : 1;            /*!< Pull up enable                                                            */
      __IOM uint32_t DRIVE      : 2;            /*!< Drive strength.                                                           */
      __IOM uint32_t IE         : 1;            /*!< Input enable                                                              */
      __IOM uint32_t OD         : 1;            /*!< Output disable. Has priority over output enable from peripherals          */
            uint32_t            : 24;
    } GPIO16_b;
  } ;

  union {
    __IOM uint32_t GPIO17;                      /*!< Pad control register                                                      */

    struct {
      __IOM uint32_t SLEWFAST   : 1;            /*!< Slew rate control. 1 = Fast, 0 = Slow                                     */
      __IOM uint32_t SCHMITT    : 1;            /*!< Enable schmitt trigger                                                    */
      __IOM uint32_t PDE        : 1;            /*!< Pull down enable                                                          */
      __IOM uint32_t PUE        : 1;            /*!< Pull up enable                                                            */
      __IOM uint32_t DRIVE      : 2;            /*!< Drive strength.                                                           */
      __IOM uint32_t IE         : 1;            /*!< Input enable                                                              */
      __IOM uint32_t OD         : 1;            /*!< Output disable. Has priority over output enable from peripherals          */
            uint32_t            : 24;
    } GPIO17_b;
  } ;

  union {
    __IOM uint32_t GPIO18;                      /*!< Pad control register                                                      */

