mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t SLEWFAST   : 1;            /*!< Slew rate control. 1 = Fast, 0 = Slow                                     */
      __IOM uint32_t SCHMITT    : 1;            /*!< Enable schmitt trigger                                                    */
      __IOM uint32_t PDE        : 1;            /*!< Pull down enable                                                          */
      __IOM uint32_t PUE        : 1;            /*!< Pull up enable                                                            */
      __IOM uint32_t DRIVE      : 2;            /*!< Drive strength.                                                           */
      __IOM uint32_t IE         : 1;            /*!< Input enable                                                              */
      __IOM uint32_t OD         : 1;            /*!< Output disable. Has priority over output enable from peripherals          */
            uint32_t            : 24;
    } GPIO_QSPI_SD2_b;
  } ;

  union {
    __IOM uint32_t GPIO_QSPI_SD3;               /*!< Pad control register                                                      */

    struct {
      __IOM uint32_t SLEWFAST   : 1;            /*!< Slew rate control. 1 = Fast, 0 = Slow                                     */
      __IOM uint32_t SCHMITT    : 1;            /*!< Enable schmitt trigger                                                    */
      __IOM uint32_t PDE        : 1;            /*!< Pull down enable                                                          */
      __IOM uint32_t PUE        : 1;            /*!< Pull up enable                                                            */
      __IOM uint32_t DRIVE      : 2;            /*!< Drive strength.                                                           */
      __IOM uint32_t IE         : 1;            /*!< Input enable                                                              */
      __IOM uint32_t OD         : 1;            /*!< Output disable. Has priority over output enable from peripherals          */
            uint32_t            : 24;
    } GPIO_QSPI_SD3_b;
  } ;

  union {
    __IOM uint32_t GPIO_QSPI_SS;                /*!< Pad control register                                                      */

    struct {
      __IOM uint32_t SLEWFAST   : 1;            /*!< Slew rate control. 1 = Fast, 0 = Slow                                     */
      __IOM uint32_t SCHMITT    : 1;            /*!< Enable schmitt trigger                                                    */
      __IOM uint32_t PDE        : 1;            /*!< Pull down enable                                                          */
      __IOM uint32_t PUE        : 1;            /*!< Pull up enable                                                            */
      __IOM uint32_t DRIVE      : 2;            /*!< Drive strength.                                                           */
      __IOM uint32_t IE         : 1;            /*!< Input enable                                                              */
      __IOM uint32_t OD         : 1;            /*!< Output disable. Has priority over output enable from peripherals          */
            uint32_t            : 24;
    } GPIO_QSPI_SS_b;
  } ;
} PADS_QSPI_Type;                               /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           XOSC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Controls the crystal oscillator (XOSC)
  */

typedef struct {                                /*!< XOSC Structure                                                            */

  union {
    __IOM uint32_t CTRL;                        /*!< Crystal Oscillator Control                                                */

    struct {
      __IOM uint32_t FREQ_RANGE : 12;           /*!< Frequency range. This resets to 0xAA0 and cannot be changed.              */
      __IOM uint32_t ENABLE     : 12;           /*!< On power-up this field is initialised to DISABLE and the chip
                                                     runs from the ROSC.
                                                     If the chip has subsequently been programmed to run from
                                                     the XOSC then setting this field to DISABLE may lock-up
                                                     the chip. If this is a concern then run the clk_ref from
                                                     the ROSC and enable the clk_sys RESUS feature.
                                                     The 12-bit code is intended to give some protection against
                                                     accidental writes. An invalid setting will enable the oscillator.         */
            uint32_t            : 8;
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< Crystal Oscillator Status                                                 */

    struct {
      __IM  uint32_t FREQ_RANGE : 2;            /*!< The current frequency range setting, always reads 0                       */
            uint32_t            : 10;
      __IM  uint32_t ENABLED    : 1;            /*!< Oscillator is enabled but not necessarily running and stable,
                                                     resets to 0                                                               */
            uint32_t            : 11;
      __IOM uint32_t BADWRITE   : 1;            /*!< An invalid value has been written to CTRL_ENABLE or CTRL_FREQ_RANGE
                                                     or DORMANT                                                                */
            uint32_t            : 6;
      __IM  uint32_t STABLE     : 1;            /*!< Oscillator is running and stable                                          */
    } STATUS_b;
  } ;
  __IOM uint32_t  DORMANT;                      /*!< Crystal Oscillator pause control
                                                     This is used to save power by pausing the XOSC
                                                     On power-up this field is initialised to WAKE
                                                     An invalid write will also select WAKE
                                                     WARNING: stop the PLLs before selecting dormant mode
                                                     WARNING: setup the irq before selecting dormant mode                      */

  union {
    __IOM uint32_t STARTUP;                     /*!< Controls the startup delay                                                */

