mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t DELAY      : 14;           /*!< in multiples of 256*xtal_period. The reset value of 0xc4 corresponds
                                                     to approx 50 000 cycles.                                                  */
            uint32_t            : 6;
      __IOM uint32_t X4         : 1;            /*!< Multiplies the startup_delay by 4. This is of little value to
                                                     the user given that the delay can be programmed directly.                 */
            uint32_t            : 11;
    } STARTUP_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t COUNT;                       /*!< A down counter running at the xosc frequency which counts to
                                                     zero and stops.
                                                     To start the counter write a non-zero value.
                                                     Can be used for short software pauses when setting up time
                                                     sensitive hardware.                                                       */

    struct {
      __IOM uint32_t COUNT      : 8;            /*!< COUNT                                                                     */
            uint32_t            : 24;
    } COUNT_b;
  } ;
} XOSC_Type;                                    /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                          PLL_SYS                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief PLL_SYS (PLL_SYS)
  */

typedef struct {                                /*!< PLL_SYS Structure                                                         */

  union {
    __IOM uint32_t CS;                          /*!< Control and Status
                                                     GENERAL CONSTRAINTS:
                                                     Reference clock frequency min=5MHz, max=800MHz
                                                     Feedback divider min=16, max=320
                                                     VCO frequency min=750MHz, max=1600MHz                                     */

    struct {
      __IOM uint32_t REFDIV     : 6;            /*!< Divides the PLL input reference clock.
                                                     Behaviour is undefined for div=0.
                                                     PLL output will be unpredictable during refdiv changes,
                                                     wait for lock=1 before using it.                                          */
            uint32_t            : 2;
      __IOM uint32_t BYPASS     : 1;            /*!< Passes the reference clock to the output instead of the divided
                                                     VCO. The VCO continues to run so the user can switch between
                                                     the reference clock and the divided VCO but the output
                                                     will glitch when doing so.                                                */
            uint32_t            : 22;
      __IM  uint32_t LOCK       : 1;            /*!< PLL is locked                                                             */
    } CS_b;
  } ;

  union {
    __IOM uint32_t PWR;                         /*!< Controls the PLL power modes.                                             */

    struct {
      __IOM uint32_t PD         : 1;            /*!< PLL powerdown
                                                     To save power set high when PLL output not required.                      */
            uint32_t            : 1;
      __IOM uint32_t DSMPD      : 1;            /*!< PLL DSM powerdown
                                                     Nothing is achieved by setting this low.                                  */
      __IOM uint32_t POSTDIVPD  : 1;            /*!< PLL post divider powerdown
                                                     To save power set high when PLL output not required or
                                                     bypass=1.                                                                 */
            uint32_t            : 1;
      __IOM uint32_t VCOPD      : 1;            /*!< PLL VCO powerdown
                                                     To save power set high when PLL output not required or
                                                     bypass=1.                                                                 */
            uint32_t            : 26;
    } PWR_b;
  } ;

  union {
    __IOM uint32_t FBDIV_INT;                   /*!< Feedback divisor
                                                     (note: this PLL does not support fractional division)                     */

    struct {
      __IOM uint32_t FBDIV_INT  : 12;           /*!< see ctrl reg description for constraints                                  */
            uint32_t            : 20;
    } FBDIV_INT_b;
  } ;

  union {
    __IOM uint32_t PRIM;                        /*!< Controls the PLL post dividers for the primary output
                                                     (note: this PLL does not have a secondary output)
                                                     the primary output is driven from VCO divided by postdiv1*postdiv2        */

    struct {
            uint32_t            : 12;
      __IOM uint32_t POSTDIV2   : 3;            /*!< divide by 1-7                                                             */
            uint32_t            : 1;
      __IOM uint32_t POSTDIV1   : 3;            /*!< divide by 1-7                                                             */
            uint32_t            : 13;
    } PRIM_b;
  } ;
} PLL_SYS_Type;                                 /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                          BUSCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Register block for busfabric control signals and performance counters (BUSCTRL)
  */

typedef struct {                                /*!< BUSCTRL Structure                                                         */

  union {
    __IOM uint32_t BUS_PRIORITY;                /*!< Set the priority of each master for bus arbitration.                      */

