mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t PROC0      : 1;            /*!< 0 - low priority, 1 - high priority                                       */
            uint32_t            : 3;
      __IOM uint32_t PROC1      : 1;            /*!< 0 - low priority, 1 - high priority                                       */
            uint32_t            : 3;
      __IOM uint32_t DMA_R      : 1;            /*!< 0 - low priority, 1 - high priority                                       */
            uint32_t            : 3;
      __IOM uint32_t DMA_W      : 1;            /*!< 0 - low priority, 1 - high priority                                       */
            uint32_t            : 19;
    } BUS_PRIORITY_b;
  } ;

  union {
    __IOM uint32_t BUS_PRIORITY_ACK;            /*!< Bus priority acknowledge                                                  */

    struct {
      __IM  uint32_t BUS_PRIORITY_ACK : 1;      /*!< Goes to 1 once all arbiters have registered the new global priority
                                                     levels.
                                                     Arbiters update their local priority when servicing a new
                                                     nonsequential access.
                                                     In normal circumstances this will happen almost immediately.              */
            uint32_t            : 31;
    } BUS_PRIORITY_ACK_b;
  } ;

  union {
    __IOM uint32_t PERFCTR0;                    /*!< Bus fabric performance counter 0                                          */

    struct {
      __IOM uint32_t PERFCTR0   : 24;           /*!< Busfabric saturating performance counter 0
                                                     Count some event signal from the busfabric arbiters.
                                                     Write any value to clear. Select an event to count using
                                                     PERFSEL0                                                                  */
            uint32_t            : 8;
    } PERFCTR0_b;
  } ;

  union {
    __IOM uint32_t PERFSEL0;                    /*!< Bus fabric performance event select for PERFCTR0                          */

    struct {
      __IOM uint32_t PERFSEL0   : 5;            /*!< Select an event for PERFCTR0. Count either contested accesses,
                                                     or all accesses, on a downstream port of the main crossbar.               */
            uint32_t            : 27;
    } PERFSEL0_b;
  } ;

  union {
    __IOM uint32_t PERFCTR1;                    /*!< Bus fabric performance counter 1                                          */

    struct {
      __IOM uint32_t PERFCTR1   : 24;           /*!< Busfabric saturating performance counter 1
                                                     Count some event signal from the busfabric arbiters.
                                                     Write any value to clear. Select an event to count using
                                                     PERFSEL1                                                                  */
            uint32_t            : 8;
    } PERFCTR1_b;
  } ;

  union {
    __IOM uint32_t PERFSEL1;                    /*!< Bus fabric performance event select for PERFCTR1                          */

    struct {
      __IOM uint32_t PERFSEL1   : 5;            /*!< Select an event for PERFCTR1. Count either contested accesses,
                                                     or all accesses, on a downstream port of the main crossbar.               */
            uint32_t            : 27;
    } PERFSEL1_b;
  } ;

  union {
    __IOM uint32_t PERFCTR2;                    /*!< Bus fabric performance counter 2                                          */

    struct {
      __IOM uint32_t PERFCTR2   : 24;           /*!< Busfabric saturating performance counter 2
                                                     Count some event signal from the busfabric arbiters.
                                                     Write any value to clear. Select an event to count using
                                                     PERFSEL2                                                                  */
            uint32_t            : 8;
    } PERFCTR2_b;
  } ;

  union {
    __IOM uint32_t PERFSEL2;                    /*!< Bus fabric performance event select for PERFCTR2                          */

    struct {
      __IOM uint32_t PERFSEL2   : 5;            /*!< Select an event for PERFCTR2. Count either contested accesses,
                                                     or all accesses, on a downstream port of the main crossbar.               */
            uint32_t            : 27;
    } PERFSEL2_b;
  } ;

  union {
    __IOM uint32_t PERFCTR3;                    /*!< Bus fabric performance counter 3                                          */

    struct {
      __IOM uint32_t PERFCTR3   : 24;           /*!< Busfabric saturating performance counter 3
                                                     Count some event signal from the busfabric arbiters.
                                                     Write any value to clear. Select an event to count using
                                                     PERFSEL3                                                                  */
            uint32_t            : 8;
    } PERFCTR3_b;
  } ;

  union {
    __IOM uint32_t PERFSEL3;                    /*!< Bus fabric performance event select for PERFCTR3                          */

    struct {
      __IOM uint32_t PERFSEL3   : 5;            /*!< Select an event for PERFCTR3. Count either contested accesses,
                                                     or all accesses, on a downstream port of the main crossbar.               */
            uint32_t            : 27;
    } PERFSEL3_b;
  } ;
} BUSCTRL_Type;                                 /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART0 (UART0)
  */

typedef struct {                                /*!< UART0 Structure                                                           */

  union {
    __IOM uint32_t UARTDR;                      /*!< Data Register, UARTDR                                                     */

