mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t CTS        : 1;            /*!< Clear to send. This bit is the complement of the UART clear
                                                     to send, nUARTCTS, modem status input. That is, the bit
                                                     is 1 when nUARTCTS is LOW.                                                */
      __IM  uint32_t DSR        : 1;            /*!< Data set ready. This bit is the complement of the UART data
                                                     set ready, nUARTDSR, modem status input. That is, the bit
                                                     is 1 when nUARTDSR is LOW.                                                */
      __IM  uint32_t DCD        : 1;            /*!< Data carrier detect. This bit is the complement of the UART
                                                     data carrier detect, nUARTDCD, modem status input. That
                                                     is, the bit is 1 when nUARTDCD is LOW.                                    */
      __IM  uint32_t BUSY       : 1;            /*!< UART busy. If this bit is set to 1, the UART is busy transmitting
                                                     data. This bit remains set until the complete byte, including
                                                     all the stop bits, has been sent from the shift register.
                                                     This bit is set as soon as the transmit FIFO becomes non-empty,
                                                     regardless of whether the UART is enabled or not.                         */
      __IM  uint32_t RXFE       : 1;            /*!< Receive FIFO empty. The meaning of this bit depends on the state
                                                     of the FEN bit in the UARTLCR_H Register. If the FIFO is
                                                     disabled, this bit is set when the receive holding register
                                                     is empty. If the FIFO is enabled, the RXFE bit is set when
                                                     the receive FIFO is empty.                                                */
      __IM  uint32_t TXFF       : 1;            /*!< Transmit FIFO full. The meaning of this bit depends on the state
                                                     of the FEN bit in the UARTLCR_H Register. If the FIFO is
                                                     disabled, this bit is set when the transmit holding register
                                                     is full. If the FIFO is enabled, the TXFF bit is set when
                                                     the transmit FIFO is full.                                                */
      __IM  uint32_t RXFF       : 1;            /*!< Receive FIFO full. The meaning of this bit depends on the state
                                                     of the FEN bit in the UARTLCR_H Register. If the FIFO is
                                                     disabled, this bit is set when the receive holding register
                                                     is full. If the FIFO is enabled, the RXFF bit is set when
                                                     the receive FIFO is full.                                                 */
      __IM  uint32_t TXFE       : 1;            /*!< Transmit FIFO empty. The meaning of this bit depends on the
                                                     state of the FEN bit in the Line Control Register, UARTLCR_H.
                                                     If the FIFO is disabled, this bit is set when the transmit
                                                     holding register is empty. If the FIFO is enabled, the
                                                     TXFE bit is set when the transmit FIFO is empty. This bit
                                                     does not indicate if there is data in the transmit shift
                                                     register.                                                                 */
      __IM  uint32_t RI         : 1;            /*!< Ring indicator. This bit is the complement of the UART ring
                                                     indicator, nUARTRI, modem status input. That is, the bit
                                                     is 1 when nUARTRI is LOW.                                                 */
            uint32_t            : 23;
    } UARTFR_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t UARTILPR;                    /*!< IrDA Low-Power Counter Register, UARTILPR                                 */

    struct {
      __IOM uint32_t ILPDVSR    : 8;            /*!< 8-bit low-power divisor value. These bits are cleared to 0 at
                                                     reset.                                                                    */
            uint32_t            : 24;
    } UARTILPR_b;
  } ;

  union {
    __IOM uint32_t UARTIBRD;                    /*!< Integer Baud Rate Register, UARTIBRD                                      */

    struct {
      __IOM uint32_t BAUD_DIVINT : 16;          /*!< The integer baud rate divisor. These bits are cleared to 0 on
                                                     reset.                                                                    */
            uint32_t            : 16;
    } UARTIBRD_b;
  } ;

  union {
    __IOM uint32_t UARTFBRD;                    /*!< Fractional Baud Rate Register, UARTFBRD                                   */

    struct {
      __IOM uint32_t BAUD_DIVFRAC : 6;          /*!< The fractional baud rate divisor. These bits are cleared to
                                                     0 on reset.                                                               */
            uint32_t            : 26;
    } UARTFBRD_b;
  } ;

  union {
    __IOM uint32_t UARTLCR_H;                   /*!< Line Control Register, UARTLCR_H                                          */

