mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t TXIFLSEL   : 3;            /*!< Transmit interrupt FIFO level select. The trigger points for
                                                     the transmit interrupt are as follows: b000 = Transmit
                                                     FIFO becomes <= 1 / 8 full b001 = Transmit FIFO becomes
                                                     <= 1 / 4 full b010 = Transmit FIFO becomes <= 1 / 2 full
                                                     b011 = Transmit FIFO becomes <= 3 / 4 full b100 = Transmit
                                                     FIFO becomes <= 7 / 8 full b101-b111 = reserved.                          */
      __IOM uint32_t RXIFLSEL   : 3;            /*!< Receive interrupt FIFO level select. The trigger points for
                                                     the receive interrupt are as follows: b000 = Receive FIFO
                                                     becomes >= 1 / 8 full b001 = Receive FIFO becomes >= 1
                                                     / 4 full b010 = Receive FIFO becomes >= 1 / 2 full b011
                                                     = Receive FIFO becomes >= 3 / 4 full b100 = Receive FIFO
                                                     becomes >= 7 / 8 full b101-b111 = reserved.                               */
            uint32_t            : 26;
    } UARTIFLS_b;
  } ;

  union {
    __IOM uint32_t UARTIMSC;                    /*!< Interrupt Mask Set/Clear Register, UARTIMSC                               */

    struct {
      __IOM uint32_t RIMIM      : 1;            /*!< nUARTRI modem interrupt mask. A read returns the current mask
                                                     for the UARTRIINTR interrupt. On a write of 1, the mask
                                                     of the UARTRIINTR interrupt is set. A write of 0 clears
                                                     the mask.                                                                 */
      __IOM uint32_t CTSMIM     : 1;            /*!< nUARTCTS modem interrupt mask. A read returns the current mask
                                                     for the UARTCTSINTR interrupt. On a write of 1, the mask
                                                     of the UARTCTSINTR interrupt is set. A write of 0 clears
                                                     the mask.                                                                 */
      __IOM uint32_t DCDMIM     : 1;            /*!< nUARTDCD modem interrupt mask. A read returns the current mask
                                                     for the UARTDCDINTR interrupt. On a write of 1, the mask
                                                     of the UARTDCDINTR interrupt is set. A write of 0 clears
                                                     the mask.                                                                 */
      __IOM uint32_t DSRMIM     : 1;            /*!< nUARTDSR modem interrupt mask. A read returns the current mask
                                                     for the UARTDSRINTR interrupt. On a write of 1, the mask
                                                     of the UARTDSRINTR interrupt is set. A write of 0 clears
                                                     the mask.                                                                 */
      __IOM uint32_t RXIM       : 1;            /*!< Receive interrupt mask. A read returns the current mask for
                                                     the UARTRXINTR interrupt. On a write of 1, the mask of
                                                     the UARTRXINTR interrupt is set. A write of 0 clears the
                                                     mask.                                                                     */
      __IOM uint32_t TXIM       : 1;            /*!< Transmit interrupt mask. A read returns the current mask for
                                                     the UARTTXINTR interrupt. On a write of 1, the mask of
                                                     the UARTTXINTR interrupt is set. A write of 0 clears the
                                                     mask.                                                                     */
      __IOM uint32_t RTIM       : 1;            /*!< Receive timeout interrupt mask. A read returns the current mask
                                                     for the UARTRTINTR interrupt. On a write of 1, the mask
                                                     of the UARTRTINTR interrupt is set. A write of 0 clears
                                                     the mask.                                                                 */
      __IOM uint32_t FEIM       : 1;            /*!< Framing error interrupt mask. A read returns the current mask
                                                     for the UARTFEINTR interrupt. On a write of 1, the mask
                                                     of the UARTFEINTR interrupt is set. A write of 0 clears
                                                     the mask.                                                                 */
      __IOM uint32_t PEIM       : 1;            /*!< Parity error interrupt mask. A read returns the current mask
                                                     for the UARTPEINTR interrupt. On a write of 1, the mask
                                                     of the UARTPEINTR interrupt is set. A write of 0 clears
                                                     the mask.                                                                 */
      __IOM uint32_t BEIM       : 1;            /*!< Break error interrupt mask. A read returns the current mask
                                                     for the UARTBEINTR interrupt. On a write of 1, the mask
                                                     of the UARTBEINTR interrupt is set. A write of 0 clears
                                                     the mask.                                                                 */
      __IOM uint32_t OEIM       : 1;            /*!< Overrun error interrupt mask. A read returns the current mask
                                                     for the UARTOEINTR interrupt. On a write of 1, the mask
                                                     of the UARTOEINTR interrupt is set. A write of 0 clears
                                                     the mask.                                                                 */
            uint32_t            : 21;
    } UARTIMSC_b;
  } ;

  union {
    __IOM uint32_t UARTRIS;                     /*!< Raw Interrupt Status Register, UARTRIS                                    */

