mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t RIRMIS     : 1;            /*!< nUARTRI modem interrupt status. Returns the raw interrupt state
                                                     of the UARTRIINTR interrupt.                                              */
      __IM  uint32_t CTSRMIS    : 1;            /*!< nUARTCTS modem interrupt status. Returns the raw interrupt state
                                                     of the UARTCTSINTR interrupt.                                             */
      __IM  uint32_t DCDRMIS    : 1;            /*!< nUARTDCD modem interrupt status. Returns the raw interrupt state
                                                     of the UARTDCDINTR interrupt.                                             */
      __IM  uint32_t DSRRMIS    : 1;            /*!< nUARTDSR modem interrupt status. Returns the raw interrupt state
                                                     of the UARTDSRINTR interrupt.                                             */
      __IM  uint32_t RXRIS      : 1;            /*!< Receive interrupt status. Returns the raw interrupt state of
                                                     the UARTRXINTR interrupt.                                                 */
      __IM  uint32_t TXRIS      : 1;            /*!< Transmit interrupt status. Returns the raw interrupt state of
                                                     the UARTTXINTR interrupt.                                                 */
      __IM  uint32_t RTRIS      : 1;            /*!< Receive timeout interrupt status. Returns the raw interrupt
                                                     state of the UARTRTINTR interrupt. a                                      */
      __IM  uint32_t FERIS      : 1;            /*!< Framing error interrupt status. Returns the raw interrupt state
                                                     of the UARTFEINTR interrupt.                                              */
      __IM  uint32_t PERIS      : 1;            /*!< Parity error interrupt status. Returns the raw interrupt state
                                                     of the UARTPEINTR interrupt.                                              */
      __IM  uint32_t BERIS      : 1;            /*!< Break error interrupt status. Returns the raw interrupt state
                                                     of the UARTBEINTR interrupt.                                              */
      __IM  uint32_t OERIS      : 1;            /*!< Overrun error interrupt status. Returns the raw interrupt state
                                                     of the UARTOEINTR interrupt.                                              */
            uint32_t            : 21;
    } UARTRIS_b;
  } ;

  union {
    __IOM uint32_t UARTMIS;                     /*!< Masked Interrupt Status Register, UARTMIS                                 */

    struct {
      __IM  uint32_t RIMMIS     : 1;            /*!< nUARTRI modem masked interrupt status. Returns the masked interrupt
                                                     state of the UARTRIINTR interrupt.                                        */
      __IM  uint32_t CTSMMIS    : 1;            /*!< nUARTCTS modem masked interrupt status. Returns the masked interrupt
                                                     state of the UARTCTSINTR interrupt.                                       */
      __IM  uint32_t DCDMMIS    : 1;            /*!< nUARTDCD modem masked interrupt status. Returns the masked interrupt
                                                     state of the UARTDCDINTR interrupt.                                       */
      __IM  uint32_t DSRMMIS    : 1;            /*!< nUARTDSR modem masked interrupt status. Returns the masked interrupt
                                                     state of the UARTDSRINTR interrupt.                                       */
      __IM  uint32_t RXMIS      : 1;            /*!< Receive masked interrupt status. Returns the masked interrupt
                                                     state of the UARTRXINTR interrupt.                                        */
      __IM  uint32_t TXMIS      : 1;            /*!< Transmit masked interrupt status. Returns the masked interrupt
                                                     state of the UARTTXINTR interrupt.                                        */
      __IM  uint32_t RTMIS      : 1;            /*!< Receive timeout masked interrupt status. Returns the masked
                                                     interrupt state of the UARTRTINTR interrupt.                              */
      __IM  uint32_t FEMIS      : 1;            /*!< Framing error masked interrupt status. Returns the masked interrupt
                                                     state of the UARTFEINTR interrupt.                                        */
      __IM  uint32_t PEMIS      : 1;            /*!< Parity error masked interrupt status. Returns the masked interrupt
                                                     state of the UARTPEINTR interrupt.                                        */
      __IM  uint32_t BEMIS      : 1;            /*!< Break error masked interrupt status. Returns the masked interrupt
                                                     state of the UARTBEINTR interrupt.                                        */
      __IM  uint32_t OEMIS      : 1;            /*!< Overrun error masked interrupt status. Returns the masked interrupt
                                                     state of the UARTOEINTR interrupt.                                        */
            uint32_t            : 21;
    } UARTMIS_b;
  } ;

  union {
    __IOM uint32_t UARTICR;                     /*!< Interrupt Clear Register, UARTICR                                         */

    struct {
      __IOM uint32_t RIMIC      : 1;            /*!< nUARTRI modem interrupt clear. Clears the UARTRIINTR interrupt.           */
      __IOM uint32_t CTSMIC     : 1;            /*!< nUARTCTS modem interrupt clear. Clears the UARTCTSINTR interrupt.         */
      __IOM uint32_t DCDMIC     : 1;            /*!< nUARTDCD modem interrupt clear. Clears the UARTDCDINTR interrupt.         */
      __IOM uint32_t DSRMIC     : 1;            /*!< nUARTDSR modem interrupt clear. Clears the UARTDSRINTR interrupt.         */
      __IOM uint32_t RXIC       : 1;            /*!< Receive interrupt clear. Clears the UARTRXINTR interrupt.                 */
      __IOM uint32_t TXIC       : 1;            /*!< Transmit interrupt clear. Clears the UARTTXINTR interrupt.                */
      __IOM uint32_t RTIC       : 1;            /*!< Receive timeout interrupt clear. Clears the UARTRTINTR interrupt.         */
      __IOM uint32_t FEIC       : 1;            /*!< Framing error interrupt clear. Clears the UARTFEINTR interrupt.           */
      __IOM uint32_t PEIC       : 1;            /*!< Parity error interrupt clear. Clears the UARTPEINTR interrupt.            */
      __IOM uint32_t BEIC       : 1;            /*!< Break error interrupt clear. Clears the UARTBEINTR interrupt.             */
      __IOM uint32_t OEIC       : 1;            /*!< Overrun error interrupt clear. Clears the UARTOEINTR interrupt.           */
            uint32_t            : 21;
    } UARTICR_b;
  } ;

  union {
    __IOM uint32_t UARTDMACR;                   /*!< DMA Control Register, UARTDMACR                                           */

