mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t RXDMAE     : 1;            /*!< Receive DMA enable. If this bit is set to 1, DMA for the receive
                                                     FIFO is enabled.                                                          */
      __IOM uint32_t TXDMAE     : 1;            /*!< Transmit DMA enable. If this bit is set to 1, DMA for the transmit
                                                     FIFO is enabled.                                                          */
      __IOM uint32_t DMAONERR   : 1;            /*!< DMA on error. If this bit is set to 1, the DMA receive request
                                                     outputs, UARTRXDMASREQ or UARTRXDMABREQ, are disabled when
                                                     the UART error interrupt is asserted.                                     */
            uint32_t            : 29;
    } UARTDMACR_b;
  } ;
  __IM  uint32_t  RESERVED2[997];

  union {
    __IOM uint32_t UARTPERIPHID0;               /*!< UARTPeriphID0 Register                                                    */

    struct {
      __IM  uint32_t PARTNUMBER0 : 8;           /*!< These bits read back as 0x11                                              */
            uint32_t            : 24;
    } UARTPERIPHID0_b;
  } ;

  union {
    __IOM uint32_t UARTPERIPHID1;               /*!< UARTPeriphID1 Register                                                    */

    struct {
      __IM  uint32_t PARTNUMBER1 : 4;           /*!< These bits read back as 0x0                                               */
      __IM  uint32_t DESIGNER0  : 4;            /*!< These bits read back as 0x1                                               */
            uint32_t            : 24;
    } UARTPERIPHID1_b;
  } ;

  union {
    __IOM uint32_t UARTPERIPHID2;               /*!< UARTPeriphID2 Register                                                    */

    struct {
      __IM  uint32_t DESIGNER1  : 4;            /*!< These bits read back as 0x4                                               */
      __IM  uint32_t REVISION   : 4;            /*!< This field depends on the revision of the UART: r1p0 0x0 r1p1
                                                     0x1 r1p3 0x2 r1p4 0x2 r1p5 0x3                                            */
            uint32_t            : 24;
    } UARTPERIPHID2_b;
  } ;

  union {
    __IOM uint32_t UARTPERIPHID3;               /*!< UARTPeriphID3 Register                                                    */

    struct {
      __IM  uint32_t CONFIGURATION : 8;         /*!< These bits read back as 0x00                                              */
            uint32_t            : 24;
    } UARTPERIPHID3_b;
  } ;

  union {
    __IOM uint32_t UARTPCELLID0;                /*!< UARTPCellID0 Register                                                     */

    struct {
      __IM  uint32_t UARTPCELLID0 : 8;          /*!< These bits read back as 0x0D                                              */
            uint32_t            : 24;
    } UARTPCELLID0_b;
  } ;

  union {
    __IOM uint32_t UARTPCELLID1;                /*!< UARTPCellID1 Register                                                     */

    struct {
      __IM  uint32_t UARTPCELLID1 : 8;          /*!< These bits read back as 0xF0                                              */
            uint32_t            : 24;
    } UARTPCELLID1_b;
  } ;

  union {
    __IOM uint32_t UARTPCELLID2;                /*!< UARTPCellID2 Register                                                     */

    struct {
      __IM  uint32_t UARTPCELLID2 : 8;          /*!< These bits read back as 0x05                                              */
            uint32_t            : 24;
    } UARTPCELLID2_b;
  } ;

  union {
    __IOM uint32_t UARTPCELLID3;                /*!< UARTPCellID3 Register                                                     */

    struct {
      __IM  uint32_t UARTPCELLID3 : 8;          /*!< These bits read back as 0xB1                                              */
            uint32_t            : 24;
    } UARTPCELLID3_b;
  } ;
} UART0_Type;                                   /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                           SPI0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SPI0 (SPI0)
  */

typedef struct {                                /*!< SPI0 Structure                                                            */

  union {
    __IOM uint32_t SSPCR0;                      /*!< Control register 0, SSPCR0 on page 3-4                                    */

    struct {
      __IOM uint32_t DSS        : 4;            /*!< Data Size Select: 0000 Reserved, undefined operation. 0001 Reserved,
                                                     undefined operation. 0010 Reserved, undefined operation.
                                                     0011 4-bit data. 0100 5-bit data. 0101 6-bit data. 0110
                                                     7-bit data. 0111 8-bit data. 1000 9-bit data. 1001 10-bit
                                                     data. 1010 11-bit data. 1011 12-bit data. 1100 13-bit data.
                                                     1101 14-bit data. 1110 15-bit data. 1111 16-bit data.                     */
      __IOM uint32_t FRF        : 2;            /*!< Frame format: 00 Motorola SPI frame format. 01 TI synchronous
                                                     serial frame format. 10 National Microwire frame format.
                                                     11 Reserved, undefined operation.                                         */
      __IOM uint32_t SPO        : 1;            /*!< SSPCLKOUT polarity, applicable to Motorola SPI frame format
                                                     only. See Motorola SPI frame format on page 2-10.                         */
      __IOM uint32_t SPH        : 1;            /*!< SSPCLKOUT phase, applicable to Motorola SPI frame format only.
                                                     See Motorola SPI frame format on page 2-10.                               */
      __IOM uint32_t SCR        : 8;            /*!< Serial clock rate. The value SCR is used to generate the transmit
                                                     and receive bit rate of the PrimeCell SSP. The bit rate
                                                     is: F SSPCLK CPSDVSR x (1+SCR) where CPSDVSR is an even
                                                     value from 2-254, programmed through the SSPCPSR register
                                                     and SCR is a value from 0-255.                                            */
            uint32_t            : 16;
    } SSPCR0_b;
  } ;

  union {
    __IOM uint32_t SSPCR1;                      /*!< Control register 1, SSPCR1 on page 3-5                                    */

