mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t LBM        : 1;            /*!< Loop back mode: 0 Normal serial port operation enabled. 1 Output
                                                     of transmit serial shifter is connected to input of receive
                                                     serial shifter internally.                                                */
      __IOM uint32_t SSE        : 1;            /*!< Synchronous serial port enable: 0 SSP operation disabled. 1
                                                     SSP operation enabled.                                                    */
      __IOM uint32_t MS         : 1;            /*!< Master or slave mode select. This bit can be modified only when
                                                     the PrimeCell SSP is disabled, SSE=0: 0 Device configured
                                                     as master, default. 1 Device configured as slave.                         */
      __IOM uint32_t SOD        : 1;            /*!< Slave-mode output disable. This bit is relevant only in the
                                                     slave mode, MS=1. In multiple-slave systems, it is possible
                                                     for an PrimeCell SSP master to broadcast a message to all
                                                     slaves in the system while ensuring that only one slave
                                                     drives data onto its serial output line. In such systems
                                                     the RXD lines from multiple slaves could be tied together.
                                                     To operate in such systems, the SOD bit can be set if the
                                                     PrimeCell SSP slave is not supposed to drive the SSPTXD
                                                     line: 0 SSP can drive the SSPTXD output in slave mode.
                                                     1 SSP must not drive the SSPTXD output in slave mode.                     */
            uint32_t            : 28;
    } SSPCR1_b;
  } ;

  union {
    __IOM uint32_t SSPDR;                       /*!< Data register, SSPDR on page 3-6                                          */

    struct {
      __IOM uint32_t DATA       : 16;           /*!< Transmit/Receive FIFO: Read Receive FIFO. Write Transmit FIFO.
                                                     You must right-justify data when the PrimeCell SSP is programmed
                                                     for a data size that is less than 16 bits. Unused bits
                                                     at the top are ignored by transmit logic. The receive logic
                                                     automatically right-justifies.                                            */
            uint32_t            : 16;
    } SSPDR_b;
  } ;

  union {
    __IOM uint32_t SSPSR;                       /*!< Status register, SSPSR on page 3-7                                        */

    struct {
      __IM  uint32_t TFE        : 1;            /*!< Transmit FIFO empty, RO: 0 Transmit FIFO is not empty. 1 Transmit
                                                     FIFO is empty.                                                            */
      __IM  uint32_t TNF        : 1;            /*!< Transmit FIFO not full, RO: 0 Transmit FIFO is full. 1 Transmit
                                                     FIFO is not full.                                                         */
      __IM  uint32_t RNE        : 1;            /*!< Receive FIFO not empty, RO: 0 Receive FIFO is empty. 1 Receive
                                                     FIFO is not empty.                                                        */
      __IM  uint32_t RFF        : 1;            /*!< Receive FIFO full, RO: 0 Receive FIFO is not full. 1 Receive
                                                     FIFO is full.                                                             */
      __IM  uint32_t BSY        : 1;            /*!< PrimeCell SSP busy flag, RO: 0 SSP is idle. 1 SSP is currently
                                                     transmitting and/or receiving a frame or the transmit FIFO
                                                     is not empty.                                                             */
            uint32_t            : 27;
    } SSPSR_b;
  } ;

  union {
    __IOM uint32_t SSPCPSR;                     /*!< Clock prescale register, SSPCPSR on page 3-8                              */

    struct {
      __IOM uint32_t CPSDVSR    : 8;            /*!< Clock prescale divisor. Must be an even number from 2-254, depending
                                                     on the frequency of SSPCLK. The least significant bit always
                                                     returns zero on reads.                                                    */
            uint32_t            : 24;
    } SSPCPSR_b;
  } ;

  union {
    __IOM uint32_t SSPIMSC;                     /*!< Interrupt mask set or clear register, SSPIMSC on page 3-9                 */

    struct {
      __IOM uint32_t RORIM      : 1;            /*!< Receive overrun interrupt mask: 0 Receive FIFO written to while
                                                     full condition interrupt is masked. 1 Receive FIFO written
                                                     to while full condition interrupt is not masked.                          */
      __IOM uint32_t RTIM       : 1;            /*!< Receive timeout interrupt mask: 0 Receive FIFO not empty and
                                                     no read prior to timeout period interrupt is masked. 1
                                                     Receive FIFO not empty and no read prior to timeout period
                                                     interrupt is not masked.                                                  */
      __IOM uint32_t RXIM       : 1;            /*!< Receive FIFO interrupt mask: 0 Receive FIFO half full or less
                                                     condition interrupt is masked. 1 Receive FIFO half full
                                                     or less condition interrupt is not masked.                                */
      __IOM uint32_t TXIM       : 1;            /*!< Transmit FIFO interrupt mask: 0 Transmit FIFO half empty or
                                                     less condition interrupt is masked. 1 Transmit FIFO half
                                                     empty or less condition interrupt is not masked.                          */
            uint32_t            : 28;
    } SSPIMSC_b;
  } ;

  union {
    __IOM uint32_t SSPRIS;                      /*!< Raw interrupt status register, SSPRIS on page 3-10                        */

