mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t RORRIS     : 1;            /*!< Gives the raw interrupt state, prior to masking, of the SSPRORINTR
                                                     interrupt                                                                 */
      __IM  uint32_t RTRIS      : 1;            /*!< Gives the raw interrupt state, prior to masking, of the SSPRTINTR
                                                     interrupt                                                                 */
      __IM  uint32_t RXRIS      : 1;            /*!< Gives the raw interrupt state, prior to masking, of the SSPRXINTR
                                                     interrupt                                                                 */
      __IM  uint32_t TXRIS      : 1;            /*!< Gives the raw interrupt state, prior to masking, of the SSPTXINTR
                                                     interrupt                                                                 */
            uint32_t            : 28;
    } SSPRIS_b;
  } ;

  union {
    __IOM uint32_t SSPMIS;                      /*!< Masked interrupt status register, SSPMIS on page 3-11                     */

    struct {
      __IM  uint32_t RORMIS     : 1;            /*!< Gives the receive over run masked interrupt status, after masking,
                                                     of the SSPRORINTR interrupt                                               */
      __IM  uint32_t RTMIS      : 1;            /*!< Gives the receive timeout masked interrupt state, after masking,
                                                     of the SSPRTINTR interrupt                                                */
      __IM  uint32_t RXMIS      : 1;            /*!< Gives the receive FIFO masked interrupt state, after masking,
                                                     of the SSPRXINTR interrupt                                                */
      __IM  uint32_t TXMIS      : 1;            /*!< Gives the transmit FIFO masked interrupt state, after masking,
                                                     of the SSPTXINTR interrupt                                                */
            uint32_t            : 28;
    } SSPMIS_b;
  } ;

  union {
    __IOM uint32_t SSPICR;                      /*!< Interrupt clear register, SSPICR on page 3-11                             */

    struct {
      __IOM uint32_t RORIC      : 1;            /*!< Clears the SSPRORINTR interrupt                                           */
      __IOM uint32_t RTIC       : 1;            /*!< Clears the SSPRTINTR interrupt                                            */
            uint32_t            : 30;
    } SSPICR_b;
  } ;

  union {
    __IOM uint32_t SSPDMACR;                    /*!< DMA control register, SSPDMACR on page 3-12                               */

    struct {
      __IOM uint32_t RXDMAE     : 1;            /*!< Receive DMA Enable. If this bit is set to 1, DMA for the receive
                                                     FIFO is enabled.                                                          */
      __IOM uint32_t TXDMAE     : 1;            /*!< Transmit DMA Enable. If this bit is set to 1, DMA for the transmit
                                                     FIFO is enabled.                                                          */
            uint32_t            : 30;
    } SSPDMACR_b;
  } ;
  __IM  uint32_t  RESERVED[1006];

  union {
    __IOM uint32_t SSPPERIPHID0;                /*!< Peripheral identification registers, SSPPeriphID0-3 on page
                                                     3-13                                                                      */

    struct {
      __IM  uint32_t PARTNUMBER0 : 8;           /*!< These bits read back as 0x22                                              */
            uint32_t            : 24;
    } SSPPERIPHID0_b;
  } ;

  union {
    __IOM uint32_t SSPPERIPHID1;                /*!< Peripheral identification registers, SSPPeriphID0-3 on page
                                                     3-13                                                                      */

    struct {
      __IM  uint32_t PARTNUMBER1 : 4;           /*!< These bits read back as 0x0                                               */
      __IM  uint32_t DESIGNER0  : 4;            /*!< These bits read back as 0x1                                               */
            uint32_t            : 24;
    } SSPPERIPHID1_b;
  } ;

  union {
    __IOM uint32_t SSPPERIPHID2;                /*!< Peripheral identification registers, SSPPeriphID0-3 on page
                                                     3-13                                                                      */

    struct {
      __IM  uint32_t DESIGNER1  : 4;            /*!< These bits read back as 0x4                                               */
      __IM  uint32_t REVISION   : 4;            /*!< These bits return the peripheral revision                                 */
            uint32_t            : 24;
    } SSPPERIPHID2_b;
  } ;

  union {
    __IOM uint32_t SSPPERIPHID3;                /*!< Peripheral identification registers, SSPPeriphID0-3 on page
                                                     3-13                                                                      */

    struct {
      __IM  uint32_t CONFIGURATION : 8;         /*!< These bits read back as 0x00                                              */
            uint32_t            : 24;
    } SSPPERIPHID3_b;
  } ;

  union {
    __IOM uint32_t SSPPCELLID0;                 /*!< PrimeCell identification registers, SSPPCellID0-3 on page 3-16            */

    struct {
      __IM  uint32_t SSPPCELLID0 : 8;           /*!< These bits read back as 0x0D                                              */
            uint32_t            : 24;
    } SSPPCELLID0_b;
  } ;

  union {
    __IOM uint32_t SSPPCELLID1;                 /*!< PrimeCell identification registers, SSPPCellID0-3 on page 3-16            */

