mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t SSPPCELLID1 : 8;           /*!< These bits read back as 0xF0                                              */
            uint32_t            : 24;
    } SSPPCELLID1_b;
  } ;

  union {
    __IOM uint32_t SSPPCELLID2;                 /*!< PrimeCell identification registers, SSPPCellID0-3 on page 3-16            */

    struct {
      __IM  uint32_t SSPPCELLID2 : 8;           /*!< These bits read back as 0x05                                              */
            uint32_t            : 24;
    } SSPPCELLID2_b;
  } ;

  union {
    __IOM uint32_t SSPPCELLID3;                 /*!< PrimeCell identification registers, SSPPCellID0-3 on page 3-16            */

    struct {
      __IM  uint32_t SSPPCELLID3 : 8;           /*!< These bits read back as 0xB1                                              */
            uint32_t            : 24;
    } SSPPCELLID3_b;
  } ;
} SPI0_Type;                                    /*!< Size = 4096 (0x1000)                                                      */



/* =========================================================================================================================== */
/* ================                                           I2C0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DW_apb_i2c address block
        List of configuration constants for the Synopsys I2C hardware (you may see references to these in I2C register header; these are *fixed* values, set at hardware design time):
        IC_ULTRA_FAST_MODE ................ 0x0
        IC_UFM_TBUF_CNT_DEFAULT ........... 0x8
        IC_UFM_SCL_LOW_COUNT .............. 0x0008
        IC_UFM_SCL_HIGH_COUNT ............. 0x0006
        IC_TX_TL .......................... 0x0
        IC_TX_CMD_BLOCK ................... 0x1
        IC_HAS_DMA ........................ 0x1
        IC_HAS_ASYNC_FIFO ................. 0x0
        IC_SMBUS_ARP ...................... 0x0
        IC_FIRST_DATA_BYTE_STATUS ......... 0x1
        IC_INTR_IO ........................ 0x1
        IC_MASTER_MODE .................... 0x1
        IC_DEFAULT_ACK_GENERAL_CALL ....... 0x1
        IC_INTR_POL ....................... 0x1
        IC_OPTIONAL_SAR ................... 0x0
        IC_DEFAULT_TAR_SLAVE_ADDR ......... 0x055
        IC_DEFAULT_SLAVE_ADDR ............. 0x055
        IC_DEFAULT_HS_SPKLEN .............. 0x1
        IC_FS_SCL_HIGH_COUNT .............. 0x0006
        IC_HS_SCL_LOW_COUNT ............... 0x0008
        IC_DEVICE_ID_VALUE ................ 0x0
        IC_10BITADDR_MASTER ............... 0x0
        IC_CLK_FREQ_OPTIMIZATION .......... 0x0
        IC_DEFAULT_FS_SPKLEN .............. 0x7
        IC_ADD_ENCODED_PARAMS ............. 0x0
        IC_DEFAULT_SDA_HOLD ............... 0x000001
        IC_DEFAULT_SDA_SETUP .............. 0x64
        IC_AVOID_RX_FIFO_FLUSH_ON_TX_ABRT . 0x0
        IC_CLOCK_PERIOD ................... 100
        IC_EMPTYFIFO_HOLD_MASTER_EN ....... 1
        IC_RESTART_EN ..................... 0x1
        IC_TX_CMD_BLOCK_DEFAULT ........... 0x0
        IC_BUS_CLEAR_FEATURE .............. 0x0
        IC_CAP_LOADING .................... 100
        IC_FS_SCL_LOW_COUNT ............... 0x000d
        APB_DATA_WIDTH .................... 32
        IC_SDA_STUCK_TIMEOUT_DEFAULT ...... 0xffffffff
        IC_SLV_DATA_NACK_ONLY ............. 0x1
        IC_10BITADDR_SLAVE ................ 0x0
        IC_CLK_TYPE ....................... 0x0
        IC_SMBUS_UDID_MSB ................. 0x0
        IC_SMBUS_SUSPEND_ALERT ............ 0x0
        IC_HS_SCL_HIGH_COUNT .............. 0x0006
        IC_SLV_RESTART_DET_EN ............. 0x1
        IC_SMBUS .......................... 0x0
        IC_OPTIONAL_SAR_DEFAULT ........... 0x0
        IC_PERSISTANT_SLV_ADDR_DEFAULT .... 0x0
        IC_USE_COUNTS ..................... 0x0
        IC_RX_BUFFER_DEPTH ................ 16
        IC_SCL_STUCK_TIMEOUT_DEFAULT ...... 0xffffffff
        IC_RX_FULL_HLD_BUS_EN ............. 0x1
        IC_SLAVE_DISABLE .................. 0x1
        IC_RX_TL .......................... 0x0
        IC_DEVICE_ID ...................... 0x0
        IC_HC_COUNT_VALUES ................ 0x0
        I2C_DYNAMIC_TAR_UPDATE ............ 0
        IC_SMBUS_CLK_LOW_MEXT_DEFAULT ..... 0xffffffff
        IC_SMBUS_CLK_LOW_SEXT_DEFAULT ..... 0xffffffff
        IC_HS_MASTER_CODE ................. 0x1
        IC_SMBUS_RST_IDLE_CNT_DEFAULT ..... 0xffff
        IC_SMBUS_UDID_LSB_DEFAULT ......... 0xffffffff
        IC_SS_SCL_HIGH_COUNT .............. 0x0028
        IC_SS_SCL_LOW_COUNT ............... 0x002f
        IC_MAX_SPEED_MODE ................. 0x2
        IC_STAT_FOR_CLK_STRETCH ........... 0x0
        IC_STOP_DET_IF_MASTER_ACTIVE ...... 0x0
        IC_DEFAULT_UFM_SPKLEN ............. 0x1
        IC_TX_BUFFER_DEPTH ................ 16 (I2C0)
  */

typedef struct {                                /*!< I2C0 Structure                                                            */

  union {
    __IOM uint32_t IC_CON;                      /*!< I2C Control Register. This register can be written only when
                                                     the DW_apb_i2c is disabled, which corresponds to the IC_ENABLE[0]
                                                     register being set to 0. Writes at other times have no
                                                     effect.

                                                     Read/Write Access: - bit 10 is read only. - bit 11 is read
                                                     only - bit 16 is read only - bit 17 is read only - bits
                                                     18 and 19 are read only.                                                  */

    struct {
      __IOM uint32_t MASTER_MODE : 1;           /*!< This bit controls whether the DW_apb_i2c master is enabled.

