mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
                                                     Note: If the software or application is aware that the
                                                     DW_apb_i2c is not using the TAR address for the pending
                                                     commands in the Tx FIFO, then it is possible to update
                                                     the TAR address even while the Tx FIFO has entries (IC_STATUS[2]=
                                                     0). - It is not necessary to perform any write to this
                                                     register if DW_apb_i2c is enabled as an I2C slave only.                   */

    struct {
      __IOM uint32_t IC_TAR     : 10;           /*!< This is the target address for any master transaction. When
                                                     transmitting a General Call, these bits are ignored. To
                                                     generate a START BYTE, the CPU needs to write only once
                                                     into these bits.

                                                     If the IC_TAR and IC_SAR are the same, loopback exists
                                                     but the FIFOs are shared between master and slave, so full
                                                     loopback is not feasible. Only one direction loopback mode
                                                     is supported (simplex), not duplex. A master cannot transmit
                                                     to itself; it can transmit to only a slave.                               */
      __IOM uint32_t GC_OR_START : 1;           /*!< If bit 11 (SPECIAL) is set to 1 and bit 13(Device-ID) is set
                                                     to 0, then this bit indicates whether a General Call or
                                                     START byte command is to be performed by the DW_apb_i2c.
                                                     - 0: General Call Address - after issuing a General Call,
                                                     only writes may be performed. Attempting to issue a read
                                                     command results in setting bit 6 (TX_ABRT) of the IC_RAW_INTR_STAT
                                                     register. The DW_apb_i2c remains in General Call mode until
                                                     the SPECIAL bit value (bit 11) is cleared. - 1: START BYTE
                                                     Reset value: 0x0                                                          */
      __IOM uint32_t SPECIAL    : 1;            /*!< This bit indicates whether software performs a Device-ID or
                                                     General Call or START BYTE command. - 0: ignore bit 10
                                                     GC_OR_START and use IC_TAR normally - 1: perform special
                                                     I2C command as specified in Device_ID or GC_OR_START bit
                                                     Reset value: 0x0                                                          */
            uint32_t            : 20;
    } IC_TAR_b;
  } ;

  union {
    __IOM uint32_t IC_SAR;                      /*!< I2C Slave Address Register                                                */

    struct {
      __IOM uint32_t IC_SAR     : 10;           /*!< The IC_SAR holds the slave address when the I2C is operating
                                                     as a slave. For 7-bit addressing, only IC_SAR[6:0] is used.

                                                     This register can be written only when the I2C interface
                                                     is disabled, which corresponds to the IC_ENABLE[0] register
                                                     being set to 0. Writes at other times have no effect.

                                                     Note: The default values cannot be any of the reserved
                                                     address locations: that is, 0x00 to 0x07, or 0x78 to 0x7f.
                                                     The correct operation of the device is not guaranteed if
                                                     you program the IC_SAR or IC_TAR to a reserved value. Refer
                                                     to <<table_I2C_firstbyte_bit_defs>> for a complete list
                                                     of these reserved values.                                                 */
            uint32_t            : 22;
    } IC_SAR_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t IC_DATA_CMD;                 /*!< I2C Rx/Tx Data Buffer and Command Register; this is the register
                                                     the CPU writes to when filling the TX FIFO and the CPU
                                                     reads from when retrieving bytes from RX FIFO.

                                                     The size of the register changes as follows:

                                                     Write: - 11 bits when IC_EMPTYFIFO_HOLD_MASTER_EN=1 - 9
                                                     bits when IC_EMPTYFIFO_HOLD_MASTER_EN=0 Read: - 12 bits
                                                     when IC_FIRST_DATA_BYTE_STATUS = 1 - 8 bits when IC_FIRST_DATA_BYTE_STATU
                                                     = 0 Note: In order for the DW_apb_i2c to continue acknowledging
                                                     reads, a read command should be written for every byte
                                                     that is to be received; otherwise the DW_apb_i2c will stop
                                                     acknowledging.                                                            */

