mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t IC_SS_SCL_HCNT : 16;       /*!< This register must be set before any I2C bus transaction can
                                                     take place to ensure proper I/O timing. This register sets
                                                     the SCL clock high-period count for standard speed. For
                                                     more information, refer to 'IC_CLK Frequency Configuration'.

                                                     This register can be written only when the I2C interface
                                                     is disabled which corresponds to the IC_ENABLE[0] register
                                                     being set to 0. Writes at other times have no effect.

                                                     The minimum valid value is 6; hardware prevents values
                                                     less than this being written, and if attempted results
                                                     in 6 being set. For designs with APB_DATA_WIDTH = 8, the
                                                     order of programming is important to ensure the correct
                                                     operation of the DW_apb_i2c. The lower byte must be programmed
                                                     first. Then the upper byte is programmed.

                                                     NOTE: This register must not be programmed to a value higher
                                                     than 65525, because DW_apb_i2c uses a 16-bit counter to
                                                     flag an I2C bus idle condition when this counter reaches
                                                     a value of IC_SS_SCL_HCNT + 10.                                           */
            uint32_t            : 16;
    } IC_SS_SCL_HCNT_b;
  } ;

  union {
    __IOM uint32_t IC_SS_SCL_LCNT;              /*!< Standard Speed I2C Clock SCL Low Count Register                           */

    struct {
      __IOM uint32_t IC_SS_SCL_LCNT : 16;       /*!< This register must be set before any I2C bus transaction can
                                                     take place to ensure proper I/O timing. This register sets
                                                     the SCL clock low period count for standard speed. For
                                                     more information, refer to 'IC_CLK Frequency Configuration'

                                                     This register can be written only when the I2C interface
                                                     is disabled which corresponds to the IC_ENABLE[0] register
                                                     being set to 0. Writes at other times have no effect.

                                                     The minimum valid value is 8; hardware prevents values
                                                     less than this being written, and if attempted, results
                                                     in 8 being set. For designs with APB_DATA_WIDTH = 8, the
                                                     order of programming is important to ensure the correct
                                                     operation of DW_apb_i2c. The lower byte must be programmed
                                                     first, and then the upper byte is programmed.                             */
            uint32_t            : 16;
    } IC_SS_SCL_LCNT_b;
  } ;

  union {
    __IOM uint32_t IC_FS_SCL_HCNT;              /*!< Fast Mode or Fast Mode Plus I2C Clock SCL High Count Register             */

    struct {
      __IOM uint32_t IC_FS_SCL_HCNT : 16;       /*!< This register must be set before any I2C bus transaction can
                                                     take place to ensure proper I/O timing. This register sets
                                                     the SCL clock high-period count for fast mode or fast mode
                                                     plus. It is used in high-speed mode to send the Master
                                                     Code and START BYTE or General CALL. For more information,
                                                     refer to 'IC_CLK Frequency Configuration'.

                                                     This register goes away and becomes read-only returning
                                                     0s if IC_MAX_SPEED_MODE = standard. This register can be
                                                     written only when the I2C interface is disabled, which
                                                     corresponds to the IC_ENABLE[0] register being set to 0.
                                                     Writes at other times have no effect.

                                                     The minimum valid value is 6; hardware prevents values
                                                     less than this being written, and if attempted results
                                                     in 6 being set. For designs with APB_DATA_WIDTH == 8 the
                                                     order of programming is important to ensure the correct
                                                     operation of the DW_apb_i2c. The lower byte must be programmed
                                                     first. Then the upper byte is programmed.                                 */
            uint32_t            : 16;
    } IC_FS_SCL_HCNT_b;
  } ;

  union {
    __IOM uint32_t IC_FS_SCL_LCNT;              /*!< Fast Mode or Fast Mode Plus I2C Clock SCL Low Count Register              */

    struct {
      __IOM uint32_t IC_FS_SCL_LCNT : 16;       /*!< This register must be set before any I2C bus transaction can
                                                     take place to ensure proper I/O timing. This register sets
                                                     the SCL clock low period count for fast speed. It is used
                                                     in high-speed mode to send the Master Code and START BYTE
                                                     or General CALL. For more information, refer to 'IC_CLK
                                                     Frequency Configuration'.

                                                     This register goes away and becomes read-only returning
                                                     0s if IC_MAX_SPEED_MODE = standard.

                                                     This register can be written only when the I2C interface
                                                     is disabled, which corresponds to the IC_ENABLE[0] register
                                                     being set to 0. Writes at other times have no effect.

                                                     The minimum valid value is 8; hardware prevents values
                                                     less than this being written, and if attempted results
                                                     in 8 being set. For designs with APB_DATA_WIDTH = 8 the
                                                     order of programming is important to ensure the correct
                                                     operation of the DW_apb_i2c. The lower byte must be programmed
                                                     first. Then the upper byte is programmed. If the value
                                                     is less than 8 then the count value gets changed to 8.                    */
            uint32_t            : 16;
    } IC_FS_SCL_LCNT_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t IC_INTR_STAT;                /*!< I2C Interrupt Status Register

                                                     Each bit in this register has a corresponding mask bit
                                                     in the IC_INTR_MASK register. These bits are cleared by
                                                     reading the matching interrupt clear register. The unmasked
                                                     raw versions of these bits are available in the IC_RAW_INTR_STAT
                                                     register.                                                                 */

