mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t R_RX_UNDER : 1;            /*!< See IC_RAW_INTR_STAT for a detailed description of R_RX_UNDER
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_RX_OVER  : 1;            /*!< See IC_RAW_INTR_STAT for a detailed description of R_RX_OVER
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_RX_FULL  : 1;            /*!< See IC_RAW_INTR_STAT for a detailed description of R_RX_FULL
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_TX_OVER  : 1;            /*!< See IC_RAW_INTR_STAT for a detailed description of R_TX_OVER
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_TX_EMPTY : 1;            /*!< See IC_RAW_INTR_STAT for a detailed description of R_TX_EMPTY
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_RD_REQ   : 1;            /*!< See IC_RAW_INTR_STAT for a detailed description of R_RD_REQ
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_TX_ABRT  : 1;            /*!< See IC_RAW_INTR_STAT for a detailed description of R_TX_ABRT
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_RX_DONE  : 1;            /*!< See IC_RAW_INTR_STAT for a detailed description of R_RX_DONE
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_ACTIVITY : 1;            /*!< See IC_RAW_INTR_STAT for a detailed description of R_ACTIVITY
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_STOP_DET : 1;            /*!< See IC_RAW_INTR_STAT for a detailed description of R_STOP_DET
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_START_DET : 1;           /*!< See IC_RAW_INTR_STAT for a detailed description of R_START_DET
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_GEN_CALL : 1;            /*!< See IC_RAW_INTR_STAT for a detailed description of R_GEN_CALL
                                                     bit.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t R_RESTART_DET : 1;         /*!< See IC_RAW_INTR_STAT for a detailed description of R_RESTART_DET
                                                     bit.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 19;
    } IC_INTR_STAT_b;
  } ;

  union {
    __IOM uint32_t IC_INTR_MASK;                /*!< I2C Interrupt Mask Register.

                                                     These bits mask their corresponding interrupt status bits.
                                                     This register is active low; a value of 0 masks the interrupt,
                                                     whereas a value of 1 unmasks the interrupt.                               */

    struct {
      __IOM uint32_t M_RX_UNDER : 1;            /*!< This bit masks the R_RX_UNDER interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x1                                                          */
      __IOM uint32_t M_RX_OVER  : 1;            /*!< This bit masks the R_RX_OVER interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x1                                                          */
      __IOM uint32_t M_RX_FULL  : 1;            /*!< This bit masks the R_RX_FULL interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x1                                                          */
      __IOM uint32_t M_TX_OVER  : 1;            /*!< This bit masks the R_TX_OVER interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x1                                                          */
      __IOM uint32_t M_TX_EMPTY : 1;            /*!< This bit masks the R_TX_EMPTY interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x1                                                          */
      __IOM uint32_t M_RD_REQ   : 1;            /*!< This bit masks the R_RD_REQ interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x1                                                          */
      __IOM uint32_t M_TX_ABRT  : 1;            /*!< This bit masks the R_TX_ABRT interrupt in IC_INTR_STAT register.

