mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
                                                     Reset value: 0x1                                                          */
      __IOM uint32_t M_RX_DONE  : 1;            /*!< This bit masks the R_RX_DONE interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x1                                                          */
      __IOM uint32_t M_ACTIVITY : 1;            /*!< This bit masks the R_ACTIVITY interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
      __IOM uint32_t M_STOP_DET : 1;            /*!< This bit masks the R_STOP_DET interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
      __IOM uint32_t M_START_DET : 1;           /*!< This bit masks the R_START_DET interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
      __IOM uint32_t M_GEN_CALL : 1;            /*!< This bit masks the R_GEN_CALL interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x1                                                          */
      __IOM uint32_t M_RESTART_DET : 1;         /*!< This bit masks the R_RESTART_DET interrupt in IC_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 19;
    } IC_INTR_MASK_b;
  } ;

  union {
    __IOM uint32_t IC_RAW_INTR_STAT;            /*!< I2C Raw Interrupt Status Register

                                                     Unlike the IC_INTR_STAT register, these bits are not masked
                                                     so they always show the true status of the DW_apb_i2c.                    */

    struct {
      __IM  uint32_t RX_UNDER   : 1;            /*!< Set if the processor attempts to read the receive buffer when
                                                     it is empty by reading from the IC_DATA_CMD register. If
                                                     the module is disabled (IC_ENABLE[0]=0), this bit keeps
                                                     its level until the master or slave state machines go into
                                                     idle, and when ic_en goes to 0, this interrupt is cleared.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t RX_OVER    : 1;            /*!< Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH
                                                     and an additional byte is received from an external I2C
                                                     device. The DW_apb_i2c acknowledges this, but any data
                                                     bytes received after the FIFO is full are lost. If the
                                                     module is disabled (IC_ENABLE[0]=0), this bit keeps its
                                                     level until the master or slave state machines go into
                                                     idle, and when ic_en goes to 0, this interrupt is cleared.

                                                     Note: If bit 9 of the IC_CON register (RX_FIFO_FULL_HLD_CTRL)
                                                     is programmed to HIGH, then the RX_OVER interrupt never
                                                     occurs, because the Rx FIFO never overflows.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t RX_FULL    : 1;            /*!< Set when the receive buffer reaches or goes above the RX_TL
                                                     threshold in the IC_RX_TL register. It is automatically
                                                     cleared by hardware when buffer level goes below the threshold.
                                                     If the module is disabled (IC_ENABLE[0]=0), the RX FIFO
                                                     is flushed and held in reset; therefore the RX FIFO is
                                                     not full. So this bit is cleared once the IC_ENABLE bit
                                                     0 is programmed with a 0, regardless of the activity that
                                                     continues.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t TX_OVER    : 1;            /*!< Set during transmit if the transmit buffer is filled to IC_TX_BUFFER_DEPTH
                                                     and the processor attempts to issue another I2C command
                                                     by writing to the IC_DATA_CMD register. When the module
                                                     is disabled, this bit keeps its level until the master
                                                     or slave state machines go into idle, and when ic_en goes
                                                     to 0, this interrupt is cleared.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t TX_EMPTY   : 1;            /*!< The behavior of the TX_EMPTY interrupt status differs based
                                                     on the TX_EMPTY_CTRL selection in the IC_CON register.
                                                     - When TX_EMPTY_CTRL = 0: This bit is set to 1 when the
                                                     transmit buffer is at or below the threshold value set
                                                     in the IC_TX_TL register. - When TX_EMPTY_CTRL = 1: This
                                                     bit is set to 1 when the transmit buffer is at or below
                                                     the threshold value set in the IC_TX_TL register and the
                                                     transmission of the address/data from the internal shift
                                                     register for the most recently popped command is completed.
                                                     It is automatically cleared by hardware when the buffer
                                                     level goes above the threshold. When IC_ENABLE[0] is set
                                                     to 0, the TX FIFO is flushed and held in reset. There the
                                                     TX FIFO looks like it has no data within it, so this bit
                                                     is set to 1, provided there is activity in the master or
                                                     slave state machines. When there is no longer any activity,
                                                     then with ic_en=0, this bit is set to 0.

                                                     Reset value: 0x0.                                                         */
      __IM  uint32_t RD_REQ     : 1;            /*!< This bit is set to 1 when DW_apb_i2c is acting as a slave and
                                                     another I2C master is attempting to read data from DW_apb_i2c.
                                                     The DW_apb_i2c holds the I2C bus in a wait state (SCL=0)
                                                     until this interrupt is serviced, which means that the
                                                     slave has been addressed by a remote master that is asking
                                                     for data to be transferred. The processor must respond
                                                     to this interrupt and then write the requested data to
                                                     the IC_DATA_CMD register. This bit is set to 0 just after
                                                     the processor reads the IC_CLR_RD_REQ register.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t TX_ABRT    : 1;            /*!< This bit indicates if DW_apb_i2c, as an I2C transmitter, is
                                                     unable to complete the intended actions on the contents
                                                     of the transmit FIFO. This situation can occur both as
                                                     an I2C master or an I2C slave, and is referred to as a
                                                     'transmit abort'. When this bit is set to 1, the IC_TX_ABRT_SOURCE
                                                     register indicates the reason why the transmit abort takes
                                                     places.

