mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
                                                     Note: The DW_apb_i2c flushes/resets/empties the TX_FIFO
                                                     and RX_FIFO whenever there is a transmit abort caused by
                                                     any of the events tracked by the IC_TX_ABRT_SOURCE register.
                                                     The FIFOs remains in this flushed state until the register
                                                     IC_CLR_TX_ABRT is read. Once this read is performed, the
                                                     Tx FIFO is then ready to accept more data bytes from the
                                                     APB interface.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t RX_DONE    : 1;            /*!< When the DW_apb_i2c is acting as a slave-transmitter, this bit
                                                     is set to 1 if the master does not acknowledge a transmitted
                                                     byte. This occurs on the last byte of the transmission,
                                                     indicating that the transmission is done.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t ACTIVITY   : 1;            /*!< This bit captures DW_apb_i2c activity and stays set until it
                                                     is cleared. There are four ways to clear it: - Disabling
                                                     the DW_apb_i2c - Reading the IC_CLR_ACTIVITY register -
                                                     Reading the IC_CLR_INTR register - System reset Once this
                                                     bit is set, it stays set unless one of the four methods
                                                     is used to clear it. Even if the DW_apb_i2c module is idle,
                                                     this bit remains set until cleared, indicating that there
                                                     was activity on the bus.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t STOP_DET   : 1;            /*!< Indicates whether a STOP condition has occurred on the I2C interface
                                                     regardless of whether DW_apb_i2c is operating in slave
                                                     or master mode.

                                                     In Slave Mode: - If IC_CON[7]=1'b1 (STOP_DET_IFADDRESSED),
                                                     the STOP_DET interrupt will be issued only if slave is
                                                     addressed. Note: During a general call address, this slave
                                                     does not issue a STOP_DET interrupt if STOP_DET_IF_ADDRESSED=1'b1,
                                                     even if the slave responds to the general call address
                                                     by generating ACK. The STOP_DET interrupt is generated
                                                     only when the transmitted address matches the slave address
                                                     (SAR). - If IC_CON[7]=1'b0 (STOP_DET_IFADDRESSED), the
                                                     STOP_DET interrupt is issued irrespective of whether it
                                                     is being addressed. In Master Mode: - If IC_CON[10]=1'b1
                                                     (STOP_DET_IF_MASTER_ACTIVE),the STOP_DET interrupt will
                                                     be issued only if Master is active. - If IC_CON[10]=1'b0
                                                     (STOP_DET_IFADDRESSED),the STOP_DET interrupt will be issued
                                                     irrespective of whether master is active or not. Reset
                                                     value: 0x0                                                                */
      __IM  uint32_t START_DET  : 1;            /*!< Indicates whether a START or RESTART condition has occurred
                                                     on the I2C interface regardless of whether DW_apb_i2c is
                                                     operating in slave or master mode.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t GEN_CALL   : 1;            /*!< Set only when a General Call address is received and it is acknowledged.
                                                     It stays set until it is cleared either by disabling DW_apb_i2c
                                                     or when the CPU reads bit 0 of the IC_CLR_GEN_CALL register.
                                                     DW_apb_i2c stores the received data in the Rx buffer.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t RESTART_DET : 1;           /*!< Indicates whether a RESTART condition has occurred on the I2C
                                                     interface when DW_apb_i2c is operating in Slave mode and
                                                     the slave is being addressed. Enabled only when IC_SLV_RESTART_DET_EN=1.

                                                     Note: However, in high-speed mode or during a START BYTE
                                                     transfer, the RESTART comes before the address field as
                                                     per the I2C protocol. In this case, the slave is not the
                                                     addressed slave when the RESTART is issued, therefore DW_apb_i2c
                                                     does not generate the RESTART_DET interrupt.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 19;
    } IC_RAW_INTR_STAT_b;
  } ;

  union {
    __IOM uint32_t IC_RX_TL;                    /*!< I2C Receive FIFO Threshold Register                                       */

