mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t RX_TL      : 8;            /*!< Receive FIFO Threshold Level.

                                                     Controls the level of entries (or above) that triggers
                                                     the RX_FULL interrupt (bit 2 in IC_RAW_INTR_STAT register).
                                                     The valid range is 0-255, with the additional restriction
                                                     that hardware does not allow this value to be set to a
                                                     value larger than the depth of the buffer. If an attempt
                                                     is made to do that, the actual value set will be the maximum
                                                     depth of the buffer. A value of 0 sets the threshold for
                                                     1 entry, and a value of 255 sets the threshold for 256
                                                     entries.                                                                  */
            uint32_t            : 24;
    } IC_RX_TL_b;
  } ;

  union {
    __IOM uint32_t IC_TX_TL;                    /*!< I2C Transmit FIFO Threshold Register                                      */

    struct {
      __IOM uint32_t TX_TL      : 8;            /*!< Transmit FIFO Threshold Level.

                                                     Controls the level of entries (or below) that trigger the
                                                     TX_EMPTY interrupt (bit 4 in IC_RAW_INTR_STAT register).
                                                     The valid range is 0-255, with the additional restriction
                                                     that it may not be set to value larger than the depth of
                                                     the buffer. If an attempt is made to do that, the actual
                                                     value set will be the maximum depth of the buffer. A value
                                                     of 0 sets the threshold for 0 entries, and a value of 255
                                                     sets the threshold for 255 entries.                                       */
            uint32_t            : 24;
    } IC_TX_TL_b;
  } ;

  union {
    __IOM uint32_t IC_CLR_INTR;                 /*!< Clear Combined and Individual Interrupt Register                          */

    struct {
      __IM  uint32_t CLR_INTR   : 1;            /*!< Read this register to clear the combined interrupt, all individual
                                                     interrupts, and the IC_TX_ABRT_SOURCE register. This bit
                                                     does not clear hardware clearable interrupts but software
                                                     clearable interrupts. Refer to Bit 9 of the IC_TX_ABRT_SOURCE
                                                     register for an exception to clearing IC_TX_ABRT_SOURCE.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_INTR_b;
  } ;

  union {
    __IOM uint32_t IC_CLR_RX_UNDER;             /*!< Clear RX_UNDER Interrupt Register                                         */

    struct {
      __IM  uint32_t CLR_RX_UNDER : 1;          /*!< Read this register to clear the RX_UNDER interrupt (bit 0) of
                                                     the IC_RAW_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_RX_UNDER_b;
  } ;

  union {
    __IOM uint32_t IC_CLR_RX_OVER;              /*!< Clear RX_OVER Interrupt Register                                          */

    struct {
      __IM  uint32_t CLR_RX_OVER : 1;           /*!< Read this register to clear the RX_OVER interrupt (bit 1) of
                                                     the IC_RAW_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_RX_OVER_b;
  } ;

  union {
    __IOM uint32_t IC_CLR_TX_OVER;              /*!< Clear TX_OVER Interrupt Register                                          */

    struct {
      __IM  uint32_t CLR_TX_OVER : 1;           /*!< Read this register to clear the TX_OVER interrupt (bit 3) of
                                                     the IC_RAW_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_TX_OVER_b;
  } ;

  union {
    __IOM uint32_t IC_CLR_RD_REQ;               /*!< Clear RD_REQ Interrupt Register                                           */

    struct {
      __IM  uint32_t CLR_RD_REQ : 1;            /*!< Read this register to clear the RD_REQ interrupt (bit 5) of
                                                     the IC_RAW_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_RD_REQ_b;
  } ;

  union {
    __IOM uint32_t IC_CLR_TX_ABRT;              /*!< Clear TX_ABRT Interrupt Register                                          */

    struct {
      __IM  uint32_t CLR_TX_ABRT : 1;           /*!< Read this register to clear the TX_ABRT interrupt (bit 6) of
                                                     the IC_RAW_INTR_STAT register, and the IC_TX_ABRT_SOURCE
                                                     register. This also releases the TX FIFO from the flushed/reset
                                                     state, allowing more writes to the TX FIFO. Refer to Bit
                                                     9 of the IC_TX_ABRT_SOURCE register for an exception to
                                                     clearing IC_TX_ABRT_SOURCE.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_TX_ABRT_b;
  } ;

  union {
    __IOM uint32_t IC_CLR_RX_DONE;              /*!< Clear RX_DONE Interrupt Register                                          */

