mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t CLR_RX_DONE : 1;           /*!< Read this register to clear the RX_DONE interrupt (bit 7) of
                                                     the IC_RAW_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_RX_DONE_b;
  } ;

  union {
    __IOM uint32_t IC_CLR_ACTIVITY;             /*!< Clear ACTIVITY Interrupt Register                                         */

    struct {
      __IM  uint32_t CLR_ACTIVITY : 1;          /*!< Reading this register clears the ACTIVITY interrupt if the I2C
                                                     is not active anymore. If the I2C module is still active
                                                     on the bus, the ACTIVITY interrupt bit continues to be
                                                     set. It is automatically cleared by hardware if the module
                                                     is disabled and if there is no further activity on the
                                                     bus. The value read from this register to get status of
                                                     the ACTIVITY interrupt (bit 8) of the IC_RAW_INTR_STAT
                                                     register.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_ACTIVITY_b;
  } ;

  union {
    __IOM uint32_t IC_CLR_STOP_DET;             /*!< Clear STOP_DET Interrupt Register                                         */

    struct {
      __IM  uint32_t CLR_STOP_DET : 1;          /*!< Read this register to clear the STOP_DET interrupt (bit 9) of
                                                     the IC_RAW_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_STOP_DET_b;
  } ;

  union {
    __IOM uint32_t IC_CLR_START_DET;            /*!< Clear START_DET Interrupt Register                                        */

    struct {
      __IM  uint32_t CLR_START_DET : 1;         /*!< Read this register to clear the START_DET interrupt (bit 10)
                                                     of the IC_RAW_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_START_DET_b;
  } ;

  union {
    __IOM uint32_t IC_CLR_GEN_CALL;             /*!< Clear GEN_CALL Interrupt Register                                         */

    struct {
      __IM  uint32_t CLR_GEN_CALL : 1;          /*!< Read this register to clear the GEN_CALL interrupt (bit 11)
                                                     of IC_RAW_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_GEN_CALL_b;
  } ;

  union {
    __IOM uint32_t IC_ENABLE;                   /*!< I2C Enable Register                                                       */

    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< Controls whether the DW_apb_i2c is enabled. - 0: Disables DW_apb_i2c
                                                     (TX and RX FIFOs are held in an erased state) - 1: Enables
                                                     DW_apb_i2c Software can disable DW_apb_i2c while it is
                                                     active. However, it is important that care be taken to
                                                     ensure that DW_apb_i2c is disabled properly. A recommended
                                                     procedure is described in 'Disabling DW_apb_i2c'.

                                                     When DW_apb_i2c is disabled, the following occurs: - The
                                                     TX FIFO and RX FIFO get flushed. - Status bits in the IC_INTR_STAT
                                                     register are still active until DW_apb_i2c goes into IDLE
                                                     state. If the module is transmitting, it stops as well
                                                     as deletes the contents of the transmit buffer after the
                                                     current transfer is complete. If the module is receiving,
                                                     the DW_apb_i2c stops the current transfer at the end of
                                                     the current byte and does not acknowledge the transfer.

                                                     In systems with asynchronous pclk and ic_clk when IC_CLK_TYPE
                                                     parameter set to asynchronous (1), there is a two ic_clk
                                                     delay when enabling or disabling the DW_apb_i2c. For a
                                                     detailed description on how to disable DW_apb_i2c, refer
                                                     to 'Disabling DW_apb_i2c'

                                                     Reset value: 0x0                                                          */
      __IOM uint32_t ABORT      : 1;            /*!< When set, the controller initiates the transfer abort. - 0:
                                                     ABORT not initiated or ABORT done - 1: ABORT operation
                                                     in progress The software can abort the I2C transfer in
                                                     master mode by setting this bit. The software can set this
                                                     bit only when ENABLE is already set; otherwise, the controller
                                                     ignores any write to ABORT bit. The software cannot clear
                                                     the ABORT bit once set. In response to an ABORT, the controller
                                                     issues a STOP and flushes the Tx FIFO after completing
                                                     the current transfer, then sets the TX_ABORT interrupt
                                                     after the abort operation. The ABORT bit is cleared automatically
                                                     after the abort operation.

                                                     For a detailed description on how to abort I2C transfers,
                                                     refer to 'Aborting I2C Transfers'.

                                                     Reset value: 0x0                                                          */
      __IOM uint32_t TX_CMD_BLOCK : 1;          /*!< In Master mode: - 1'b1: Blocks the transmission of data on I2C
                                                     bus even if Tx FIFO has data to transmit. - 1'b0: The transmission
                                                     of data starts on I2C bus automatically, as soon as the
                                                     first data is available in the Tx FIFO. Note: To block
                                                     the execution of Master commands, set the TX_CMD_BLOCK
                                                     bit only when Tx FIFO is empty (IC_STATUS[2]==1) and Master
                                                     is in Idle state (IC_STATUS[5] == 0). Any further commands
                                                     put in the Tx FIFO are not executed until TX_CMD_BLOCK
                                                     bit is unset. Reset value: IC_TX_CMD_BLOCK_DEFAULT                        */
            uint32_t            : 29;
    } IC_ENABLE_b;
  } ;

  union {
    __IOM uint32_t IC_STATUS;                   /*!< I2C Status Register

                                                     This is a read-only register used to indicate the current
                                                     transfer status and FIFO status. The status register may
                                                     be read at any time. None of the bits in this register
                                                     request an interrupt.

                                                     When the I2C is disabled by writing 0 in bit 0 of the IC_ENABLE
                                                     register: - Bits 1 and 2 are set to 1 - Bits 3 and 10 are
                                                     set to 0 When the master or slave state machines goes to
                                                     idle and ic_en=0: - Bits 5 and 6 are set to 0                             */

