mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t ACTIVITY   : 1;            /*!< I2C Activity Status. Reset value: 0x0                                     */
      __IM  uint32_t TFNF       : 1;            /*!< Transmit FIFO Not Full. Set when the transmit FIFO contains
                                                     one or more empty locations, and is cleared when the FIFO
                                                     is full. - 0: Transmit FIFO is full - 1: Transmit FIFO
                                                     is not full Reset value: 0x1                                              */
      __IM  uint32_t TFE        : 1;            /*!< Transmit FIFO Completely Empty. When the transmit FIFO is completely
                                                     empty, this bit is set. When it contains one or more valid
                                                     entries, this bit is cleared. This bit field does not request
                                                     an interrupt. - 0: Transmit FIFO is not empty - 1: Transmit
                                                     FIFO is empty Reset value: 0x1                                            */
      __IM  uint32_t RFNE       : 1;            /*!< Receive FIFO Not Empty. This bit is set when the receive FIFO
                                                     contains one or more entries; it is cleared when the receive
                                                     FIFO is empty. - 0: Receive FIFO is empty - 1: Receive
                                                     FIFO is not empty Reset value: 0x0                                        */
      __IM  uint32_t RFF        : 1;            /*!< Receive FIFO Completely Full. When the receive FIFO is completely
                                                     full, this bit is set. When the receive FIFO contains one
                                                     or more empty location, this bit is cleared. - 0: Receive
                                                     FIFO is not full - 1: Receive FIFO is full Reset value:
                                                     0x0                                                                       */
      __IM  uint32_t MST_ACTIVITY : 1;          /*!< Master FSM Activity Status. When the Master Finite State Machine
                                                     (FSM) is not in the IDLE state, this bit is set. - 0: Master
                                                     FSM is in IDLE state so the Master part of DW_apb_i2c is
                                                     not Active - 1: Master FSM is not in IDLE state so the
                                                     Master part of DW_apb_i2c is Active Note: IC_STATUS[0]-that
                                                     is, ACTIVITY bit-is the OR of SLV_ACTIVITY and MST_ACTIVITY
                                                     bits.

                                                     Reset value: 0x0                                                          */
      __IM  uint32_t SLV_ACTIVITY : 1;          /*!< Slave FSM Activity Status. When the Slave Finite State Machine
                                                     (FSM) is not in the IDLE state, this bit is set. - 0: Slave
                                                     FSM is in IDLE state so the Slave part of DW_apb_i2c is
                                                     not Active - 1: Slave FSM is not in IDLE state so the Slave
                                                     part of DW_apb_i2c is Active Reset value: 0x0                             */
            uint32_t            : 25;
    } IC_STATUS_b;
  } ;

  union {
    __IOM uint32_t IC_TXFLR;                    /*!< I2C Transmit FIFO Level Register This register contains the
                                                     number of valid data entries in the transmit FIFO buffer.
                                                     It is cleared whenever: - The I2C is disabled - There is
                                                     a transmit abort - that is, TX_ABRT bit is set in the IC_RAW_INTR_STAT
                                                     register - The slave bulk transmit mode is aborted The
                                                     register increments whenever data is placed into the transmit
                                                     FIFO and decrements when data is taken from the transmit
                                                     FIFO.                                                                     */

    struct {
      __IM  uint32_t TXFLR      : 5;            /*!< Transmit FIFO Level. Contains the number of valid data entries
                                                     in the transmit FIFO.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 27;
    } IC_TXFLR_b;
  } ;

  union {
    __IOM uint32_t IC_RXFLR;                    /*!< I2C Receive FIFO Level Register This register contains the number
                                                     of valid data entries in the receive FIFO buffer. It is
                                                     cleared whenever: - The I2C is disabled - Whenever there
                                                     is a transmit abort caused by any of the events tracked
                                                     in IC_TX_ABRT_SOURCE The register increments whenever data
                                                     is placed into the receive FIFO and decrements when data
                                                     is taken from the receive FIFO.                                           */

    struct {
      __IM  uint32_t RXFLR      : 5;            /*!< Receive FIFO Level. Contains the number of valid data entries
                                                     in the receive FIFO.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 27;
    } IC_RXFLR_b;
  } ;

  union {
    __IOM uint32_t IC_SDA_HOLD;                 /*!< I2C SDA Hold Time Length Register

