mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
                                                     The bits [15:0] of this register are used to control the
                                                     hold time of SDA during transmit in both slave and master
                                                     mode (after SCL goes from HIGH to LOW).

                                                     The bits [23:16] of this register are used to extend the
                                                     SDA transition (if any) whenever SCL is HIGH in the receiver
                                                     in either master or slave mode.

                                                     Writes to this register succeed only when IC_ENABLE[0]=0.

                                                     The values in this register are in units of ic_clk period.
                                                     The value programmed in IC_SDA_TX_HOLD must be greater
                                                     than the minimum hold time in each mode (one cycle in master
                                                     mode, seven cycles in slave mode) for the value to be implemented.

                                                     The programmed SDA hold time during transmit (IC_SDA_TX_HOLD)
                                                     cannot exceed at any time the duration of the low part
                                                     of scl. Therefore the programmed value cannot be larger
                                                     than N_SCL_LOW-2, where N_SCL_LOW is the duration of the
                                                     low part of the scl period measured in ic_clk cycles.                     */

    struct {
      __IOM uint32_t IC_SDA_TX_HOLD : 16;       /*!< Sets the required SDA hold time in units of ic_clk period, when
                                                     DW_apb_i2c acts as a transmitter.

                                                     Reset value: IC_DEFAULT_SDA_HOLD[15:0].                                   */
      __IOM uint32_t IC_SDA_RX_HOLD : 8;        /*!< Sets the required SDA hold time in units of ic_clk period, when
                                                     DW_apb_i2c acts as a receiver.

                                                     Reset value: IC_DEFAULT_SDA_HOLD[23:16].                                  */
            uint32_t            : 8;
    } IC_SDA_HOLD_b;
  } ;

  union {
    __IOM uint32_t IC_TX_ABRT_SOURCE;           /*!< I2C Transmit Abort Source Register

                                                     This register has 32 bits that indicate the source of the
                                                     TX_ABRT bit. Except for Bit 9, this register is cleared
                                                     whenever the IC_CLR_TX_ABRT register or the IC_CLR_INTR
                                                     register is read. To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT
                                                     must be fixed first; RESTART must be enabled (IC_CON[5]=1),
                                                     the SPECIAL bit must be cleared (IC_TAR[11]), or the GC_OR_START
                                                     bit must be cleared (IC_TAR[10]).

                                                     Once the source of the ABRT_SBYTE_NORSTRT is fixed, then
                                                     this bit can be cleared in the same manner as other bits
                                                     in this register. If the source of the ABRT_SBYTE_NORSTRT
                                                     is not fixed before attempting to clear this bit, Bit 9
                                                     clears for one cycle and is then re-asserted.                             */

    struct {
      __IM  uint32_t ABRT_7B_ADDR_NOACK : 1;    /*!< This field indicates that the Master is in 7-bit addressing
                                                     mode and the address sent was not acknowledged by any slave.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master-Transmitter or Master-Receiver                 */
      __IM  uint32_t ABRT_10ADDR1_NOACK : 1;    /*!< This field indicates that the Master is in 10-bit address mode
                                                     and the first 10-bit address byte was not acknowledged
                                                     by any slave.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master-Transmitter or Master-Receiver                 */
      __IM  uint32_t ABRT_10ADDR2_NOACK : 1;    /*!< This field indicates that the Master is in 10-bit address mode
                                                     and that the second address byte of the 10-bit address
                                                     was not acknowledged by any slave.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master-Transmitter or Master-Receiver                 */
      __IM  uint32_t ABRT_TXDATA_NOACK : 1;     /*!< This field indicates the master-mode only bit. When the master
                                                     receives an acknowledgement for the address, but when it
                                                     sends data byte(s) following the address, it did not receive
                                                     an acknowledge from the remote slave(s).

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master-Transmitter                                    */
      __IM  uint32_t ABRT_GCALL_NOACK : 1;      /*!< This field indicates that DW_apb_i2c in master mode has sent
                                                     a General Call and no slave on the bus acknowledged the
                                                     General Call.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master-Transmitter                                    */
      __IM  uint32_t ABRT_GCALL_READ : 1;       /*!< This field indicates that DW_apb_i2c in the master mode has
                                                     sent a General Call but the user programmed the byte following
                                                     the General Call to be a read from the bus (IC_DATA_CMD[9]
                                                     is set to 1).

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master-Transmitter                                    */
      __IM  uint32_t ABRT_HS_ACKDET : 1;        /*!< This field indicates that the Master is in High Speed mode and
                                                     the High Speed Master code was acknowledged (wrong behavior).

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master                                                */
      __IM  uint32_t ABRT_SBYTE_ACKDET : 1;     /*!< This field indicates that the Master has sent a START Byte and
                                                     the START Byte was acknowledged (wrong behavior).

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master                                                */
      __IM  uint32_t ABRT_HS_NORSTRT : 1;       /*!< This field indicates that the restart is disabled (IC_RESTART_EN
                                                     bit (IC_CON[5]) =0) and the user is trying to use the master
                                                     to transfer data in High Speed mode.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master-Transmitter or Master-Receiver                 */
      __IM  uint32_t ABRT_SBYTE_NORSTRT : 1;    /*!< To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be
                                                     fixed first; restart must be enabled (IC_CON[5]=1), the
                                                     SPECIAL bit must be cleared (IC_TAR[11]), or the GC_OR_START
                                                     bit must be cleared (IC_TAR[10]). Once the source of the
                                                     ABRT_SBYTE_NORSTRT is fixed, then this bit can be cleared
                                                     in the same manner as other bits in this register. If the
                                                     source of the ABRT_SBYTE_NORSTRT is not fixed before attempting
                                                     to clear this bit, bit 9 clears for one cycle and then
                                                     gets reasserted. When this field is set to 1, the restart
                                                     is disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the
                                                     user is trying to send a START Byte.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master                                                */
      __IM  uint32_t ABRT_10B_RD_NORSTRT : 1;   /*!< This field indicates that the restart is disabled (IC_RESTART_EN
                                                     bit (IC_CON[5]) =0) and the master sends a read command
                                                     in 10-bit addressing mode.

                                                     Reset value: 0x0

