mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
                                                     Role of DW_apb_i2c: Master-Receiver                                       */
      __IM  uint32_t ABRT_MASTER_DIS : 1;       /*!< This field indicates that the User tries to initiate a Master
                                                     operation with the Master mode disabled.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master-Transmitter or Master-Receiver                 */
      __IM  uint32_t ARB_LOST   : 1;            /*!< This field specifies that the Master has lost arbitration, or
                                                     if IC_TX_ABRT_SOURCE[14] is also set, then the slave transmitter
                                                     has lost arbitration.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master-Transmitter or Slave-Transmitter               */
      __IM  uint32_t ABRT_SLVFLUSH_TXFIFO : 1;  /*!< This field specifies that the Slave has received a read command
                                                     and some data exists in the TX FIFO, so the slave issues
                                                     a TX_ABRT interrupt to flush old data in TX FIFO.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Slave-Transmitter                                     */
      __IM  uint32_t ABRT_SLV_ARBLOST : 1;      /*!< This field indicates that a Slave has lost the bus while transmitting
                                                     data to a remote master. IC_TX_ABRT_SOURCE[12] is set at
                                                     the same time. Note: Even though the slave never 'owns'
                                                     the bus, something could go wrong on the bus. This is a
                                                     fail safe check. For instance, during a data transmission
                                                     at the low-to-high transition of SCL, if what is on the
                                                     data bus is not what is supposed to be transmitted, then
                                                     DW_apb_i2c no longer own the bus.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Slave-Transmitter                                     */
      __IM  uint32_t ABRT_SLVRD_INTX : 1;       /*!< 1: When the processor side responds to a slave mode request
                                                     for data to be transmitted to a remote master and user
                                                     writes a 1 in CMD (bit 8) of IC_DATA_CMD register.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Slave-Transmitter                                     */
      __IM  uint32_t ABRT_USER_ABRT : 1;        /*!< This is a master-mode-only bit. Master has detected the transfer
                                                     abort (IC_ENABLE[1])

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master-Transmitter                                    */
            uint32_t            : 6;
      __IM  uint32_t TX_FLUSH_CNT : 9;          /*!< This field indicates the number of Tx FIFO Data Commands which
                                                     are flushed due to TX_ABRT interrupt. It is cleared whenever
                                                     I2C is disabled.

                                                     Reset value: 0x0

                                                     Role of DW_apb_i2c: Master-Transmitter or Slave-Transmitter               */
    } IC_TX_ABRT_SOURCE_b;
  } ;

  union {
    __IOM uint32_t IC_SLV_DATA_NACK_ONLY;       /*!< Generate Slave Data NACK Register

                                                     The register is used to generate a NACK for the data part
                                                     of a transfer when DW_apb_i2c is acting as a slave-receiver.
                                                     This register only exists when the IC_SLV_DATA_NACK_ONLY
                                                     parameter is set to 1. When this parameter disabled, this
                                                     register does not exist and writing to the register's address
                                                     has no effect.

                                                     A write can occur on this register if both of the following
                                                     conditions are met: - DW_apb_i2c is disabled (IC_ENABLE[0]
                                                     = 0) - Slave part is inactive (IC_STATUS[6] = 0) Note:
                                                     The IC_STATUS[6] is a register read-back location for the
                                                     internal slv_activity signal; the user should poll this
                                                     before writing the ic_slv_data_nack_only bit.                             */

    struct {
      __IOM uint32_t NACK       : 1;            /*!< Generate NACK. This NACK generation only occurs when DW_apb_i2c
                                                     is a slave-receiver. If this register is set to a value
                                                     of 1, it can only generate a NACK after a data byte is
                                                     received; hence, the data transfer is aborted and the data
                                                     received is not pushed to the receive buffer.

                                                     When the register is set to a value of 0, it generates
                                                     NACK/ACK, depending on normal criteria. - 1: generate NACK
                                                     after data byte received - 0: generate NACK/ACK normally
                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_SLV_DATA_NACK_ONLY_b;
  } ;

  union {
    __IOM uint32_t IC_DMA_CR;                   /*!< DMA Control Register

                                                     The register is used to enable the DMA Controller interface
                                                     operation. There is a separate bit for transmit and receive.
                                                     This can be programmed regardless of the state of IC_ENABLE.              */

