mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t RDMAE      : 1;            /*!< Receive DMA Enable. This bit enables/disables the receive FIFO
                                                     DMA channel. Reset value: 0x0                                             */
      __IOM uint32_t TDMAE      : 1;            /*!< Transmit DMA Enable. This bit enables/disables the transmit
                                                     FIFO DMA channel. Reset value: 0x0                                        */
            uint32_t            : 30;
    } IC_DMA_CR_b;
  } ;

  union {
    __IOM uint32_t IC_DMA_TDLR;                 /*!< DMA Transmit Data Level Register                                          */

    struct {
      __IOM uint32_t DMATDL     : 4;            /*!< Transmit Data Level. This bit field controls the level at which
                                                     a DMA request is made by the transmit logic. It is equal
                                                     to the watermark level; that is, the dma_tx_req signal
                                                     is generated when the number of valid data entries in the
                                                     transmit FIFO is equal to or below this field value, and
                                                     TDMAE = 1.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 28;
    } IC_DMA_TDLR_b;
  } ;

  union {
    __IOM uint32_t IC_DMA_RDLR;                 /*!< I2C Receive Data Level Register                                           */

    struct {
      __IOM uint32_t DMARDL     : 4;            /*!< Receive Data Level. This bit field controls the level at which
                                                     a DMA request is made by the receive logic. The watermark
                                                     level = DMARDL+1; that is, dma_rx_req is generated when
                                                     the number of valid data entries in the receive FIFO is
                                                     equal to or more than this field value + 1, and RDMAE =1.
                                                     For instance, when DMARDL is 0, then dma_rx_req is asserted
                                                     when 1 or more data entries are present in the receive
                                                     FIFO.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 28;
    } IC_DMA_RDLR_b;
  } ;

  union {
    __IOM uint32_t IC_SDA_SETUP;                /*!< I2C SDA Setup Register

                                                     This register controls the amount of time delay (in terms
                                                     of number of ic_clk clock periods) introduced in the rising
                                                     edge of SCL - relative to SDA changing - when DW_apb_i2c
                                                     services a read request in a slave-transmitter operation.
                                                     The relevant I2C requirement is tSU:DAT (note 4) as detailed
                                                     in the I2C Bus Specification. This register must be programmed
                                                     with a value equal to or greater than 2.

                                                     Writes to this register succeed only when IC_ENABLE[0]
                                                     = 0.

                                                     Note: The length of setup time is calculated using [(IC_SDA_SETUP
                                                     - 1) * (ic_clk_period)], so if the user requires 10 ic_clk
                                                     periods of setup time, they should program a value of 11.
                                                     The IC_SDA_SETUP register is only used by the DW_apb_i2c
                                                     when operating as a slave transmitter.                                    */

    struct {
      __IOM uint32_t SDA_SETUP  : 8;            /*!< SDA Setup. It is recommended that if the required delay is 1000ns,
                                                     then for an ic_clk frequency of 10 MHz, IC_SDA_SETUP should
                                                     be programmed to a value of 11. IC_SDA_SETUP must be programmed
                                                     with a minimum value of 2.                                                */
            uint32_t            : 24;
    } IC_SDA_SETUP_b;
  } ;

  union {
    __IOM uint32_t IC_ACK_GENERAL_CALL;         /*!< I2C ACK General Call Register

                                                     The register controls whether DW_apb_i2c responds with
                                                     a ACK or NACK when it receives an I2C General Call address.

                                                     This register is applicable only when the DW_apb_i2c is
                                                     in slave mode.                                                            */

    struct {
      __IOM uint32_t ACK_GEN_CALL : 1;          /*!< ACK General Call. When set to 1, DW_apb_i2c responds with a
                                                     ACK (by asserting ic_data_oe) when it receives a General
                                                     Call. Otherwise, DW_apb_i2c responds with a NACK (by negating
                                                     ic_data_oe).                                                              */
            uint32_t            : 31;
    } IC_ACK_GENERAL_CALL_b;
  } ;

  union {
    __IOM uint32_t IC_ENABLE_STATUS;            /*!< I2C Enable Status Register

                                                     The register is used to report the DW_apb_i2c hardware
                                                     status when the IC_ENABLE[0] register is set from 1 to
                                                     0; that is, when DW_apb_i2c is disabled.

