mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
                                                     This register is used to store the duration, measured in
                                                     ic_clk cycles, of the longest spike that is filtered out
                                                     by the spike suppression logic when the component is operating
                                                     in SS, FS or FM+ modes. The relevant I2C requirement is
                                                     tSP (table 4) as detailed in the I2C Bus Specification.
                                                     This register must be programmed with a minimum value of
                                                     1.                                                                        */

    struct {
      __IOM uint32_t IC_FS_SPKLEN : 8;          /*!< This register must be set before any I2C bus transaction can
                                                     take place to ensure stable operation. This register sets
                                                     the duration, measured in ic_clk cycles, of the longest
                                                     spike in the SCL or SDA lines that will be filtered out
                                                     by the spike suppression logic. This register can be written
                                                     only when the I2C interface is disabled which corresponds
                                                     to the IC_ENABLE[0] register being set to 0. Writes at
                                                     other times have no effect. The minimum valid value is
                                                     1; hardware prevents values less than this being written,
                                                     and if attempted results in 1 being set. or more information,
                                                     refer to 'Spike Suppression'.                                             */
            uint32_t            : 24;
    } IC_FS_SPKLEN_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t IC_CLR_RESTART_DET;          /*!< Clear RESTART_DET Interrupt Register                                      */

    struct {
      __IM  uint32_t CLR_RESTART_DET : 1;       /*!< Read this register to clear the RESTART_DET interrupt (bit 12)
                                                     of IC_RAW_INTR_STAT register.

                                                     Reset value: 0x0                                                          */
            uint32_t            : 31;
    } IC_CLR_RESTART_DET_b;
  } ;
  __IM  uint32_t  RESERVED3[18];

  union {
    __IOM uint32_t IC_COMP_PARAM_1;             /*!< Component Parameter Register 1

                                                     Note This register is not implemented and therefore reads
                                                     as 0. If it was implemented it would be a constant read-only
                                                     register that contains encoded information about the component's
                                                     parameter settings. Fields shown below are the settings
                                                     for those parameters                                                      */

    struct {
      __IM  uint32_t APB_DATA_WIDTH : 2;        /*!< APB data bus width is 32 bits                                             */
      __IM  uint32_t MAX_SPEED_MODE : 2;        /*!< MAX SPEED MODE = FAST MODE                                                */
      __IM  uint32_t HC_COUNT_VALUES : 1;       /*!< Programmable count values for each mode.                                  */
      __IM  uint32_t INTR_IO    : 1;            /*!< COMBINED Interrupt outputs                                                */
      __IM  uint32_t HAS_DMA    : 1;            /*!< DMA handshaking signals are enabled                                       */
      __IM  uint32_t ADD_ENCODED_PARAMS : 1;    /*!< Encoded parameters not visible                                            */
      __IM  uint32_t RX_BUFFER_DEPTH : 8;       /*!< RX Buffer Depth = 16                                                      */
      __IM  uint32_t TX_BUFFER_DEPTH : 8;       /*!< TX Buffer Depth = 16                                                      */
            uint32_t            : 8;
    } IC_COMP_PARAM_1_b;
  } ;

  union {
    __IOM uint32_t IC_COMP_VERSION;             /*!< I2C Component Version Register                                            */

    struct {
      __IM  uint32_t IC_COMP_VERSION : 32;      /*!< IC_COMP_VERSION                                                           */
    } IC_COMP_VERSION_b;
  } ;

  union {
    __IOM uint32_t IC_COMP_TYPE;                /*!< I2C Component Type Register                                               */

    struct {
      __IM  uint32_t IC_COMP_TYPE : 32;         /*!< Designware Component Type number = 0x44_57_01_40. This assigned
                                                     unique hex value is constant and is derived from the two
                                                     ASCII letters 'DW' followed by a 16-bit unsigned number.                  */
    } IC_COMP_TYPE_b;
  } ;
} I2C0_Type;                                    /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Control and data interface to SAR ADC (ADC)
  */

typedef struct {                                /*!< ADC Structure                                                             */

  union {
    __IOM uint32_t CS;                          /*!< ADC Control and Status                                                    */

