mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< Power on ADC and enable its clock.
                                                     1 - enabled. 0 - disabled.                                                */
      __IOM uint32_t TS_EN      : 1;            /*!< Power on temperature sensor. 1 - enabled. 0 - disabled.                   */
      __IOM uint32_t START_ONCE : 1;            /*!< Start a single conversion. Self-clearing. Ignored if start_many
                                                     is asserted.                                                              */
      __IOM uint32_t START_MANY : 1;            /*!< Continuously perform conversions whilst this bit is 1. A new
                                                     conversion will start immediately after the previous finishes.            */
            uint32_t            : 4;
      __IM  uint32_t READY      : 1;            /*!< 1 if the ADC is ready to start a new conversion. Implies any
                                                     previous conversion has completed.
                                                     0 whilst conversion in progress.                                          */
      __IM  uint32_t ERR        : 1;            /*!< The most recent ADC conversion encountered an error; result
                                                     is undefined or noisy.                                                    */
      __IOM uint32_t ERR_STICKY : 1;            /*!< Some past ADC conversion encountered an error. Write 1 to clear.          */
            uint32_t            : 1;
      __IOM uint32_t AINSEL     : 3;            /*!< Select analog mux input. Updated automatically in round-robin
                                                     mode.                                                                     */
            uint32_t            : 1;
      __IOM uint32_t RROBIN     : 5;            /*!< Round-robin sampling. 1 bit per channel. Set all bits to 0 to
                                                     disable.
                                                     Otherwise, the ADC will cycle through each enabled channel
                                                     in a round-robin fashion.
                                                     The first channel to be sampled will be the one currently
                                                     indicated by AINSEL.
                                                     AINSEL will be updated after each conversion with the newly-selected
                                                     channel.                                                                  */
            uint32_t            : 11;
    } CS_b;
  } ;

  union {
    __IOM uint32_t RESULT;                      /*!< Result of most recent ADC conversion                                      */

    struct {
      __IM  uint32_t RESULT     : 12;           /*!< RESULT                                                                    */
            uint32_t            : 20;
    } RESULT_b;
  } ;

  union {
    __IOM uint32_t FCS;                         /*!< FIFO control and status                                                   */

    struct {
      __IOM uint32_t EN         : 1;            /*!< If 1: write result to the FIFO after each conversion.                     */
      __IOM uint32_t SHIFT      : 1;            /*!< If 1: FIFO results are right-shifted to be one byte in size.
                                                     Enables DMA to byte buffers.                                              */
      __IOM uint32_t ERR        : 1;            /*!< If 1: conversion error bit appears in the FIFO alongside the
                                                     result                                                                    */
      __IOM uint32_t DREQ_EN    : 1;            /*!< If 1: assert DMA requests when FIFO contains data                         */
            uint32_t            : 4;
      __IM  uint32_t EMPTY      : 1;            /*!< EMPTY                                                                     */
      __IM  uint32_t FULL       : 1;            /*!< FULL                                                                      */
      __IOM uint32_t UNDER      : 1;            /*!< 1 if the FIFO has been underflowed. Write 1 to clear.                     */
      __IOM uint32_t OVER       : 1;            /*!< 1 if the FIFO has been overflowed. Write 1 to clear.                      */
            uint32_t            : 4;
      __IM  uint32_t LEVEL      : 4;            /*!< The number of conversion results currently waiting in the FIFO            */
            uint32_t            : 4;
      __IOM uint32_t THRESH     : 4;            /*!< DREQ/IRQ asserted when level >= threshold                                 */
            uint32_t            : 4;
    } FCS_b;
  } ;

  union {
    __IOM uint32_t FIFO;                        /*!< Conversion result FIFO                                                    */

    struct {
      __IM  uint32_t VAL        : 12;           /*!< VAL                                                                       */
            uint32_t            : 3;
      __IM  uint32_t ERR        : 1;            /*!< 1 if this particular sample experienced a conversion error.
                                                     Remains in the same location if the sample is shifted.                    */
            uint32_t            : 16;
    } FIFO_b;
  } ;

  union {
    __IOM uint32_t DIV;                         /*!< Clock divider. If non-zero, CS_START_MANY will start conversions
                                                     at regular intervals rather than back-to-back.
                                                     The divider is reset when either of these fields are written.
                                                     Total period is 1 + INT + FRAC / 256                                      */

