mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t FRAC       : 8;            /*!< Fractional part of clock divisor. First-order delta-sigma.                */
      __IOM uint32_t INT        : 16;           /*!< Integer part of clock divisor.                                            */
            uint32_t            : 8;
    } DIV_b;
  } ;

  union {
    __IOM uint32_t INTR;                        /*!< Raw Interrupts                                                            */

    struct {
      __IM  uint32_t FIFO       : 1;            /*!< Triggered when the sample FIFO reaches a certain level.
                                                     This level can be programmed via the FCS_THRESH field.                    */
            uint32_t            : 31;
    } INTR_b;
  } ;

  union {
    __IOM uint32_t INTE;                        /*!< Interrupt Enable                                                          */

    struct {
      __IOM uint32_t FIFO       : 1;            /*!< Triggered when the sample FIFO reaches a certain level.
                                                     This level can be programmed via the FCS_THRESH field.                    */
            uint32_t            : 31;
    } INTE_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< Interrupt Force                                                           */

    struct {
      __IOM uint32_t FIFO       : 1;            /*!< Triggered when the sample FIFO reaches a certain level.
                                                     This level can be programmed via the FCS_THRESH field.                    */
            uint32_t            : 31;
    } INTF_b;
  } ;

  union {
    __IOM uint32_t INTS;                        /*!< Interrupt status after masking & forcing                                  */

    struct {
      __IM  uint32_t FIFO       : 1;            /*!< Triggered when the sample FIFO reaches a certain level.
                                                     This level can be programmed via the FCS_THRESH field.                    */
            uint32_t            : 31;
    } INTS_b;
  } ;
} ADC_Type;                                     /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                            PWM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Simple PWM (PWM)
  */

typedef struct {                                /*!< PWM Structure                                                             */

  union {
    __IOM uint32_t CH0_CSR;                     /*!< Control and status register                                               */

    struct {
      __IOM uint32_t EN         : 1;            /*!< Enable the PWM channel.                                                   */
      __IOM uint32_t PH_CORRECT : 1;            /*!< 1: Enable phase-correct modulation. 0: Trailing-edge                      */
      __IOM uint32_t A_INV      : 1;            /*!< Invert output A                                                           */
      __IOM uint32_t B_INV      : 1;            /*!< Invert output B                                                           */
      __IOM uint32_t DIVMODE    : 2;            /*!< DIVMODE                                                                   */
      __IOM uint32_t PH_RET     : 1;            /*!< Retard the phase of the counter by 1 count, while it is running.
                                                     Self-clearing. Write a 1, and poll until low. Counter must
                                                     be running.                                                               */
      __IOM uint32_t PH_ADV     : 1;            /*!< Advance the phase of the counter by 1 count, while it is running.
                                                     Self-clearing. Write a 1, and poll until low. Counter must
                                                     be running
                                                     at less than full speed (div_int + div_frac / 16 > 1)                     */
            uint32_t            : 24;
    } CH0_CSR_b;
  } ;

  union {
    __IOM uint32_t CH0_DIV;                     /*!< INT and FRAC form a fixed-point fractional number.
                                                     Counting rate is system clock frequency divided by this
                                                     number.
                                                     Fractional division uses simple 1st-order sigma-delta.                    */

    struct {
      __IOM uint32_t FRAC       : 4;            /*!< FRAC                                                                      */
      __IOM uint32_t INT        : 8;            /*!< INT                                                                       */
            uint32_t            : 20;
    } CH0_DIV_b;
  } ;

  union {
    __IOM uint32_t CH0_CTR;                     /*!< Direct access to the PWM counter                                          */

    struct {
      __IOM uint32_t CH0_CTR    : 16;           /*!< CH0_CTR                                                                   */
            uint32_t            : 16;
    } CH0_CTR_b;
  } ;

  union {
    __IOM uint32_t CH0_CC;                      /*!< Counter compare values                                                    */

    struct {
      __IOM uint32_t A          : 16;           /*!< A                                                                         */
      __IOM uint32_t B          : 16;           /*!< B                                                                         */
    } CH0_CC_b;
  } ;

  union {
    __IOM uint32_t CH0_TOP;                     /*!< Counter wrap value                                                        */

