mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t CH2_CTR    : 16;           /*!< CH2_CTR                                                                   */
            uint32_t            : 16;
    } CH2_CTR_b;
  } ;

  union {
    __IOM uint32_t CH2_CC;                      /*!< Counter compare values                                                    */

    struct {
      __IOM uint32_t A          : 16;           /*!< A                                                                         */
      __IOM uint32_t B          : 16;           /*!< B                                                                         */
    } CH2_CC_b;
  } ;

  union {
    __IOM uint32_t CH2_TOP;                     /*!< Counter wrap value                                                        */

    struct {
      __IOM uint32_t CH2_TOP    : 16;           /*!< CH2_TOP                                                                   */
            uint32_t            : 16;
    } CH2_TOP_b;
  } ;

  union {
    __IOM uint32_t CH3_CSR;                     /*!< Control and status register                                               */

    struct {
      __IOM uint32_t EN         : 1;            /*!< Enable the PWM channel.                                                   */
      __IOM uint32_t PH_CORRECT : 1;            /*!< 1: Enable phase-correct modulation. 0: Trailing-edge                      */
      __IOM uint32_t A_INV      : 1;            /*!< Invert output A                                                           */
      __IOM uint32_t B_INV      : 1;            /*!< Invert output B                                                           */
      __IOM uint32_t DIVMODE    : 2;            /*!< DIVMODE                                                                   */
      __IOM uint32_t PH_RET     : 1;            /*!< Retard the phase of the counter by 1 count, while it is running.
                                                     Self-clearing. Write a 1, and poll until low. Counter must
                                                     be running.                                                               */
      __IOM uint32_t PH_ADV     : 1;            /*!< Advance the phase of the counter by 1 count, while it is running.
                                                     Self-clearing. Write a 1, and poll until low. Counter must
                                                     be running
                                                     at less than full speed (div_int + div_frac / 16 > 1)                     */
            uint32_t            : 24;
    } CH3_CSR_b;
  } ;

  union {
    __IOM uint32_t CH3_DIV;                     /*!< INT and FRAC form a fixed-point fractional number.
                                                     Counting rate is system clock frequency divided by this
                                                     number.
                                                     Fractional division uses simple 1st-order sigma-delta.                    */

    struct {
      __IOM uint32_t FRAC       : 4;            /*!< FRAC                                                                      */
      __IOM uint32_t INT        : 8;            /*!< INT                                                                       */
            uint32_t            : 20;
    } CH3_DIV_b;
  } ;

  union {
    __IOM uint32_t CH3_CTR;                     /*!< Direct access to the PWM counter                                          */

    struct {
      __IOM uint32_t CH3_CTR    : 16;           /*!< CH3_CTR                                                                   */
            uint32_t            : 16;
    } CH3_CTR_b;
  } ;

  union {
    __IOM uint32_t CH3_CC;                      /*!< Counter compare values                                                    */

    struct {
      __IOM uint32_t A          : 16;           /*!< A                                                                         */
      __IOM uint32_t B          : 16;           /*!< B                                                                         */
    } CH3_CC_b;
  } ;

  union {
    __IOM uint32_t CH3_TOP;                     /*!< Counter wrap value                                                        */

    struct {
      __IOM uint32_t CH3_TOP    : 16;           /*!< CH3_TOP                                                                   */
            uint32_t            : 16;
    } CH3_TOP_b;
  } ;

  union {
    __IOM uint32_t CH4_CSR;                     /*!< Control and status register                                               */

    struct {
      __IOM uint32_t EN         : 1;            /*!< Enable the PWM channel.                                                   */
      __IOM uint32_t PH_CORRECT : 1;            /*!< 1: Enable phase-correct modulation. 0: Trailing-edge                      */
      __IOM uint32_t A_INV      : 1;            /*!< Invert output A                                                           */
      __IOM uint32_t B_INV      : 1;            /*!< Invert output B                                                           */
      __IOM uint32_t DIVMODE    : 2;            /*!< DIVMODE                                                                   */
      __IOM uint32_t PH_RET     : 1;            /*!< Retard the phase of the counter by 1 count, while it is running.
                                                     Self-clearing. Write a 1, and poll until low. Counter must
                                                     be running.                                                               */
      __IOM uint32_t PH_ADV     : 1;            /*!< Advance the phase of the counter by 1 count, while it is running.
                                                     Self-clearing. Write a 1, and poll until low. Counter must
                                                     be running
                                                     at less than full speed (div_int + div_frac / 16 > 1)                     */
            uint32_t            : 24;
    } CH4_CSR_b;
  } ;

  union {
    __IOM uint32_t CH4_DIV;                     /*!< INT and FRAC form a fixed-point fractional number.
                                                     Counting rate is system clock frequency divided by this
                                                     number.
                                                     Fractional division uses simple 1st-order sigma-delta.                    */

