mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t FRAC       : 4;            /*!< FRAC                                                                      */
      __IOM uint32_t INT        : 8;            /*!< INT                                                                       */
            uint32_t            : 20;
    } CH6_DIV_b;
  } ;

  union {
    __IOM uint32_t CH6_CTR;                     /*!< Direct access to the PWM counter                                          */

    struct {
      __IOM uint32_t CH6_CTR    : 16;           /*!< CH6_CTR                                                                   */
            uint32_t            : 16;
    } CH6_CTR_b;
  } ;

  union {
    __IOM uint32_t CH6_CC;                      /*!< Counter compare values                                                    */

    struct {
      __IOM uint32_t A          : 16;           /*!< A                                                                         */
      __IOM uint32_t B          : 16;           /*!< B                                                                         */
    } CH6_CC_b;
  } ;

  union {
    __IOM uint32_t CH6_TOP;                     /*!< Counter wrap value                                                        */

    struct {
      __IOM uint32_t CH6_TOP    : 16;           /*!< CH6_TOP                                                                   */
            uint32_t            : 16;
    } CH6_TOP_b;
  } ;

  union {
    __IOM uint32_t CH7_CSR;                     /*!< Control and status register                                               */

    struct {
      __IOM uint32_t EN         : 1;            /*!< Enable the PWM channel.                                                   */
      __IOM uint32_t PH_CORRECT : 1;            /*!< 1: Enable phase-correct modulation. 0: Trailing-edge                      */
      __IOM uint32_t A_INV      : 1;            /*!< Invert output A                                                           */
      __IOM uint32_t B_INV      : 1;            /*!< Invert output B                                                           */
      __IOM uint32_t DIVMODE    : 2;            /*!< DIVMODE                                                                   */
      __IOM uint32_t PH_RET     : 1;            /*!< Retard the phase of the counter by 1 count, while it is running.
                                                     Self-clearing. Write a 1, and poll until low. Counter must
                                                     be running.                                                               */
      __IOM uint32_t PH_ADV     : 1;            /*!< Advance the phase of the counter by 1 count, while it is running.
                                                     Self-clearing. Write a 1, and poll until low. Counter must
                                                     be running
                                                     at less than full speed (div_int + div_frac / 16 > 1)                     */
            uint32_t            : 24;
    } CH7_CSR_b;
  } ;

  union {
    __IOM uint32_t CH7_DIV;                     /*!< INT and FRAC form a fixed-point fractional number.
                                                     Counting rate is system clock frequency divided by this
                                                     number.
                                                     Fractional division uses simple 1st-order sigma-delta.                    */

    struct {
      __IOM uint32_t FRAC       : 4;            /*!< FRAC                                                                      */
      __IOM uint32_t INT        : 8;            /*!< INT                                                                       */
            uint32_t            : 20;
    } CH7_DIV_b;
  } ;

  union {
    __IOM uint32_t CH7_CTR;                     /*!< Direct access to the PWM counter                                          */

    struct {
      __IOM uint32_t CH7_CTR    : 16;           /*!< CH7_CTR                                                                   */
            uint32_t            : 16;
    } CH7_CTR_b;
  } ;

  union {
    __IOM uint32_t CH7_CC;                      /*!< Counter compare values                                                    */

    struct {
      __IOM uint32_t A          : 16;           /*!< A                                                                         */
      __IOM uint32_t B          : 16;           /*!< B                                                                         */
    } CH7_CC_b;
  } ;

  union {
    __IOM uint32_t CH7_TOP;                     /*!< Counter wrap value                                                        */

    struct {
      __IOM uint32_t CH7_TOP    : 16;           /*!< CH7_TOP                                                                   */
            uint32_t            : 16;
    } CH7_TOP_b;
  } ;

  union {
    __IOM uint32_t EN;                          /*!< This register aliases the CSR_EN bits for all channels.
                                                     Writing to this register allows multiple channels to be
                                                     enabled
                                                     or disabled simultaneously, so they can run in perfect
                                                     sync.
                                                     For each channel, there is only one physical EN register
                                                     bit,
                                                     which can be accessed through here or CHx_CSR.                            */

    struct {
      __IOM uint32_t CH0        : 1;            /*!< CH0                                                                       */
      __IOM uint32_t CH1        : 1;            /*!< CH1                                                                       */
      __IOM uint32_t CH2        : 1;            /*!< CH2                                                                       */
      __IOM uint32_t CH3        : 1;            /*!< CH3                                                                       */
      __IOM uint32_t CH4        : 1;            /*!< CH4                                                                       */
      __IOM uint32_t CH5        : 1;            /*!< CH5                                                                       */
      __IOM uint32_t CH6        : 1;            /*!< CH6                                                                       */
      __IOM uint32_t CH7        : 1;            /*!< CH7                                                                       */
            uint32_t            : 24;
    } EN_b;
  } ;

  union {
    __IOM uint32_t INTR;                        /*!< Raw Interrupts                                                            */

