mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t CH0        : 1;            /*!< CH0                                                                       */
      __IOM uint32_t CH1        : 1;            /*!< CH1                                                                       */
      __IOM uint32_t CH2        : 1;            /*!< CH2                                                                       */
      __IOM uint32_t CH3        : 1;            /*!< CH3                                                                       */
      __IOM uint32_t CH4        : 1;            /*!< CH4                                                                       */
      __IOM uint32_t CH5        : 1;            /*!< CH5                                                                       */
      __IOM uint32_t CH6        : 1;            /*!< CH6                                                                       */
      __IOM uint32_t CH7        : 1;            /*!< CH7                                                                       */
            uint32_t            : 24;
    } INTR_b;
  } ;

  union {
    __IOM uint32_t INTE;                        /*!< Interrupt Enable                                                          */

    struct {
      __IOM uint32_t CH0        : 1;            /*!< CH0                                                                       */
      __IOM uint32_t CH1        : 1;            /*!< CH1                                                                       */
      __IOM uint32_t CH2        : 1;            /*!< CH2                                                                       */
      __IOM uint32_t CH3        : 1;            /*!< CH3                                                                       */
      __IOM uint32_t CH4        : 1;            /*!< CH4                                                                       */
      __IOM uint32_t CH5        : 1;            /*!< CH5                                                                       */
      __IOM uint32_t CH6        : 1;            /*!< CH6                                                                       */
      __IOM uint32_t CH7        : 1;            /*!< CH7                                                                       */
            uint32_t            : 24;
    } INTE_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< Interrupt Force                                                           */

    struct {
      __IOM uint32_t CH0        : 1;            /*!< CH0                                                                       */
      __IOM uint32_t CH1        : 1;            /*!< CH1                                                                       */
      __IOM uint32_t CH2        : 1;            /*!< CH2                                                                       */
      __IOM uint32_t CH3        : 1;            /*!< CH3                                                                       */
      __IOM uint32_t CH4        : 1;            /*!< CH4                                                                       */
      __IOM uint32_t CH5        : 1;            /*!< CH5                                                                       */
      __IOM uint32_t CH6        : 1;            /*!< CH6                                                                       */
      __IOM uint32_t CH7        : 1;            /*!< CH7                                                                       */
            uint32_t            : 24;
    } INTF_b;
  } ;

  union {
    __IOM uint32_t INTS;                        /*!< Interrupt status after masking & forcing                                  */

    struct {
      __IM  uint32_t CH0        : 1;            /*!< CH0                                                                       */
      __IM  uint32_t CH1        : 1;            /*!< CH1                                                                       */
      __IM  uint32_t CH2        : 1;            /*!< CH2                                                                       */
      __IM  uint32_t CH3        : 1;            /*!< CH3                                                                       */
      __IM  uint32_t CH4        : 1;            /*!< CH4                                                                       */
      __IM  uint32_t CH5        : 1;            /*!< CH5                                                                       */
      __IM  uint32_t CH6        : 1;            /*!< CH6                                                                       */
      __IM  uint32_t CH7        : 1;            /*!< CH7                                                                       */
            uint32_t            : 24;
    } INTS_b;
  } ;
} PWM_Type;                                     /*!< Size = 180 (0xb4)                                                         */



/* =========================================================================================================================== */
/* ================                                           TIMER                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Controls time and alarms
        time is a 64 bit value indicating the time in usec since power-on
        timeh is the top 32 bits of time & timel is the bottom 32 bits
        to change time write to timelw before timehw
        to read time read from timelr before timehr
        An alarm is set by setting alarm_enable and writing to the corresponding alarm register
        When an alarm is pending, the corresponding alarm_running signal will be high
        An alarm can be cancelled before it has finished by clearing the alarm_enable
        When an alarm fires, the corresponding alarm_irq is set and alarm_running is cleared
        To clear the interrupt write a 1 to the corresponding alarm_irq (TIMER)
  */

