mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
typedef struct {                                /*!< TIMER Structure                                                           */
  __OM  uint32_t  TIMEHW;                       /*!< Write to bits 63:32 of time
                                                     always write timelw before timehw                                         */
  __OM  uint32_t  TIMELW;                       /*!< Write to bits 31:0 of time
                                                     writes do not get copied to time until timehw is written                  */
  __IM  uint32_t  TIMEHR;                       /*!< Read from bits 63:32 of time
                                                     always read timelr before timehr                                          */
  __IM  uint32_t  TIMELR;                       /*!< Read from bits 31:0 of time                                               */
  __IOM uint32_t  ALARM0;                       /*!< Arm alarm 0, and configure the time it will fire.
                                                     Once armed, the alarm fires when TIMER_ALARM0 == TIMELR.
                                                     The alarm will disarm itself once it fires, and can
                                                     be disarmed early using the ARMED status register.                        */
  __IOM uint32_t  ALARM1;                       /*!< Arm alarm 1, and configure the time it will fire.
                                                     Once armed, the alarm fires when TIMER_ALARM1 == TIMELR.
                                                     The alarm will disarm itself once it fires, and can
                                                     be disarmed early using the ARMED status register.                        */
  __IOM uint32_t  ALARM2;                       /*!< Arm alarm 2, and configure the time it will fire.
                                                     Once armed, the alarm fires when TIMER_ALARM2 == TIMELR.
                                                     The alarm will disarm itself once it fires, and can
                                                     be disarmed early using the ARMED status register.                        */
  __IOM uint32_t  ALARM3;                       /*!< Arm alarm 3, and configure the time it will fire.
                                                     Once armed, the alarm fires when TIMER_ALARM3 == TIMELR.
                                                     The alarm will disarm itself once it fires, and can
                                                     be disarmed early using the ARMED status register.                        */

  union {
    __IOM uint32_t ARMED;                       /*!< Indicates the armed/disarmed status of each alarm.
                                                     A write to the corresponding ALARMx register arms the alarm.
                                                     Alarms automatically disarm upon firing, but writing ones
                                                     here
                                                     will disarm immediately without waiting to fire.                          */

    struct {
      __IOM uint32_t ARMED      : 4;            /*!< ARMED                                                                     */
            uint32_t            : 28;
    } ARMED_b;
  } ;
  __IM  uint32_t  TIMERAWH;                     /*!< Raw read from bits 63:32 of time (no side effects)                        */
  __IM  uint32_t  TIMERAWL;                     /*!< Raw read from bits 31:0 of time (no side effects)                         */

  union {
    __IOM uint32_t DBGPAUSE;                    /*!< Set bits high to enable pause when the corresponding debug ports
                                                     are active                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t DBG0       : 1;            /*!< Pause when processor 0 is in debug mode                                   */
      __IOM uint32_t DBG1       : 1;            /*!< Pause when processor 1 is in debug mode                                   */
            uint32_t            : 29;
    } DBGPAUSE_b;
  } ;

  union {
    __IOM uint32_t PAUSE;                       /*!< Set high to pause the timer                                               */

    struct {
      __IOM uint32_t PAUSE      : 1;            /*!< PAUSE                                                                     */
            uint32_t            : 31;
    } PAUSE_b;
  } ;

  union {
    __IOM uint32_t INTR;                        /*!< Raw Interrupts                                                            */

    struct {
      __IOM uint32_t ALARM_0    : 1;            /*!< ALARM_0                                                                   */
      __IOM uint32_t ALARM_1    : 1;            /*!< ALARM_1                                                                   */
      __IOM uint32_t ALARM_2    : 1;            /*!< ALARM_2                                                                   */
      __IOM uint32_t ALARM_3    : 1;            /*!< ALARM_3                                                                   */
            uint32_t            : 28;
    } INTR_b;
  } ;

  union {
    __IOM uint32_t INTE;                        /*!< Interrupt Enable                                                          */

    struct {
      __IOM uint32_t ALARM_0    : 1;            /*!< ALARM_0                                                                   */
      __IOM uint32_t ALARM_1    : 1;            /*!< ALARM_1                                                                   */
      __IOM uint32_t ALARM_2    : 1;            /*!< ALARM_2                                                                   */
      __IOM uint32_t ALARM_3    : 1;            /*!< ALARM_3                                                                   */
            uint32_t            : 28;
    } INTE_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< Interrupt Force                                                           */

