mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t ALARM_0    : 1;            /*!< ALARM_0                                                                   */
      __IOM uint32_t ALARM_1    : 1;            /*!< ALARM_1                                                                   */
      __IOM uint32_t ALARM_2    : 1;            /*!< ALARM_2                                                                   */
      __IOM uint32_t ALARM_3    : 1;            /*!< ALARM_3                                                                   */
            uint32_t            : 28;
    } INTF_b;
  } ;

  union {
    __IOM uint32_t INTS;                        /*!< Interrupt status after masking & forcing                                  */

    struct {
      __IM  uint32_t ALARM_0    : 1;            /*!< ALARM_0                                                                   */
      __IM  uint32_t ALARM_1    : 1;            /*!< ALARM_1                                                                   */
      __IM  uint32_t ALARM_2    : 1;            /*!< ALARM_2                                                                   */
      __IM  uint32_t ALARM_3    : 1;            /*!< ALARM_3                                                                   */
            uint32_t            : 28;
    } INTS_b;
  } ;
} TIMER_Type;                                   /*!< Size = 68 (0x44)                                                          */



/* =========================================================================================================================== */
/* ================                                         WATCHDOG                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief WATCHDOG (WATCHDOG)
  */

typedef struct {                                /*!< WATCHDOG Structure                                                        */

  union {
    __IOM uint32_t CTRL;                        /*!< Watchdog control
                                                     The rst_wdsel register determines which subsystems are
                                                     reset when the watchdog is triggered.
                                                     The watchdog can be triggered in software.                                */

    struct {
      __IM  uint32_t TIME       : 24;           /*!< Indicates the number of ticks / 2 (see errata RP2040-E1) before
                                                     a watchdog reset will be triggered                                        */
      __IOM uint32_t PAUSE_JTAG : 1;            /*!< Pause the watchdog timer when JTAG is accessing the bus fabric            */
      __IOM uint32_t PAUSE_DBG0 : 1;            /*!< Pause the watchdog timer when processor 0 is in debug mode                */
      __IOM uint32_t PAUSE_DBG1 : 1;            /*!< Pause the watchdog timer when processor 1 is in debug mode                */
            uint32_t            : 3;
      __IOM uint32_t ENABLE     : 1;            /*!< When not enabled the watchdog timer is paused                             */
      __IOM uint32_t TRIGGER    : 1;            /*!< Trigger a watchdog reset                                                  */
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t LOAD;                        /*!< Load the watchdog timer. The maximum setting is 0xffffff which
                                                     corresponds to 0xffffff / 2 ticks before triggering a watchdog
                                                     reset (see errata RP2040-E1).                                             */

    struct {
      __OM  uint32_t LOAD       : 24;           /*!< LOAD                                                                      */
            uint32_t            : 8;
    } LOAD_b;
  } ;

  union {
    __IOM uint32_t REASON;                      /*!< Logs the reason for the last reset. Both bits are zero for the
                                                     case of a hardware reset.                                                 */

    struct {
      __IM  uint32_t TIMER      : 1;            /*!< TIMER                                                                     */
      __IM  uint32_t FORCE      : 1;            /*!< FORCE                                                                     */
            uint32_t            : 30;
    } REASON_b;
  } ;
  __IOM uint32_t  SCRATCH0;                     /*!< Scratch register. Information persists through soft reset of
                                                     the chip.                                                                 */
  __IOM uint32_t  SCRATCH1;                     /*!< Scratch register. Information persists through soft reset of
                                                     the chip.                                                                 */
  __IOM uint32_t  SCRATCH2;                     /*!< Scratch register. Information persists through soft reset of
                                                     the chip.                                                                 */
  __IOM uint32_t  SCRATCH3;                     /*!< Scratch register. Information persists through soft reset of
                                                     the chip.                                                                 */
  __IOM uint32_t  SCRATCH4;                     /*!< Scratch register. Information persists through soft reset of
                                                     the chip.                                                                 */
  __IOM uint32_t  SCRATCH5;                     /*!< Scratch register. Information persists through soft reset of
                                                     the chip.                                                                 */
  __IOM uint32_t  SCRATCH6;                     /*!< Scratch register. Information persists through soft reset of
                                                     the chip.                                                                 */
  __IOM uint32_t  SCRATCH7;                     /*!< Scratch register. Information persists through soft reset of
                                                     the chip.                                                                 */

  union {
    __IOM uint32_t TICK;                        /*!< Controls the tick generator                                               */

