mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t CYCLES     : 9;            /*!< Total number of clk_tick cycles before the next tick.                     */
      __IOM uint32_t ENABLE     : 1;            /*!< start / stop tick generation                                              */
      __IM  uint32_t RUNNING    : 1;            /*!< Is the tick generator running?                                            */
      __IM  uint32_t COUNT      : 9;            /*!< Count down timer: the remaining number clk_tick cycles before
                                                     the next tick is generated.                                               */
            uint32_t            : 12;
    } TICK_b;
  } ;
} WATCHDOG_Type;                                /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Register block to control RTC (RTC)
  */

typedef struct {                                /*!< RTC Structure                                                             */

  union {
    __IOM uint32_t CLKDIV_M1;                   /*!< Divider minus 1 for the 1 second counter. Safe to change the
                                                     value when RTC is not enabled.                                            */

    struct {
      __IOM uint32_t CLKDIV_M1  : 16;           /*!< CLKDIV_M1                                                                 */
            uint32_t            : 16;
    } CLKDIV_M1_b;
  } ;

  union {
    __IOM uint32_t SETUP_0;                     /*!< RTC setup register 0                                                      */

    struct {
      __IOM uint32_t DAY        : 5;            /*!< Day of the month (1..31)                                                  */
            uint32_t            : 3;
      __IOM uint32_t MONTH      : 4;            /*!< Month (1..12)                                                             */
      __IOM uint32_t YEAR       : 12;           /*!< Year                                                                      */
            uint32_t            : 8;
    } SETUP_0_b;
  } ;

  union {
    __IOM uint32_t SETUP_1;                     /*!< RTC setup register 1                                                      */

    struct {
      __IOM uint32_t SEC        : 6;            /*!< Seconds                                                                   */
            uint32_t            : 2;
      __IOM uint32_t MIN        : 6;            /*!< Minutes                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HOUR       : 5;            /*!< Hours                                                                     */
            uint32_t            : 3;
      __IOM uint32_t DOTW       : 3;            /*!< Day of the week: 1-Monday...0-Sunday ISO 8601 mod 7                       */
            uint32_t            : 5;
    } SETUP_1_b;
  } ;

  union {
    __IOM uint32_t CTRL;                        /*!< RTC Control and status                                                    */

    struct {
      __IOM uint32_t RTC_ENABLE : 1;            /*!< Enable RTC                                                                */
      __IM  uint32_t RTC_ACTIVE : 1;            /*!< RTC enabled (running)                                                     */
            uint32_t            : 2;
      __IOM uint32_t LOAD       : 1;            /*!< Load RTC                                                                  */
            uint32_t            : 3;
      __IOM uint32_t FORCE_NOTLEAPYEAR : 1;     /*!< If set, leapyear is forced off.
                                                     Useful for years divisible by 100 but not by 400                          */
            uint32_t            : 23;
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t IRQ_SETUP_0;                 /*!< Interrupt setup register 0                                                */

    struct {
      __IOM uint32_t DAY        : 5;            /*!< Day of the month (1..31)                                                  */
            uint32_t            : 3;
      __IOM uint32_t MONTH      : 4;            /*!< Month (1..12)                                                             */
      __IOM uint32_t YEAR       : 12;           /*!< Year                                                                      */
      __IOM uint32_t DAY_ENA    : 1;            /*!< Enable day matching                                                       */
      __IOM uint32_t MONTH_ENA  : 1;            /*!< Enable month matching                                                     */
      __IOM uint32_t YEAR_ENA   : 1;            /*!< Enable year matching                                                      */
            uint32_t            : 1;
      __IOM uint32_t MATCH_ENA  : 1;            /*!< Global match enable. Don't change any other value while this
                                                     one is enabled                                                            */
      __IM  uint32_t MATCH_ACTIVE : 1;          /*!< MATCH_ACTIVE                                                              */
            uint32_t            : 2;
    } IRQ_SETUP_0_b;
  } ;

  union {
    __IOM uint32_t IRQ_SETUP_1;                 /*!< Interrupt setup register 1                                                */

    struct {
      __IOM uint32_t SEC        : 6;            /*!< Seconds                                                                   */
            uint32_t            : 2;
      __IOM uint32_t MIN        : 6;            /*!< Minutes                                                                   */
            uint32_t            : 2;
      __IOM uint32_t HOUR       : 5;            /*!< Hours                                                                     */
            uint32_t            : 3;
      __IOM uint32_t DOTW       : 3;            /*!< Day of the week                                                           */
            uint32_t            : 1;
      __IOM uint32_t SEC_ENA    : 1;            /*!< Enable second matching                                                    */
      __IOM uint32_t MIN_ENA    : 1;            /*!< Enable minute matching                                                    */
      __IOM uint32_t HOUR_ENA   : 1;            /*!< Enable hour matching                                                      */
      __IOM uint32_t DOTW_ENA   : 1;            /*!< Enable day of the week matching                                           */
    } IRQ_SETUP_1_b;
  } ;

  union {
    __IOM uint32_t RTC_1;                       /*!< RTC register 1.                                                           */

