mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t DAY        : 5;            /*!< Day of the month (1..31)                                                  */
            uint32_t            : 3;
      __IM  uint32_t MONTH      : 4;            /*!< Month (1..12)                                                             */
      __IM  uint32_t YEAR       : 12;           /*!< Year                                                                      */
            uint32_t            : 8;
    } RTC_1_b;
  } ;

  union {
    __IOM uint32_t RTC_0;                       /*!< RTC register 0
                                                     Read this before RTC 1!                                                   */

    struct {
      __IM  uint32_t SEC        : 6;            /*!< Seconds                                                                   */
            uint32_t            : 2;
      __IM  uint32_t MIN        : 6;            /*!< Minutes                                                                   */
            uint32_t            : 2;
      __IM  uint32_t HOUR       : 5;            /*!< Hours                                                                     */
            uint32_t            : 3;
      __IM  uint32_t DOTW       : 3;            /*!< Day of the week                                                           */
            uint32_t            : 5;
    } RTC_0_b;
  } ;

  union {
    __IOM uint32_t INTR;                        /*!< Raw Interrupts                                                            */

    struct {
      __IM  uint32_t RTC        : 1;            /*!< RTC                                                                       */
            uint32_t            : 31;
    } INTR_b;
  } ;

  union {
    __IOM uint32_t INTE;                        /*!< Interrupt Enable                                                          */

    struct {
      __IOM uint32_t RTC        : 1;            /*!< RTC                                                                       */
            uint32_t            : 31;
    } INTE_b;
  } ;

  union {
    __IOM uint32_t INTF;                        /*!< Interrupt Force                                                           */

    struct {
      __IOM uint32_t RTC        : 1;            /*!< RTC                                                                       */
            uint32_t            : 31;
    } INTF_b;
  } ;

  union {
    __IOM uint32_t INTS;                        /*!< Interrupt status after masking & forcing                                  */

    struct {
      __IM  uint32_t RTC        : 1;            /*!< RTC                                                                       */
            uint32_t            : 31;
    } INTS_b;
  } ;
} RTC_Type;                                     /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           ROSC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ROSC (ROSC)
  */

typedef struct {                                /*!< ROSC Structure                                                            */

  union {
    __IOM uint32_t CTRL;                        /*!< Ring Oscillator control                                                   */

    struct {
      __IOM uint32_t FREQ_RANGE : 12;           /*!< Controls the number of delay stages in the ROSC ring
                                                     LOW uses stages 0 to 7
                                                     MEDIUM uses stages 0 to 5
                                                     HIGH uses stages 0 to 3
                                                     TOOHIGH uses stages 0 to 1 and should not be used because
                                                     its frequency exceeds design specifications
                                                     The clock output will not glitch when changing the range
                                                     up one step at a time
                                                     The clock output will glitch when changing the range down
                                                     Note: the values here are gray coded which is why HIGH
                                                     comes before TOOHIGH                                                      */
      __IOM uint32_t ENABLE     : 12;           /*!< On power-up this field is initialised to ENABLE
                                                     The system clock must be switched to another source before
                                                     setting this field to DISABLE otherwise the chip will lock
                                                     up
                                                     The 12-bit code is intended to give some protection against
                                                     accidental writes. An invalid setting will enable the oscillator.         */
            uint32_t            : 8;
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t FREQA;                       /*!< The FREQA & FREQB registers control the frequency by controlling
                                                     the drive strength of each stage
                                                     The drive strength has 4 levels determined by the number
                                                     of bits set
                                                     Increasing the number of bits set increases the drive strength
                                                     and increases the oscillation frequency
                                                     0 bits set is the default drive strength
                                                     1 bit set doubles the drive strength
                                                     2 bits set triples drive strength
                                                     3 bits set quadruples drive strength                                      */

