mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t DS0        : 3;            /*!< Stage 0 drive strength                                                    */
            uint32_t            : 1;
      __IOM uint32_t DS1        : 3;            /*!< Stage 1 drive strength                                                    */
            uint32_t            : 1;
      __IOM uint32_t DS2        : 3;            /*!< Stage 2 drive strength                                                    */
            uint32_t            : 1;
      __IOM uint32_t DS3        : 3;            /*!< Stage 3 drive strength                                                    */
            uint32_t            : 1;
      __IOM uint32_t PASSWD     : 16;           /*!< Set to 0x9696 to apply the settings
                                                     Any other value in this field will set all drive strengths
                                                     to 0                                                                      */
    } FREQA_b;
  } ;

  union {
    __IOM uint32_t FREQB;                       /*!< For a detailed description see freqa register                             */

    struct {
      __IOM uint32_t DS4        : 3;            /*!< Stage 4 drive strength                                                    */
            uint32_t            : 1;
      __IOM uint32_t DS5        : 3;            /*!< Stage 5 drive strength                                                    */
            uint32_t            : 1;
      __IOM uint32_t DS6        : 3;            /*!< Stage 6 drive strength                                                    */
            uint32_t            : 1;
      __IOM uint32_t DS7        : 3;            /*!< Stage 7 drive strength                                                    */
            uint32_t            : 1;
      __IOM uint32_t PASSWD     : 16;           /*!< Set to 0x9696 to apply the settings
                                                     Any other value in this field will set all drive strengths
                                                     to 0                                                                      */
    } FREQB_b;
  } ;
  __IOM uint32_t  DORMANT;                      /*!< Ring Oscillator pause control
                                                     This is used to save power by pausing the ROSC
                                                     On power-up this field is initialised to WAKE
                                                     An invalid write will also select WAKE
                                                     Warning: setup the irq before selecting dormant mode                      */

  union {
    __IOM uint32_t DIV;                         /*!< Controls the output divider                                               */

    struct {
      __IOM uint32_t DIV        : 12;           /*!< set to 0xaa0 + div where
                                                     div = 0 divides by 32
                                                     div = 1-31 divides by div
                                                     any other value sets div=31
                                                     this register resets to div=16                                            */
            uint32_t            : 20;
    } DIV_b;
  } ;

  union {
    __IOM uint32_t PHASE;                       /*!< Controls the phase shifted output                                         */

    struct {
      __IOM uint32_t SHIFT      : 2;            /*!< phase shift the phase-shifted output by SHIFT input clocks
                                                     this can be changed on-the-fly
                                                     must be set to 0 before setting div=1                                     */
      __IOM uint32_t FLIP       : 1;            /*!< invert the phase-shifted output
                                                     this is ignored when div=1                                                */
      __IOM uint32_t ENABLE     : 1;            /*!< enable the phase-shifted output
                                                     this can be changed on-the-fly                                            */
      __IOM uint32_t PASSWD     : 8;            /*!< set to 0xaa
                                                     any other value enables the output with shift=0                           */
            uint32_t            : 20;
    } PHASE_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< Ring Oscillator Status                                                    */

    struct {
            uint32_t            : 12;
      __IM  uint32_t ENABLED    : 1;            /*!< Oscillator is enabled but not necessarily running and stable
                                                     this resets to 0 but transitions to 1 during chip startup                 */
            uint32_t            : 3;
      __IM  uint32_t DIV_RUNNING : 1;           /*!< post-divider is running
                                                     this resets to 0 but transitions to 1 during chip startup                 */
            uint32_t            : 7;
      __IOM uint32_t BADWRITE   : 1;            /*!< An invalid value has been written to CTRL_ENABLE or CTRL_FREQ_RANGE
                                                     or FREQA or FREQB or DIV or PHASE or DORMANT                              */
            uint32_t            : 6;
      __IM  uint32_t STABLE     : 1;            /*!< Oscillator is running and stable                                          */
    } STATUS_b;
  } ;

  union {
    __IOM uint32_t RANDOMBIT;                   /*!< This just reads the state of the oscillator output so randomness
                                                     is compromised if the ring oscillator is stopped or run
                                                     at a harmonic of the bus frequency                                        */

