mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t RANDOMBIT  : 1;            /*!< RANDOMBIT                                                                 */
            uint32_t            : 31;
    } RANDOMBIT_b;
  } ;

  union {
    __IOM uint32_t COUNT;                       /*!< A down counter running at the ROSC frequency which counts to
                                                     zero and stops.
                                                     To start the counter write a non-zero value.
                                                     Can be used for short software pauses when setting up time
                                                     sensitive hardware.                                                       */

    struct {
      __IOM uint32_t COUNT      : 8;            /*!< COUNT                                                                     */
            uint32_t            : 24;
    } COUNT_b;
  } ;
} ROSC_Type;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                    VREG_AND_CHIP_RESET                                    ================ */
/* =========================================================================================================================== */


/**
  * @brief control and status for on-chip voltage regulator and chip level reset subsystem (VREG_AND_CHIP_RESET)
  */

typedef struct {                                /*!< VREG_AND_CHIP_RESET Structure                                             */

  union {
    __IOM uint32_t VREG;                        /*!< Voltage regulator control and status                                      */

    struct {
      __IOM uint32_t EN         : 1;            /*!< enable
                                                     0=not enabled, 1=enabled                                                  */
      __IOM uint32_t HIZ        : 1;            /*!< high impedance mode select
                                                     0=not in high impedance mode, 1=in high impedance mode                    */
            uint32_t            : 2;
      __IOM uint32_t VSEL       : 4;            /*!< output voltage select
                                                     0000 to 0101 - 0.80V
                                                     0110 - 0.85V
                                                     0111 - 0.90V
                                                     1000 - 0.95V
                                                     1001 - 1.00V
                                                     1010 - 1.05V
                                                     1011 - 1.10V (default)
                                                     1100 - 1.15V
                                                     1101 - 1.20V
                                                     1110 - 1.25V
                                                     1111 - 1.30V                                                              */
            uint32_t            : 4;
      __IM  uint32_t ROK        : 1;            /*!< regulation status
                                                     0=not in regulation, 1=in regulation                                      */
            uint32_t            : 19;
    } VREG_b;
  } ;

  union {
    __IOM uint32_t BOD;                         /*!< brown-out detection control                                               */

    struct {
      __IOM uint32_t EN         : 1;            /*!< enable
                                                     0=not enabled, 1=enabled                                                  */
            uint32_t            : 3;
      __IOM uint32_t VSEL       : 4;            /*!< threshold select
                                                     0000 - 0.473V
                                                     0001 - 0.516V
                                                     0010 - 0.559V
                                                     0011 - 0.602V
                                                     0100 - 0.645V
                                                     0101 - 0.688V
                                                     0110 - 0.731V
                                                     0111 - 0.774V
                                                     1000 - 0.817V
                                                     1001 - 0.860V (default)
                                                     1010 - 0.903V
                                                     1011 - 0.946V
                                                     1100 - 0.989V
                                                     1101 - 1.032V
                                                     1110 - 1.075V
                                                     1111 - 1.118V                                                             */
            uint32_t            : 24;
    } BOD_b;
  } ;

  union {
    __IOM uint32_t CHIP_RESET;                  /*!< Chip reset control and status                                             */

    struct {
            uint32_t            : 8;
      __IM  uint32_t HAD_POR    : 1;            /*!< Last reset was from the power-on reset or brown-out detection
                                                     blocks                                                                    */
            uint32_t            : 7;
      __IM  uint32_t HAD_RUN    : 1;            /*!< Last reset was from the RUN pin                                           */
            uint32_t            : 3;
      __IM  uint32_t HAD_PSM_RESTART : 1;       /*!< Last reset was from the debug port                                        */
            uint32_t            : 3;
      __IOM uint32_t PSM_RESTART_FLAG : 1;      /*!< This is set by psm_restart from the debugger.
                                                     Its purpose is to branch bootcode to a safe mode when the
                                                     debugger has issued a psm_restart in order to recover from
                                                     a boot lock-up.
                                                     In the safe mode the debugger can repair the boot code,
                                                     clear this flag then reboot the processor.                                */
            uint32_t            : 7;
    } CHIP_RESET_b;
  } ;
} VREG_AND_CHIP_RESET_Type;                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           TBMAN                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Testbench manager. Allows the programmer to know what platform their software is running on. (TBMAN)
  */

typedef struct {                                /*!< TBMAN Structure                                                           */

  union {
    __IOM uint32_t PLATFORM;                    /*!< Indicates the type of platform in use                                     */

