mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t ASIC       : 1;            /*!< Indicates the platform is an ASIC                                         */
      __IM  uint32_t FPGA       : 1;            /*!< Indicates the platform is an FPGA                                         */
            uint32_t            : 30;
    } PLATFORM_b;
  } ;
} TBMAN_Type;                                   /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA with separate read and write masters (DMA)
  */

typedef struct {                                /*!< DMA Structure                                                             */
  __IOM uint32_t  CH0_READ_ADDR;                /*!< DMA Channel 0 Read Address pointer
                                                     This register updates automatically each time a read completes.
                                                     The current value is the next address to be read by this
                                                     channel.                                                                  */
  __IOM uint32_t  CH0_WRITE_ADDR;               /*!< DMA Channel 0 Write Address pointer
                                                     This register updates automatically each time a write completes.
                                                     The current value is the next address to be written by
                                                     this channel.                                                             */
  __IOM uint32_t  CH0_TRANS_COUNT;              /*!< DMA Channel 0 Transfer Count
                                                     Program the number of bus transfers a channel will perform
                                                     before halting. Note that, if transfers are larger than
                                                     one byte in size, this is not equal to the number of bytes
                                                     transferred (see CTRL_DATA_SIZE).

                                                     When the channel is active, reading this register shows
                                                     the number of transfers remaining, updating automatically
                                                     each time a write transfer completes.

                                                     Writing this register sets the RELOAD value for the transfer
                                                     counter. Each time this channel is triggered, the RELOAD
                                                     value is copied into the live transfer counter. The channel
                                                     can be started multiple times, and will perform the same
                                                     number of transfers each time, as programmed by most recent
                                                     write.

                                                     The RELOAD value can be observed at CHx_DBG_TCR. If TRANS_COUNT
                                                     is used as a trigger, the written value is used immediately
                                                     as the length of the new transfer sequence, as well as
                                                     being written to RELOAD.                                                  */

  union {
    __IOM uint32_t CH0_CTRL_TRIG;               /*!< DMA Channel 0 Control and Status                                          */

    struct {
      __IOM uint32_t EN         : 1;            /*!< DMA Channel Enable.
                                                     When 1, the channel will respond to triggering events,
                                                     which will cause it to become BUSY and start transferring
                                                     data. When 0, the channel will ignore triggers, stop issuing
                                                     transfers, and pause the current transfer sequence (i.e.
                                                     BUSY will remain high if already high)                                    */
      __IOM uint32_t HIGH_PRIORITY : 1;         /*!< HIGH_PRIORITY gives a channel preferential treatment in issue
                                                     scheduling: in each scheduling round, all high priority
                                                     channels are considered first, and then only a single low
                                                     priority channel, before returning to the high priority
                                                     channels.

                                                     This only affects the order in which the DMA schedules
                                                     channels. The DMA's bus priority is not changed. If the
                                                     DMA is not saturated then a low priority channel will see
                                                     no loss of throughput.                                                    */
      __IOM uint32_t DATA_SIZE  : 2;            /*!< Set the size of each bus transfer (byte/halfword/word). READ_ADDR
                                                     and WRITE_ADDR advance by this amount (1/2/4 bytes) with
                                                     each transfer.                                                            */
      __IOM uint32_t INCR_READ  : 1;            /*!< If 1, the read address increments with each transfer. If 0,
                                                     each read is directed to the same, initial address.

