mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
                                                     Generally this should be disabled for peripheral-to-memory
                                                     transfers.                                                                */
      __IOM uint32_t INCR_WRITE : 1;            /*!< If 1, the write address increments with each transfer. If 0,
                                                     each write is directed to the same, initial address.

                                                     Generally this should be disabled for memory-to-peripheral
                                                     transfers.                                                                */
      __IOM uint32_t RING_SIZE  : 4;            /*!< Size of address wrap region. If 0, don't wrap. For values n
                                                     > 0, only the lower n bits of the address will change.
                                                     This wraps the address on a (1 << n) byte boundary, facilitating
                                                     access to naturally-aligned ring buffers.

                                                     Ring sizes between 2 and 32768 bytes are possible. This
                                                     can apply to either read or write addresses, based on value
                                                     of RING_SEL.                                                              */
      __IOM uint32_t RING_SEL   : 1;            /*!< Select whether RING_SIZE applies to read or write addresses.
                                                     If 0, read addresses are wrapped on a (1 << RING_SIZE)
                                                     boundary. If 1, write addresses are wrapped.                              */
      __IOM uint32_t CHAIN_TO   : 4;            /*!< When this channel completes, it will trigger the channel indicated
                                                     by CHAIN_TO. Disable by setting CHAIN_TO = _(this channel)_.              */
      __IOM uint32_t TREQ_SEL   : 6;            /*!< Select a Transfer Request signal.
                                                     The channel uses the transfer request signal to pace its
                                                     data transfer rate. Sources for TREQ signals are internal
                                                     (TIMERS) or external (DREQ, a Data Request from the system).
                                                     0x0 to 0x3a -> select DREQ n as TREQ                                      */
      __IOM uint32_t IRQ_QUIET  : 1;            /*!< In QUIET mode, the channel does not generate IRQs at the end
                                                     of every transfer block. Instead, an IRQ is raised when
                                                     NULL is written to a trigger register, indicating the end
                                                     of a control block chain.

                                                     This reduces the number of interrupts to be serviced by
                                                     the CPU when transferring a DMA chain of many small control
                                                     blocks.                                                                   */
      __IOM uint32_t BSWAP      : 1;            /*!< Apply byte-swap transformation to DMA data.
                                                     For byte data, this has no effect. For halfword data, the
                                                     two bytes of each halfword are swapped. For word data,
                                                     the four bytes of each word are swapped to reverse order.                 */
      __IOM uint32_t SNIFF_EN   : 1;            /*!< If 1, this channel's data transfers are visible to the sniff
                                                     hardware, and each transfer will advance the state of the
                                                     checksum. This only applies if the sniff hardware is enabled,
                                                     and has this channel selected.

                                                     This allows checksum to be enabled or disabled on a per-control-
                                                     block basis.                                                              */
      __IM  uint32_t BUSY       : 1;            /*!< This flag goes high when the channel starts a new transfer sequence,
                                                     and low when the last transfer of that sequence completes.
                                                     Clearing EN while BUSY is high pauses the channel, and
                                                     BUSY will stay high while paused.

                                                     To terminate a sequence early (and clear the BUSY flag),
                                                     see CHAN_ABORT.                                                           */
            uint32_t            : 4;
      __IOM uint32_t WRITE_ERROR : 1;           /*!< If 1, the channel received a write bus error. Write one to clear.
                                                     WRITE_ADDR shows the approximate address where the bus
                                                     error was encountered (will not be earlier, or more than
                                                     5 transfers later)                                                        */
      __IOM uint32_t READ_ERROR : 1;            /*!< If 1, the channel received a read bus error. Write one to clear.
                                                     READ_ADDR shows the approximate address where the bus error
                                                     was encountered (will not be earlier, or more than 3 transfers
                                                     later)                                                                    */
      __IM  uint32_t AHB_ERROR  : 1;            /*!< Logical OR of the READ_ERROR and WRITE_ERROR flags. The channel
                                                     halts when it encounters any bus error, and always raises
                                                     its channel IRQ flag.                                                     */
    } CH0_CTRL_TRIG_b;
  } ;
  __IOM uint32_t  CH0_AL1_CTRL;                 /*!< Alias for channel 0 CTRL register                                         */
  __IOM uint32_t  CH0_AL1_READ_ADDR;            /*!< Alias for channel 0 READ_ADDR register                                    */
  __IOM uint32_t  CH0_AL1_WRITE_ADDR;           /*!< Alias for channel 0 WRITE_ADDR register                                   */
  __IOM uint32_t  CH0_AL1_TRANS_COUNT_TRIG;     /*!< Alias for channel 0 TRANS_COUNT register
                                                     This is a trigger register (0xc). Writing a nonzero value
                                                     will
                                                     reload the channel counter and start the channel.                         */
  __IOM uint32_t  CH0_AL2_CTRL;                 /*!< Alias for channel 0 CTRL register                                         */
  __IOM uint32_t  CH0_AL2_TRANS_COUNT;          /*!< Alias for channel 0 TRANS_COUNT register                                  */
  __IOM uint32_t  CH0_AL2_READ_ADDR;            /*!< Alias for channel 0 READ_ADDR register                                    */
  __IOM uint32_t  CH0_AL2_WRITE_ADDR_TRIG;      /*!< Alias for channel 0 WRITE_ADDR register
                                                     This is a trigger register (0xc). Writing a nonzero value
                                                     will
                                                     reload the channel counter and start the channel.                         */
  __IOM uint32_t  CH0_AL3_CTRL;                 /*!< Alias for channel 0 CTRL register                                         */
  __IOM uint32_t  CH0_AL3_WRITE_ADDR;           /*!< Alias for channel 0 WRITE_ADDR register                                   */
  __IOM uint32_t  CH0_AL3_TRANS_COUNT;          /*!< Alias for channel 0 TRANS_COUNT register                                  */
  __IOM uint32_t  CH0_AL3_READ_ADDR_TRIG;       /*!< Alias for channel 0 READ_ADDR register
                                                     This is a trigger register (0xc). Writing a nonzero value
                                                     will
                                                     reload the channel counter and start the channel.                         */
  __IOM uint32_t  CH1_READ_ADDR;                /*!< DMA Channel 1 Read Address pointer
                                                     This register updates automatically each time a read completes.
                                                     The current value is the next address to be read by this
                                                     channel.                                                                  */
  __IOM uint32_t  CH1_WRITE_ADDR;               /*!< DMA Channel 1 Write Address pointer
                                                     This register updates automatically each time a write completes.
                                                     The current value is the next address to be written by
                                                     this channel.                                                             */
  __IOM uint32_t  CH1_TRANS_COUNT;              /*!< DMA Channel 1 Transfer Count
                                                     Program the number of bus transfers a channel will perform
                                                     before halting. Note that, if transfers are larger than
                                                     one byte in size, this is not equal to the number of bytes
                                                     transferred (see CTRL_DATA_SIZE).

