mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t INTR       : 16;           /*!< Raw interrupt status for DMA Channels 0..15. Bit n corresponds
                                                     to channel n. Ignores any masking or forcing. Channel interrupts
                                                     can be cleared by writing a bit mask to INTR, INTS0 or
                                                     INTS1.

                                                     Channel interrupts can be routed to either of two system-level
                                                     IRQs based on INTE0 and INTE1.

                                                     This can be used vector different channel interrupts to
                                                     different ISRs: this might be done to allow NVIC IRQ preemption
                                                     for more time-critical channels, or to spread IRQ load
                                                     across different cores.

                                                     It is also valid to ignore this behaviour and just use
                                                     INTE0/INTS0/IRQ 0.                                                        */
            uint32_t            : 16;
    } INTR_b;
  } ;

  union {
    __IOM uint32_t INTE0;                       /*!< Interrupt Enables for IRQ 0                                               */

    struct {
      __IOM uint32_t INTE0      : 16;           /*!< Set bit n to pass interrupts from channel n to DMA IRQ 0.                 */
            uint32_t            : 16;
    } INTE0_b;
  } ;

  union {
    __IOM uint32_t INTF0;                       /*!< Force Interrupts                                                          */

    struct {
      __IOM uint32_t INTF0      : 16;           /*!< Write 1s to force the corresponding bits in INTE0. The interrupt
                                                     remains asserted until INTF0 is cleared.                                  */
            uint32_t            : 16;
    } INTF0_b;
  } ;

  union {
    __IOM uint32_t INTS0;                       /*!< Interrupt Status for IRQ 0                                                */

    struct {
      __IOM uint32_t INTS0      : 16;           /*!< Indicates active channel interrupt requests which are currently
                                                     causing IRQ 0 to be asserted.
                                                     Channel interrupts can be cleared by writing a bit mask
                                                     here.                                                                     */
            uint32_t            : 16;
    } INTS0_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t INTE1;                       /*!< Interrupt Enables for IRQ 1                                               */

    struct {
      __IOM uint32_t INTE1      : 16;           /*!< Set bit n to pass interrupts from channel n to DMA IRQ 1.                 */
            uint32_t            : 16;
    } INTE1_b;
  } ;

  union {
    __IOM uint32_t INTF1;                       /*!< Force Interrupts for IRQ 1                                                */

    struct {
      __IOM uint32_t INTF1      : 16;           /*!< Write 1s to force the corresponding bits in INTE0. The interrupt
                                                     remains asserted until INTF0 is cleared.                                  */
            uint32_t            : 16;
    } INTF1_b;
  } ;

  union {
    __IOM uint32_t INTS1;                       /*!< Interrupt Status (masked) for IRQ 1                                       */

    struct {
      __IOM uint32_t INTS1      : 16;           /*!< Indicates active channel interrupt requests which are currently
                                                     causing IRQ 1 to be asserted.
                                                     Channel interrupts can be cleared by writing a bit mask
                                                     here.                                                                     */
            uint32_t            : 16;
    } INTS1_b;
  } ;

  union {
    __IOM uint32_t TIMER0;                      /*!< Pacing (X/Y) Fractional Timer
                                                     The pacing timer produces TREQ assertions at a rate set
                                                     by ((X/Y) * sys_clk). This equation is evaluated every
                                                     sys_clk cycles and therefore can only generate TREQs at
                                                     a rate of 1 per sys_clk (i.e. permanent TREQ) or less.                    */

    struct {
      __IOM uint32_t Y          : 16;           /*!< Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional
                                                     timer.                                                                    */
      __IOM uint32_t X          : 16;           /*!< Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional
                                                     timer.                                                                    */
    } TIMER0_b;
  } ;

  union {
    __IOM uint32_t TIMER1;                      /*!< Pacing (X/Y) Fractional Timer
                                                     The pacing timer produces TREQ assertions at a rate set
                                                     by ((X/Y) * sys_clk). This equation is evaluated every
                                                     sys_clk cycles and therefore can only generate TREQs at
                                                     a rate of 1 per sys_clk (i.e. permanent TREQ) or less.                    */

    struct {
      __IOM uint32_t Y          : 16;           /*!< Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional
                                                     timer.                                                                    */
      __IOM uint32_t X          : 16;           /*!< Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional
                                                     timer.                                                                    */
    } TIMER1_b;
  } ;

  union {
    __IOM uint32_t TIMER2;                      /*!< Pacing (X/Y) Fractional Timer
                                                     The pacing timer produces TREQ assertions at a rate set
                                                     by ((X/Y) * sys_clk). This equation is evaluated every
                                                     sys_clk cycles and therefore can only generate TREQs at
                                                     a rate of 1 per sys_clk (i.e. permanent TREQ) or less.                    */

