mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t Y          : 16;           /*!< Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional
                                                     timer.                                                                    */
      __IOM uint32_t X          : 16;           /*!< Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional
                                                     timer.                                                                    */
    } TIMER2_b;
  } ;

  union {
    __IOM uint32_t TIMER3;                      /*!< Pacing (X/Y) Fractional Timer
                                                     The pacing timer produces TREQ assertions at a rate set
                                                     by ((X/Y) * sys_clk). This equation is evaluated every
                                                     sys_clk cycles and therefore can only generate TREQs at
                                                     a rate of 1 per sys_clk (i.e. permanent TREQ) or less.                    */

    struct {
      __IOM uint32_t Y          : 16;           /*!< Pacing Timer Divisor. Specifies the Y value for the (X/Y) fractional
                                                     timer.                                                                    */
      __IOM uint32_t X          : 16;           /*!< Pacing Timer Dividend. Specifies the X value for the (X/Y) fractional
                                                     timer.                                                                    */
    } TIMER3_b;
  } ;

  union {
    __IOM uint32_t MULTI_CHAN_TRIGGER;          /*!< Trigger one or more channels simultaneously                               */

    struct {
      __IOM uint32_t MULTI_CHAN_TRIGGER : 16;   /*!< Each bit in this register corresponds to a DMA channel. Writing
                                                     a 1 to the relevant bit is the same as writing to that
                                                     channel's trigger register; the channel will start if it
                                                     is currently enabled and not already busy.                                */
            uint32_t            : 16;
    } MULTI_CHAN_TRIGGER_b;
  } ;

  union {
    __IOM uint32_t SNIFF_CTRL;                  /*!< Sniffer Control                                                           */

    struct {
      __IOM uint32_t EN         : 1;            /*!< Enable sniffer                                                            */
      __IOM uint32_t DMACH      : 4;            /*!< DMA channel for Sniffer to observe                                        */
      __IOM uint32_t CALC       : 4;            /*!< CALC                                                                      */
      __IOM uint32_t BSWAP      : 1;            /*!< Locally perform a byte reverse on the sniffed data, before feeding
                                                     into checksum.

                                                     Note that the sniff hardware is downstream of the DMA channel
                                                     byteswap performed in the read master: if channel CTRL_BSWAP
                                                     and SNIFF_CTRL_BSWAP are both enabled, their effects cancel
                                                     from the sniffer's point of view.                                         */
      __IOM uint32_t OUT_REV    : 1;            /*!< If set, the result appears bit-reversed when read. This does
                                                     not affect the way the checksum is calculated; the result
                                                     is transformed on-the-fly between the result register and
                                                     the bus.                                                                  */
      __IOM uint32_t OUT_INV    : 1;            /*!< If set, the result appears inverted (bitwise complement) when
                                                     read. This does not affect the way the checksum is calculated;
                                                     the result is transformed on-the-fly between the result
                                                     register and the bus.                                                     */
            uint32_t            : 20;
    } SNIFF_CTRL_b;
  } ;
  __IOM uint32_t  SNIFF_DATA;                   /*!< Data accumulator for sniff hardware
                                                     Write an initial seed value here before starting a DMA
                                                     transfer on the channel indicated by SNIFF_CTRL_DMACH.
                                                     The hardware will update this register each time it observes
                                                     a read from the indicated channel. Once the channel completes,
                                                     the final result can be read from this register.                          */
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t FIFO_LEVELS;                 /*!< Debug RAF, WAF, TDF levels                                                */

    struct {
      __IM  uint32_t TDF_LVL    : 8;            /*!< Current Transfer-Data-FIFO fill level                                     */
      __IM  uint32_t WAF_LVL    : 8;            /*!< Current Write-Address-FIFO fill level                                     */
      __IM  uint32_t RAF_LVL    : 8;            /*!< Current Read-Address-FIFO fill level                                      */
            uint32_t            : 8;
    } FIFO_LEVELS_b;
  } ;

  union {
    __IOM uint32_t CHAN_ABORT;                  /*!< Abort an in-progress transfer sequence on one or more channels            */

    struct {
      __IOM uint32_t CHAN_ABORT : 16;           /*!< Each bit corresponds to a channel. Writing a 1 aborts whatever
                                                     transfer sequence is in progress on that channel. The bit
                                                     will remain high until any in-flight transfers have been
                                                     flushed through the address and data FIFOs.

                                                     After writing, this register must be polled until it returns
                                                     all-zero. Until this point, it is unsafe to restart the
                                                     channel.                                                                  */
            uint32_t            : 16;
    } CHAN_ABORT_b;
  } ;

  union {
    __IOM uint32_t N_CHANNELS;                  /*!< The number of channels this DMA instance is equipped with. This
                                                     DMA supports up to 16 hardware channels, but can be configured
                                                     with as few as one, to minimise silicon area.                             */

