mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t N_CHANNELS : 5;            /*!< N_CHANNELS                                                                */
            uint32_t            : 27;
    } N_CHANNELS_b;
  } ;
  __IM  uint32_t  RESERVED3[237];

  union {
    __IOM uint32_t CH0_DBG_CTDREQ;              /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

    struct {
      __IOM uint32_t CH0_DBG_CTDREQ : 6;        /*!< CH0_DBG_CTDREQ                                                            */
            uint32_t            : 26;
    } CH0_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH0_DBG_TCR;                  /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
  __IM  uint32_t  RESERVED4[14];

  union {
    __IOM uint32_t CH1_DBG_CTDREQ;              /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

    struct {
      __IOM uint32_t CH1_DBG_CTDREQ : 6;        /*!< CH1_DBG_CTDREQ                                                            */
            uint32_t            : 26;
    } CH1_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH1_DBG_TCR;                  /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
  __IM  uint32_t  RESERVED5[14];

  union {
    __IOM uint32_t CH2_DBG_CTDREQ;              /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

    struct {
      __IOM uint32_t CH2_DBG_CTDREQ : 6;        /*!< CH2_DBG_CTDREQ                                                            */
            uint32_t            : 26;
    } CH2_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH2_DBG_TCR;                  /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
  __IM  uint32_t  RESERVED6[14];

  union {
    __IOM uint32_t CH3_DBG_CTDREQ;              /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

    struct {
      __IOM uint32_t CH3_DBG_CTDREQ : 6;        /*!< CH3_DBG_CTDREQ                                                            */
            uint32_t            : 26;
    } CH3_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH3_DBG_TCR;                  /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
  __IM  uint32_t  RESERVED7[14];

  union {
    __IOM uint32_t CH4_DBG_CTDREQ;              /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

    struct {
      __IOM uint32_t CH4_DBG_CTDREQ : 6;        /*!< CH4_DBG_CTDREQ                                                            */
            uint32_t            : 26;
    } CH4_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH4_DBG_TCR;                  /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
  __IM  uint32_t  RESERVED8[14];

  union {
    __IOM uint32_t CH5_DBG_CTDREQ;              /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

    struct {
      __IOM uint32_t CH5_DBG_CTDREQ : 6;        /*!< CH5_DBG_CTDREQ                                                            */
            uint32_t            : 26;
    } CH5_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH5_DBG_TCR;                  /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
  __IM  uint32_t  RESERVED9[14];

  union {
    __IOM uint32_t CH6_DBG_CTDREQ;              /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

