mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t CH6_DBG_CTDREQ : 6;        /*!< CH6_DBG_CTDREQ                                                            */
            uint32_t            : 26;
    } CH6_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH6_DBG_TCR;                  /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
  __IM  uint32_t  RESERVED10[14];

  union {
    __IOM uint32_t CH7_DBG_CTDREQ;              /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

    struct {
      __IOM uint32_t CH7_DBG_CTDREQ : 6;        /*!< CH7_DBG_CTDREQ                                                            */
            uint32_t            : 26;
    } CH7_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH7_DBG_TCR;                  /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
  __IM  uint32_t  RESERVED11[14];

  union {
    __IOM uint32_t CH8_DBG_CTDREQ;              /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

    struct {
      __IOM uint32_t CH8_DBG_CTDREQ : 6;        /*!< CH8_DBG_CTDREQ                                                            */
            uint32_t            : 26;
    } CH8_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH8_DBG_TCR;                  /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
  __IM  uint32_t  RESERVED12[14];

  union {
    __IOM uint32_t CH9_DBG_CTDREQ;              /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

    struct {
      __IOM uint32_t CH9_DBG_CTDREQ : 6;        /*!< CH9_DBG_CTDREQ                                                            */
            uint32_t            : 26;
    } CH9_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH9_DBG_TCR;                  /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
  __IM  uint32_t  RESERVED13[14];

  union {
    __IOM uint32_t CH10_DBG_CTDREQ;             /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

    struct {
      __IOM uint32_t CH10_DBG_CTDREQ : 6;       /*!< CH10_DBG_CTDREQ                                                           */
            uint32_t            : 26;
    } CH10_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH10_DBG_TCR;                 /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
  __IM  uint32_t  RESERVED14[14];

  union {
    __IOM uint32_t CH11_DBG_CTDREQ;             /*!< Read: get channel DREQ counter (i.e. how many accesses the DMA
                                                     expects it can perform on the peripheral without overflow/underflow.
                                                     Write any value: clears the counter, and cause channel
                                                     to re-initiate DREQ handshake.                                            */

    struct {
      __IOM uint32_t CH11_DBG_CTDREQ : 6;       /*!< CH11_DBG_CTDREQ                                                           */
            uint32_t            : 26;
    } CH11_DBG_CTDREQ_b;
  } ;
  __IM  uint32_t  CH11_DBG_TCR;                 /*!< Read to get channel TRANS_COUNT reload value, i.e. the length
                                                     of the next transfer                                                      */
} DMA_Type;                                     /*!< Size = 2760 (0xac8)                                                       */



/* =========================================================================================================================== */
/* ================                                       USBCTRL_DPRAM                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief DPRAM layout for USB device. (USBCTRL_DPRAM)
  */

typedef struct {                                /*!< USBCTRL_DPRAM Structure                                                   */

  union {
    __IOM uint32_t SETUP_PACKET_LOW;            /*!< Bytes 0-3 of the SETUP packet from the host.                              */

