mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t BUFFER_ADDRESS : 16;       /*!< 64 byte aligned buffer address for this EP (bits 0-5 are ignored).
                                                     Relative to the start of the DPRAM.                                       */
      __IOM uint32_t INTERRUPT_ON_NAK : 1;      /*!< Trigger an interrupt if a NAK is sent. Intended for debug only.           */
      __IOM uint32_t INTERRUPT_ON_STALL : 1;    /*!< Trigger an interrupt if a STALL is sent. Intended for debug
                                                     only.                                                                     */
            uint32_t            : 8;
      __IOM uint32_t ENDPOINT_TYPE : 2;         /*!< ENDPOINT_TYPE                                                             */
      __IOM uint32_t INTERRUPT_PER_DOUBLE_BUFF : 1;/*!< Trigger an interrupt each time both buffers are done. Only valid
                                                     in double buffered mode.                                                  */
      __IOM uint32_t INTERRUPT_PER_BUFF : 1;    /*!< Trigger an interrupt each time a buffer is done.                          */
      __IOM uint32_t DOUBLE_BUFFERED : 1;       /*!< This endpoint is double buffered.                                         */
      __IOM uint32_t ENABLE     : 1;            /*!< Enable this endpoint. The device will not reply to any packets
                                                     for this endpoint if this bit is not set.                                 */
    } EP2_OUT_CONTROL_b;
  } ;

  union {
    __IOM uint32_t EP3_IN_CONTROL;              /*!< EP3_IN_CONTROL                                                            */

    struct {
      __IOM uint32_t BUFFER_ADDRESS : 16;       /*!< 64 byte aligned buffer address for this EP (bits 0-5 are ignored).
                                                     Relative to the start of the DPRAM.                                       */
      __IOM uint32_t INTERRUPT_ON_NAK : 1;      /*!< Trigger an interrupt if a NAK is sent. Intended for debug only.           */
      __IOM uint32_t INTERRUPT_ON_STALL : 1;    /*!< Trigger an interrupt if a STALL is sent. Intended for debug
                                                     only.                                                                     */
            uint32_t            : 8;
      __IOM uint32_t ENDPOINT_TYPE : 2;         /*!< ENDPOINT_TYPE                                                             */
      __IOM uint32_t INTERRUPT_PER_DOUBLE_BUFF : 1;/*!< Trigger an interrupt each time both buffers are done. Only valid
                                                     in double buffered mode.                                                  */
      __IOM uint32_t INTERRUPT_PER_BUFF : 1;    /*!< Trigger an interrupt each time a buffer is done.                          */
      __IOM uint32_t DOUBLE_BUFFERED : 1;       /*!< This endpoint is double buffered.                                         */
      __IOM uint32_t ENABLE     : 1;            /*!< Enable this endpoint. The device will not reply to any packets
                                                     for this endpoint if this bit is not set.                                 */
    } EP3_IN_CONTROL_b;
  } ;

  union {
    __IOM uint32_t EP3_OUT_CONTROL;             /*!< EP3_OUT_CONTROL                                                           */

    struct {
      __IOM uint32_t BUFFER_ADDRESS : 16;       /*!< 64 byte aligned buffer address for this EP (bits 0-5 are ignored).
                                                     Relative to the start of the DPRAM.                                       */
      __IOM uint32_t INTERRUPT_ON_NAK : 1;      /*!< Trigger an interrupt if a NAK is sent. Intended for debug only.           */
      __IOM uint32_t INTERRUPT_ON_STALL : 1;    /*!< Trigger an interrupt if a STALL is sent. Intended for debug
                                                     only.                                                                     */
            uint32_t            : 8;
      __IOM uint32_t ENDPOINT_TYPE : 2;         /*!< ENDPOINT_TYPE                                                             */
      __IOM uint32_t INTERRUPT_PER_DOUBLE_BUFF : 1;/*!< Trigger an interrupt each time both buffers are done. Only valid
                                                     in double buffered mode.                                                  */
      __IOM uint32_t INTERRUPT_PER_BUFF : 1;    /*!< Trigger an interrupt each time a buffer is done.                          */
      __IOM uint32_t DOUBLE_BUFFERED : 1;       /*!< This endpoint is double buffered.                                         */
      __IOM uint32_t ENABLE     : 1;            /*!< Enable this endpoint. The device will not reply to any packets
                                                     for this endpoint if this bit is not set.                                 */
    } EP3_OUT_CONTROL_b;
  } ;

  union {
    __IOM uint32_t EP4_IN_CONTROL;              /*!< EP4_IN_CONTROL                                                            */

    struct {
      __IOM uint32_t BUFFER_ADDRESS : 16;       /*!< 64 byte aligned buffer address for this EP (bits 0-5 are ignored).
                                                     Relative to the start of the DPRAM.                                       */
      __IOM uint32_t INTERRUPT_ON_NAK : 1;      /*!< Trigger an interrupt if a NAK is sent. Intended for debug only.           */
      __IOM uint32_t INTERRUPT_ON_STALL : 1;    /*!< Trigger an interrupt if a STALL is sent. Intended for debug
                                                     only.                                                                     */
            uint32_t            : 8;
      __IOM uint32_t ENDPOINT_TYPE : 2;         /*!< ENDPOINT_TYPE                                                             */
      __IOM uint32_t INTERRUPT_PER_DOUBLE_BUFF : 1;/*!< Trigger an interrupt each time both buffers are done. Only valid
                                                     in double buffered mode.                                                  */
      __IOM uint32_t INTERRUPT_PER_BUFF : 1;    /*!< Trigger an interrupt each time a buffer is done.                          */
      __IOM uint32_t DOUBLE_BUFFERED : 1;       /*!< This endpoint is double buffered.                                         */
      __IOM uint32_t ENABLE     : 1;            /*!< Enable this endpoint. The device will not reply to any packets
                                                     for this endpoint if this bit is not set.                                 */
    } EP4_IN_CONTROL_b;
  } ;

  union {
    __IOM uint32_t EP4_OUT_CONTROL;             /*!< EP4_OUT_CONTROL                                                           */

