mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t LENGTH_0   : 10;           /*!< The length of the data in buffer 0.                                       */
      __IOM uint32_t AVAILABLE_0 : 1;           /*!< Buffer 0 is available. This bit is set to indicate the buffer
                                                     can be used by the controller. The controller clears the
                                                     available bit when writing the status back.                               */
      __IOM uint32_t STALL      : 1;            /*!< Reply with a stall (valid for both buffers).                              */
      __IOM uint32_t RESET      : 1;            /*!< Reset the buffer selector to buffer 0.                                    */
      __IOM uint32_t PID_0      : 1;            /*!< The data pid of buffer 0.                                                 */
      __IOM uint32_t LAST_0     : 1;            /*!< Buffer 0 is the last buffer of the transfer.                              */
      __IOM uint32_t FULL_0     : 1;            /*!< Buffer 0 is full. For an IN transfer (TX to the host) the bit
                                                     is set to indicate the data is valid. For an OUT transfer
                                                     (RX from the host) this bit should be left as a 0. The
                                                     host will set it when it has filled the buffer with data.                 */
      __IOM uint32_t LENGTH_1   : 10;           /*!< The length of the data in buffer 1.                                       */
      __IOM uint32_t AVAILABLE_1 : 1;           /*!< Buffer 1 is available. This bit is set to indicate the buffer
                                                     can be used by the controller. The controller clears the
                                                     available bit when writing the status back.                               */
      __IOM uint32_t DOUBLE_BUFFER_ISO_OFFSET : 2;/*!< The number of bytes buffer 1 is offset from buffer 0 in Isochronous
                                                     mode. Only valid in double buffered mode for an Isochronous
                                                     endpoint.
                                                     For a non Isochronous endpoint the offset is always 64
                                                     bytes.                                                                    */
      __IOM uint32_t PID_1      : 1;            /*!< The data pid of buffer 1.                                                 */
      __IOM uint32_t LAST_1     : 1;            /*!< Buffer 1 is the last buffer of the transfer.                              */
      __IOM uint32_t FULL_1     : 1;            /*!< Buffer 1 is full. For an IN transfer (TX to the host) the bit
                                                     is set to indicate the data is valid. For an OUT transfer
                                                     (RX from the host) this bit should be left as a 0. The
                                                     host will set it when it has filled the buffer with data.                 */
    } EP15_OUT_BUFFER_CONTROL_b;
  } ;
} USBCTRL_DPRAM_Type;                           /*!< Size = 256 (0x100)                                                        */



/* =========================================================================================================================== */
/* ================                                       USBCTRL_REGS                                        ================ */
/* =========================================================================================================================== */


/**
  * @brief USB FS/LS controller device registers (USBCTRL_REGS)
  */

typedef struct {                                /*!< USBCTRL_REGS Structure                                                    */

  union {
    __IOM uint32_t ADDR_ENDP;                   /*!< Device address and endpoint control                                       */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< In device mode, the address that the device should respond to.
                                                     Set in response to a SET_ADDR setup packet from the host.
                                                     In host mode set to the address of the device to communicate
                                                     with.                                                                     */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Device endpoint to send data to. Only valid for HOST mode.                */
            uint32_t            : 12;
    } ADDR_ENDP_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP1;                  /*!< Interrupt endpoint 1. Only valid for HOST mode.                           */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP1_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP2;                  /*!< Interrupt endpoint 2. Only valid for HOST mode.                           */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP2_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP3;                  /*!< Interrupt endpoint 3. Only valid for HOST mode.                           */

