mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP3_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP4;                  /*!< Interrupt endpoint 4. Only valid for HOST mode.                           */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP4_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP5;                  /*!< Interrupt endpoint 5. Only valid for HOST mode.                           */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP5_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP6;                  /*!< Interrupt endpoint 6. Only valid for HOST mode.                           */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP6_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP7;                  /*!< Interrupt endpoint 7. Only valid for HOST mode.                           */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP7_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP8;                  /*!< Interrupt endpoint 8. Only valid for HOST mode.                           */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP8_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP9;                  /*!< Interrupt endpoint 9. Only valid for HOST mode.                           */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP9_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP10;                 /*!< Interrupt endpoint 10. Only valid for HOST mode.                          */

