mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP10_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP11;                 /*!< Interrupt endpoint 11. Only valid for HOST mode.                          */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP11_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP12;                 /*!< Interrupt endpoint 12. Only valid for HOST mode.                          */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP12_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP13;                 /*!< Interrupt endpoint 13. Only valid for HOST mode.                          */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP13_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP14;                 /*!< Interrupt endpoint 14. Only valid for HOST mode.                          */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP14_b;
  } ;

  union {
    __IOM uint32_t ADDR_ENDP15;                 /*!< Interrupt endpoint 15. Only valid for HOST mode.                          */

    struct {
      __IOM uint32_t ADDRESS    : 7;            /*!< Device address                                                            */
            uint32_t            : 9;
      __IOM uint32_t ENDPOINT   : 4;            /*!< Endpoint number of the interrupt endpoint                                 */
            uint32_t            : 5;
      __IOM uint32_t INTEP_DIR  : 1;            /*!< Direction of the interrupt endpoint. In=0, Out=1                          */
      __IOM uint32_t INTEP_PREAMBLE : 1;        /*!< Interrupt EP requires preamble (is a low speed device on a full
                                                     speed hub)                                                                */
            uint32_t            : 5;
    } ADDR_ENDP15_b;
  } ;

  union {
    __IOM uint32_t MAIN_CTRL;                   /*!< Main control register                                                     */

    struct {
      __IOM uint32_t CONTROLLER_EN : 1;         /*!< Enable controller                                                         */
      __IOM uint32_t HOST_NDEVICE : 1;          /*!< Device mode = 0, Host mode = 1                                            */
            uint32_t            : 29;
      __IOM uint32_t SIM_TIMING : 1;            /*!< Reduced timings for simulation                                            */
    } MAIN_CTRL_b;
  } ;

  union {
    __IOM uint32_t SOF_WR;                      /*!< Set the SOF (Start of Frame) frame number in the host controller.
                                                     The SOF packet is sent every 1ms and the host will increment
                                                     the frame number by 1 each time.                                          */

