mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __OM  uint32_t COUNT      : 11;           /*!< COUNT                                                                     */
            uint32_t            : 21;
    } SOF_WR_b;
  } ;

  union {
    __IOM uint32_t SOF_RD;                      /*!< Read the last SOF (Start of Frame) frame number seen. In device
                                                     mode the last SOF received from the host. In host mode
                                                     the last SOF sent by the host.                                            */

    struct {
      __IM  uint32_t COUNT      : 11;           /*!< COUNT                                                                     */
            uint32_t            : 21;
    } SOF_RD_b;
  } ;

  union {
    __IOM uint32_t SIE_CTRL;                    /*!< SIE control register                                                      */

    struct {
      __IOM uint32_t START_TRANS : 1;           /*!< Host: Start transaction                                                   */
      __IOM uint32_t SEND_SETUP : 1;            /*!< Host: Send Setup packet                                                   */
      __IOM uint32_t SEND_DATA  : 1;            /*!< Host: Send transaction (OUT from host)                                    */
      __IOM uint32_t RECEIVE_DATA : 1;          /*!< Host: Receive transaction (IN to host)                                    */
      __IOM uint32_t STOP_TRANS : 1;            /*!< Host: Stop transaction                                                    */
            uint32_t            : 1;
      __IOM uint32_t PREAMBLE_EN : 1;           /*!< Host: Preable enable for LS device on FS hub                              */
            uint32_t            : 1;
      __IOM uint32_t SOF_SYNC   : 1;            /*!< Host: Delay packet(s) until after SOF                                     */
      __IOM uint32_t SOF_EN     : 1;            /*!< Host: Enable SOF generation (for full speed bus)                          */
      __IOM uint32_t KEEP_ALIVE_EN : 1;         /*!< Host: Enable keep alive packet (for low speed bus)                        */
      __IOM uint32_t VBUS_EN    : 1;            /*!< Host: Enable VBUS                                                         */
      __IOM uint32_t RESUME     : 1;            /*!< Device: Remote wakeup. Device can initiate its own resume after
                                                     suspend.                                                                  */
      __IOM uint32_t RESET_BUS  : 1;            /*!< Host: Reset bus                                                           */
            uint32_t            : 1;
      __IOM uint32_t PULLDOWN_EN : 1;           /*!< Host: Enable pull down resistors                                          */
      __IOM uint32_t PULLUP_EN  : 1;            /*!< Device: Enable pull up resistor                                           */
      __IOM uint32_t RPU_OPT    : 1;            /*!< Device: Pull-up strength (0=1K2, 1=2k3)                                   */
      __IOM uint32_t TRANSCEIVER_PD : 1;        /*!< Power down bus transceiver                                                */
            uint32_t            : 5;
      __IOM uint32_t DIRECT_DM  : 1;            /*!< Direct control of DM                                                      */
      __IOM uint32_t DIRECT_DP  : 1;            /*!< Direct control of DP                                                      */
      __IOM uint32_t DIRECT_EN  : 1;            /*!< Direct bus drive enable                                                   */
      __IOM uint32_t EP0_INT_NAK : 1;           /*!< Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a NAK               */
      __IOM uint32_t EP0_INT_2BUF : 1;          /*!< Device: Set bit in BUFF_STATUS for every 2 buffers completed
                                                     on EP0                                                                    */
      __IOM uint32_t EP0_INT_1BUF : 1;          /*!< Device: Set bit in BUFF_STATUS for every buffer completed on
                                                     EP0                                                                       */
      __IOM uint32_t EP0_DOUBLE_BUF : 1;        /*!< Device: EP0 single buffered = 0, double buffered = 1                      */
      __IOM uint32_t EP0_INT_STALL : 1;         /*!< Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a STALL             */
    } SIE_CTRL_b;
  } ;

  union {
    __IOM uint32_t SIE_STATUS;                  /*!< SIE status register                                                       */

    struct {
      __IM  uint32_t VBUS_DETECTED : 1;         /*!< Device: VBUS Detected                                                     */
            uint32_t            : 1;
      __IM  uint32_t LINE_STATE : 2;            /*!< USB bus line state                                                        */
      __IOM uint32_t SUSPENDED  : 1;            /*!< Bus in suspended state. Valid for device and host. Host and
                                                     device will go into suspend if neither Keep Alive / SOF
                                                     frames are enabled.                                                       */
            uint32_t            : 3;
      __IOM uint32_t SPEED      : 2;            /*!< Host: device speed. Disconnected = 00, LS = 01, FS = 10                   */
      __IM  uint32_t VBUS_OVER_CURR : 1;        /*!< VBUS over current detected                                                */
      __IOM uint32_t RESUME     : 1;            /*!< Host: Device has initiated a remote resume. Device: host has
                                                     initiated a resume.                                                       */
            uint32_t            : 4;
      __IOM uint32_t CONNECTED  : 1;            /*!< Device: connected                                                         */
      __IOM uint32_t SETUP_REC  : 1;            /*!< Device: Setup packet received                                             */
      __IOM uint32_t TRANS_COMPLETE : 1;        /*!< Transaction complete.

                                                     Raised by device if:

                                                     * An IN or OUT packet is sent with the `LAST_BUFF` bit
                                                     set in the buffer control register

                                                     Raised by host if:

