mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
                                                     * A setup packet is sent when no data in or data out transaction
                                                     follows * An IN packet is received and the `LAST_BUFF`
                                                     bit is set in the buffer control register * An IN packet
                                                     is received with zero length * An OUT packet is sent and
                                                     the `LAST_BUFF` bit is set                                                */
      __IOM uint32_t BUS_RESET  : 1;            /*!< Device: bus reset received                                                */
            uint32_t            : 4;
      __IOM uint32_t CRC_ERROR  : 1;            /*!< CRC Error. Raised by the Serial RX engine.                                */
      __IOM uint32_t BIT_STUFF_ERROR : 1;       /*!< Bit Stuff Error. Raised by the Serial RX engine.                          */
      __IOM uint32_t RX_OVERFLOW : 1;           /*!< RX overflow is raised by the Serial RX engine if the incoming
                                                     data is too fast.                                                         */
      __IOM uint32_t RX_TIMEOUT : 1;            /*!< RX timeout is raised by both the host and device if an ACK is
                                                     not received in the maximum time specified by the USB spec.               */
      __IOM uint32_t NAK_REC    : 1;            /*!< Host: NAK received                                                        */
      __IOM uint32_t STALL_REC  : 1;            /*!< Host: STALL received                                                      */
      __IOM uint32_t ACK_REC    : 1;            /*!< ACK received. Raised by both host and device.                             */
      __IOM uint32_t DATA_SEQ_ERROR : 1;        /*!< Data Sequence Error.

                                                     The device can raise a sequence error in the following
                                                     conditions:

                                                     * A SETUP packet is received followed by a DATA1 packet
                                                     (data phase should always be DATA0) * An OUT packet is
                                                     received from the host but doesn't match the data pid in
                                                     the buffer control register read from DPSRAM

                                                     The host can raise a data sequence error in the following
                                                     conditions:

                                                     * An IN packet from the device has the wrong data PID                     */
    } SIE_STATUS_b;
  } ;

  union {
    __IOM uint32_t INT_EP_CTRL;                 /*!< interrupt endpoint control register                                       */

    struct {
            uint32_t            : 1;
      __IOM uint32_t INT_EP_ACTIVE : 15;        /*!< Host: Enable interrupt endpoint 1 -> 15                                   */
            uint32_t            : 16;
    } INT_EP_CTRL_b;
  } ;

  union {
    __IOM uint32_t BUFF_STATUS;                 /*!< Buffer status register. A bit set here indicates that a buffer
                                                     has completed on the endpoint (if the buffer interrupt
                                                     is enabled). It is possible for 2 buffers to be completed,
                                                     so clearing the buffer status bit may instantly re set
                                                     it on the next clock cycle.                                               */

    struct {
      __IOM uint32_t EP0_IN     : 1;            /*!< EP0_IN                                                                    */
      __IOM uint32_t EP0_OUT    : 1;            /*!< EP0_OUT                                                                   */
      __IOM uint32_t EP1_IN     : 1;            /*!< EP1_IN                                                                    */
      __IOM uint32_t EP1_OUT    : 1;            /*!< EP1_OUT                                                                   */
      __IOM uint32_t EP2_IN     : 1;            /*!< EP2_IN                                                                    */
      __IOM uint32_t EP2_OUT    : 1;            /*!< EP2_OUT                                                                   */
      __IOM uint32_t EP3_IN     : 1;            /*!< EP3_IN                                                                    */
      __IOM uint32_t EP3_OUT    : 1;            /*!< EP3_OUT                                                                   */
      __IOM uint32_t EP4_IN     : 1;            /*!< EP4_IN                                                                    */
      __IOM uint32_t EP4_OUT    : 1;            /*!< EP4_OUT                                                                   */
      __IOM uint32_t EP5_IN     : 1;            /*!< EP5_IN                                                                    */
      __IOM uint32_t EP5_OUT    : 1;            /*!< EP5_OUT                                                                   */
      __IOM uint32_t EP6_IN     : 1;            /*!< EP6_IN                                                                    */
      __IOM uint32_t EP6_OUT    : 1;            /*!< EP6_OUT                                                                   */
      __IOM uint32_t EP7_IN     : 1;            /*!< EP7_IN                                                                    */
      __IOM uint32_t EP7_OUT    : 1;            /*!< EP7_OUT                                                                   */
      __IOM uint32_t EP8_IN     : 1;            /*!< EP8_IN                                                                    */
      __IOM uint32_t EP8_OUT    : 1;            /*!< EP8_OUT                                                                   */
      __IOM uint32_t EP9_IN     : 1;            /*!< EP9_IN                                                                    */
      __IOM uint32_t EP9_OUT    : 1;            /*!< EP9_OUT                                                                   */
      __IOM uint32_t EP10_IN    : 1;            /*!< EP10_IN                                                                   */
      __IOM uint32_t EP10_OUT   : 1;            /*!< EP10_OUT                                                                  */
      __IOM uint32_t EP11_IN    : 1;            /*!< EP11_IN                                                                   */
      __IOM uint32_t EP11_OUT   : 1;            /*!< EP11_OUT                                                                  */
      __IOM uint32_t EP12_IN    : 1;            /*!< EP12_IN                                                                   */
      __IOM uint32_t EP12_OUT   : 1;            /*!< EP12_OUT                                                                  */
      __IOM uint32_t EP13_IN    : 1;            /*!< EP13_IN                                                                   */
      __IOM uint32_t EP13_OUT   : 1;            /*!< EP13_OUT                                                                  */
      __IOM uint32_t EP14_IN    : 1;            /*!< EP14_IN                                                                   */
      __IOM uint32_t EP14_OUT   : 1;            /*!< EP14_OUT                                                                  */
      __IOM uint32_t EP15_IN    : 1;            /*!< EP15_IN                                                                   */
      __IOM uint32_t EP15_OUT   : 1;            /*!< EP15_OUT                                                                  */
    } BUFF_STATUS_b;
  } ;

  union {
    __IOM uint32_t BUFF_CPU_SHOULD_HANDLE;      /*!< Which of the double buffers should be handled. Only valid if
                                                     using an interrupt per buffer (i.e. not per 2 buffers).
                                                     Not valid for host interrupt endpoint polling because they
                                                     are only single buffered.                                                 */

