mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t EP0_IN     : 1;            /*!< EP0_IN                                                                    */
      __IM  uint32_t EP0_OUT    : 1;            /*!< EP0_OUT                                                                   */
      __IM  uint32_t EP1_IN     : 1;            /*!< EP1_IN                                                                    */
      __IM  uint32_t EP1_OUT    : 1;            /*!< EP1_OUT                                                                   */
      __IM  uint32_t EP2_IN     : 1;            /*!< EP2_IN                                                                    */
      __IM  uint32_t EP2_OUT    : 1;            /*!< EP2_OUT                                                                   */
      __IM  uint32_t EP3_IN     : 1;            /*!< EP3_IN                                                                    */
      __IM  uint32_t EP3_OUT    : 1;            /*!< EP3_OUT                                                                   */
      __IM  uint32_t EP4_IN     : 1;            /*!< EP4_IN                                                                    */
      __IM  uint32_t EP4_OUT    : 1;            /*!< EP4_OUT                                                                   */
      __IM  uint32_t EP5_IN     : 1;            /*!< EP5_IN                                                                    */
      __IM  uint32_t EP5_OUT    : 1;            /*!< EP5_OUT                                                                   */
      __IM  uint32_t EP6_IN     : 1;            /*!< EP6_IN                                                                    */
      __IM  uint32_t EP6_OUT    : 1;            /*!< EP6_OUT                                                                   */
      __IM  uint32_t EP7_IN     : 1;            /*!< EP7_IN                                                                    */
      __IM  uint32_t EP7_OUT    : 1;            /*!< EP7_OUT                                                                   */
      __IM  uint32_t EP8_IN     : 1;            /*!< EP8_IN                                                                    */
      __IM  uint32_t EP8_OUT    : 1;            /*!< EP8_OUT                                                                   */
      __IM  uint32_t EP9_IN     : 1;            /*!< EP9_IN                                                                    */
      __IM  uint32_t EP9_OUT    : 1;            /*!< EP9_OUT                                                                   */
      __IM  uint32_t EP10_IN    : 1;            /*!< EP10_IN                                                                   */
      __IM  uint32_t EP10_OUT   : 1;            /*!< EP10_OUT                                                                  */
      __IM  uint32_t EP11_IN    : 1;            /*!< EP11_IN                                                                   */
      __IM  uint32_t EP11_OUT   : 1;            /*!< EP11_OUT                                                                  */
      __IM  uint32_t EP12_IN    : 1;            /*!< EP12_IN                                                                   */
      __IM  uint32_t EP12_OUT   : 1;            /*!< EP12_OUT                                                                  */
      __IM  uint32_t EP13_IN    : 1;            /*!< EP13_IN                                                                   */
      __IM  uint32_t EP13_OUT   : 1;            /*!< EP13_OUT                                                                  */
      __IM  uint32_t EP14_IN    : 1;            /*!< EP14_IN                                                                   */
      __IM  uint32_t EP14_OUT   : 1;            /*!< EP14_OUT                                                                  */
      __IM  uint32_t EP15_IN    : 1;            /*!< EP15_IN                                                                   */
      __IM  uint32_t EP15_OUT   : 1;            /*!< EP15_OUT                                                                  */
    } BUFF_CPU_SHOULD_HANDLE_b;
  } ;

  union {
    __IOM uint32_t EP_ABORT;                    /*!< Device only: Can be set to ignore the buffer control register
                                                     for this endpoint in case you would like to revoke a buffer.
                                                     A NAK will be sent for every access to the endpoint until
                                                     this bit is cleared. A corresponding bit in `EP_ABORT_DONE`
                                                     is set when it is safe to modify the buffer control register.             */

    struct {
      __IOM uint32_t EP0_IN     : 1;            /*!< EP0_IN                                                                    */
      __IOM uint32_t EP0_OUT    : 1;            /*!< EP0_OUT                                                                   */
      __IOM uint32_t EP1_IN     : 1;            /*!< EP1_IN                                                                    */
      __IOM uint32_t EP1_OUT    : 1;            /*!< EP1_OUT                                                                   */
      __IOM uint32_t EP2_IN     : 1;            /*!< EP2_IN                                                                    */
      __IOM uint32_t EP2_OUT    : 1;            /*!< EP2_OUT                                                                   */
      __IOM uint32_t EP3_IN     : 1;            /*!< EP3_IN                                                                    */
      __IOM uint32_t EP3_OUT    : 1;            /*!< EP3_OUT                                                                   */
      __IOM uint32_t EP4_IN     : 1;            /*!< EP4_IN                                                                    */
      __IOM uint32_t EP4_OUT    : 1;            /*!< EP4_OUT                                                                   */
      __IOM uint32_t EP5_IN     : 1;            /*!< EP5_IN                                                                    */
      __IOM uint32_t EP5_OUT    : 1;            /*!< EP5_OUT                                                                   */
      __IOM uint32_t EP6_IN     : 1;            /*!< EP6_IN                                                                    */
      __IOM uint32_t EP6_OUT    : 1;            /*!< EP6_OUT                                                                   */
      __IOM uint32_t EP7_IN     : 1;            /*!< EP7_IN                                                                    */
      __IOM uint32_t EP7_OUT    : 1;            /*!< EP7_OUT                                                                   */
      __IOM uint32_t EP8_IN     : 1;            /*!< EP8_IN                                                                    */
      __IOM uint32_t EP8_OUT    : 1;            /*!< EP8_OUT                                                                   */
      __IOM uint32_t EP9_IN     : 1;            /*!< EP9_IN                                                                    */
      __IOM uint32_t EP9_OUT    : 1;            /*!< EP9_OUT                                                                   */
      __IOM uint32_t EP10_IN    : 1;            /*!< EP10_IN                                                                   */
      __IOM uint32_t EP10_OUT   : 1;            /*!< EP10_OUT                                                                  */
      __IOM uint32_t EP11_IN    : 1;            /*!< EP11_IN                                                                   */
      __IOM uint32_t EP11_OUT   : 1;            /*!< EP11_OUT                                                                  */
      __IOM uint32_t EP12_IN    : 1;            /*!< EP12_IN                                                                   */
      __IOM uint32_t EP12_OUT   : 1;            /*!< EP12_OUT                                                                  */
      __IOM uint32_t EP13_IN    : 1;            /*!< EP13_IN                                                                   */
      __IOM uint32_t EP13_OUT   : 1;            /*!< EP13_OUT                                                                  */
      __IOM uint32_t EP14_IN    : 1;            /*!< EP14_IN                                                                   */
      __IOM uint32_t EP14_OUT   : 1;            /*!< EP14_OUT                                                                  */
      __IOM uint32_t EP15_IN    : 1;            /*!< EP15_IN                                                                   */
      __IOM uint32_t EP15_OUT   : 1;            /*!< EP15_OUT                                                                  */
    } EP_ABORT_b;
  } ;

  union {
    __IOM uint32_t EP_ABORT_DONE;               /*!< Device only: Used in conjunction with `EP_ABORT`. Set once an
                                                     endpoint is idle so the programmer knows it is safe to
                                                     modify the buffer control register.                                       */

