mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t EP0_IN     : 1;            /*!< EP0_IN                                                                    */
      __IOM uint32_t EP0_OUT    : 1;            /*!< EP0_OUT                                                                   */
      __IOM uint32_t EP1_IN     : 1;            /*!< EP1_IN                                                                    */
      __IOM uint32_t EP1_OUT    : 1;            /*!< EP1_OUT                                                                   */
      __IOM uint32_t EP2_IN     : 1;            /*!< EP2_IN                                                                    */
      __IOM uint32_t EP2_OUT    : 1;            /*!< EP2_OUT                                                                   */
      __IOM uint32_t EP3_IN     : 1;            /*!< EP3_IN                                                                    */
      __IOM uint32_t EP3_OUT    : 1;            /*!< EP3_OUT                                                                   */
      __IOM uint32_t EP4_IN     : 1;            /*!< EP4_IN                                                                    */
      __IOM uint32_t EP4_OUT    : 1;            /*!< EP4_OUT                                                                   */
      __IOM uint32_t EP5_IN     : 1;            /*!< EP5_IN                                                                    */
      __IOM uint32_t EP5_OUT    : 1;            /*!< EP5_OUT                                                                   */
      __IOM uint32_t EP6_IN     : 1;            /*!< EP6_IN                                                                    */
      __IOM uint32_t EP6_OUT    : 1;            /*!< EP6_OUT                                                                   */
      __IOM uint32_t EP7_IN     : 1;            /*!< EP7_IN                                                                    */
      __IOM uint32_t EP7_OUT    : 1;            /*!< EP7_OUT                                                                   */
      __IOM uint32_t EP8_IN     : 1;            /*!< EP8_IN                                                                    */
      __IOM uint32_t EP8_OUT    : 1;            /*!< EP8_OUT                                                                   */
      __IOM uint32_t EP9_IN     : 1;            /*!< EP9_IN                                                                    */
      __IOM uint32_t EP9_OUT    : 1;            /*!< EP9_OUT                                                                   */
      __IOM uint32_t EP10_IN    : 1;            /*!< EP10_IN                                                                   */
      __IOM uint32_t EP10_OUT   : 1;            /*!< EP10_OUT                                                                  */
      __IOM uint32_t EP11_IN    : 1;            /*!< EP11_IN                                                                   */
      __IOM uint32_t EP11_OUT   : 1;            /*!< EP11_OUT                                                                  */
      __IOM uint32_t EP12_IN    : 1;            /*!< EP12_IN                                                                   */
      __IOM uint32_t EP12_OUT   : 1;            /*!< EP12_OUT                                                                  */
      __IOM uint32_t EP13_IN    : 1;            /*!< EP13_IN                                                                   */
      __IOM uint32_t EP13_OUT   : 1;            /*!< EP13_OUT                                                                  */
      __IOM uint32_t EP14_IN    : 1;            /*!< EP14_IN                                                                   */
      __IOM uint32_t EP14_OUT   : 1;            /*!< EP14_OUT                                                                  */
      __IOM uint32_t EP15_IN    : 1;            /*!< EP15_IN                                                                   */
      __IOM uint32_t EP15_OUT   : 1;            /*!< EP15_OUT                                                                  */
    } EP_STATUS_STALL_NAK_b;
  } ;

  union {
    __IOM uint32_t USB_MUXING;                  /*!< Where to connect the USB controller. Should be to_phy by default.         */

    struct {
      __IOM uint32_t TO_PHY     : 1;            /*!< TO_PHY                                                                    */
      __IOM uint32_t TO_EXTPHY  : 1;            /*!< TO_EXTPHY                                                                 */
      __IOM uint32_t TO_DIGITAL_PAD : 1;        /*!< TO_DIGITAL_PAD                                                            */
      __IOM uint32_t SOFTCON    : 1;            /*!< SOFTCON                                                                   */
            uint32_t            : 28;
    } USB_MUXING_b;
  } ;

  union {
    __IOM uint32_t USB_PWR;                     /*!< Overrides for the power signals in the event that the VBUS signals
                                                     are not hooked up to GPIO. Set the value of the override
                                                     and then the override enable to switch over to the override
                                                     value.                                                                    */

    struct {
      __IOM uint32_t VBUS_EN    : 1;            /*!< VBUS_EN                                                                   */
      __IOM uint32_t VBUS_EN_OVERRIDE_EN : 1;   /*!< VBUS_EN_OVERRIDE_EN                                                       */
      __IOM uint32_t VBUS_DETECT : 1;           /*!< VBUS_DETECT                                                               */
      __IOM uint32_t VBUS_DETECT_OVERRIDE_EN : 1;/*!< VBUS_DETECT_OVERRIDE_EN                                                  */
      __IOM uint32_t OVERCURR_DETECT : 1;       /*!< OVERCURR_DETECT                                                           */
      __IOM uint32_t OVERCURR_DETECT_EN : 1;    /*!< OVERCURR_DETECT_EN                                                        */
            uint32_t            : 26;
    } USB_PWR_b;
  } ;

  union {
    __IOM uint32_t USBPHY_DIRECT;               /*!< This register allows for direct control of the USB phy. Use
                                                     in conjunction with usbphy_direct_override register to
                                                     enable each override bit.                                                 */

