mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t DP_PULLUP_HISEL : 1;       /*!< Enable the second DP pull up resistor. 0 - Pull = Rpu2; 1 -
                                                     Pull = Rpu1 + Rpu2                                                        */
      __IOM uint32_t DP_PULLUP_EN : 1;          /*!< DP pull up enable                                                         */
      __IOM uint32_t DP_PULLDN_EN : 1;          /*!< DP pull down enable                                                       */
            uint32_t            : 1;
      __IOM uint32_t DM_PULLUP_HISEL : 1;       /*!< Enable the second DM pull up resistor. 0 - Pull = Rpu2; 1 -
                                                     Pull = Rpu1 + Rpu2                                                        */
      __IOM uint32_t DM_PULLUP_EN : 1;          /*!< DM pull up enable                                                         */
      __IOM uint32_t DM_PULLDN_EN : 1;          /*!< DM pull down enable                                                       */
            uint32_t            : 1;
      __IOM uint32_t TX_DP_OE   : 1;            /*!< Output enable. If TX_DIFFMODE=1, OE for DPP/DPM diff pair. 0
                                                     - DPP/DPM in Hi-Z state; 1 - DPP/DPM driving
                                                     If TX_DIFFMODE=0, OE for DPP only. 0 - DPP in Hi-Z state;
                                                     1 - DPP driving                                                           */
      __IOM uint32_t TX_DM_OE   : 1;            /*!< Output enable. If TX_DIFFMODE=1, Ignored.
                                                     If TX_DIFFMODE=0, OE for DPM only. 0 - DPM in Hi-Z state;
                                                     1 - DPM driving                                                           */
      __IOM uint32_t TX_DP      : 1;            /*!< Output data. If TX_DIFFMODE=1, Drives DPP/DPM diff pair. TX_DP_OE=1
                                                     to enable drive. DPP=TX_DP, DPM=~TX_DP
                                                     If TX_DIFFMODE=0, Drives DPP only. TX_DP_OE=1 to enable
                                                     drive. DPP=TX_DP                                                          */
      __IOM uint32_t TX_DM      : 1;            /*!< Output data. TX_DIFFMODE=1, Ignored
                                                     TX_DIFFMODE=0, Drives DPM only. TX_DM_OE=1 to enable drive.
                                                     DPM=TX_DM                                                                 */
      __IOM uint32_t RX_PD      : 1;            /*!< RX power down override (if override enable is set). 1 = powered
                                                     down.                                                                     */
      __IOM uint32_t TX_PD      : 1;            /*!< TX power down override (if override enable is set). 1 = powered
                                                     down.                                                                     */
      __IOM uint32_t TX_FSSLEW  : 1;            /*!< TX_FSSLEW=0: Low speed slew rate
                                                     TX_FSSLEW=1: Full speed slew rate                                         */
      __IOM uint32_t TX_DIFFMODE : 1;           /*!< TX_DIFFMODE=0: Single ended mode
                                                     TX_DIFFMODE=1: Differential drive mode (TX_DM, TX_DM_OE
                                                     ignored)                                                                  */
      __IM  uint32_t RX_DD      : 1;            /*!< Differential RX                                                           */
      __IM  uint32_t RX_DP      : 1;            /*!< DPP pin state                                                             */
      __IM  uint32_t RX_DM      : 1;            /*!< DPM pin state                                                             */
      __IM  uint32_t DP_OVCN    : 1;            /*!< DP overcurrent                                                            */
      __IM  uint32_t DM_OVCN    : 1;            /*!< DM overcurrent                                                            */
      __IM  uint32_t DP_OVV     : 1;            /*!< DP over voltage                                                           */
      __IM  uint32_t DM_OVV     : 1;            /*!< DM over voltage                                                           */
            uint32_t            : 9;
    } USBPHY_DIRECT_b;
  } ;

  union {
    __IOM uint32_t USBPHY_DIRECT_OVERRIDE;      /*!< Override enable for each control in usbphy_direct                         */

    struct {
      __IOM uint32_t DP_PULLUP_HISEL_OVERRIDE_EN : 1;/*!< DP_PULLUP_HISEL_OVERRIDE_EN                                          */
      __IOM uint32_t DM_PULLUP_HISEL_OVERRIDE_EN : 1;/*!< DM_PULLUP_HISEL_OVERRIDE_EN                                          */
      __IOM uint32_t DP_PULLUP_EN_OVERRIDE_EN : 1;/*!< DP_PULLUP_EN_OVERRIDE_EN                                                */
      __IOM uint32_t DP_PULLDN_EN_OVERRIDE_EN : 1;/*!< DP_PULLDN_EN_OVERRIDE_EN                                                */
      __IOM uint32_t DM_PULLDN_EN_OVERRIDE_EN : 1;/*!< DM_PULLDN_EN_OVERRIDE_EN                                                */
      __IOM uint32_t TX_DP_OE_OVERRIDE_EN : 1;  /*!< TX_DP_OE_OVERRIDE_EN                                                      */
      __IOM uint32_t TX_DM_OE_OVERRIDE_EN : 1;  /*!< TX_DM_OE_OVERRIDE_EN                                                      */
      __IOM uint32_t TX_DP_OVERRIDE_EN : 1;     /*!< TX_DP_OVERRIDE_EN                                                         */
      __IOM uint32_t TX_DM_OVERRIDE_EN : 1;     /*!< TX_DM_OVERRIDE_EN                                                         */
      __IOM uint32_t RX_PD_OVERRIDE_EN : 1;     /*!< RX_PD_OVERRIDE_EN                                                         */
      __IOM uint32_t TX_PD_OVERRIDE_EN : 1;     /*!< TX_PD_OVERRIDE_EN                                                         */
      __IOM uint32_t TX_FSSLEW_OVERRIDE_EN : 1; /*!< TX_FSSLEW_OVERRIDE_EN                                                     */
      __IOM uint32_t DM_PULLUP_OVERRIDE_EN : 1; /*!< DM_PULLUP_OVERRIDE_EN                                                     */
            uint32_t            : 2;
      __IOM uint32_t TX_DIFFMODE_OVERRIDE_EN : 1;/*!< TX_DIFFMODE_OVERRIDE_EN                                                  */
            uint32_t            : 16;
    } USBPHY_DIRECT_OVERRIDE_b;
  } ;

  union {
    __IOM uint32_t USBPHY_TRIM;                 /*!< Used to adjust trim values of USB phy pull down resistors.                */

