mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t HOST_CONN_DIS : 1;         /*!< Host: raised when a device is connected or disconnected (i.e.
                                                     when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED    */
      __IOM uint32_t HOST_RESUME : 1;           /*!< Host: raised when a device wakes up the host. Cleared by writing
                                                     to SIE_STATUS.RESUME                                                      */
      __IOM uint32_t HOST_SOF   : 1;            /*!< Host: raised every time the host sends a SOF (Start of Frame).
                                                     Cleared by reading SOF_RD                                                 */
      __IOM uint32_t TRANS_COMPLETE : 1;        /*!< Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
                                                     writing to this bit.                                                      */
      __IOM uint32_t BUFF_STATUS : 1;           /*!< Raised when any bit in BUFF_STATUS is set. Clear by clearing
                                                     all bits in BUFF_STATUS.                                                  */
      __IOM uint32_t ERROR_DATA_SEQ : 1;        /*!< Source: SIE_STATUS.DATA_SEQ_ERROR                                         */
      __IOM uint32_t ERROR_RX_TIMEOUT : 1;      /*!< Source: SIE_STATUS.RX_TIMEOUT                                             */
      __IOM uint32_t ERROR_RX_OVERFLOW : 1;     /*!< Source: SIE_STATUS.RX_OVERFLOW                                            */
      __IOM uint32_t ERROR_BIT_STUFF : 1;       /*!< Source: SIE_STATUS.BIT_STUFF_ERROR                                        */
      __IOM uint32_t ERROR_CRC  : 1;            /*!< Source: SIE_STATUS.CRC_ERROR                                              */
      __IOM uint32_t STALL      : 1;            /*!< Source: SIE_STATUS.STALL_REC                                              */
      __IOM uint32_t VBUS_DETECT : 1;           /*!< Source: SIE_STATUS.VBUS_DETECTED                                          */
      __IOM uint32_t BUS_RESET  : 1;            /*!< Source: SIE_STATUS.BUS_RESET                                              */
      __IOM uint32_t DEV_CONN_DIS : 1;          /*!< Set when the device connection state changes. Cleared by writing
                                                     to SIE_STATUS.CONNECTED                                                   */
      __IOM uint32_t DEV_SUSPEND : 1;           /*!< Set when the device suspend state changes. Cleared by writing
                                                     to SIE_STATUS.SUSPENDED                                                   */
      __IOM uint32_t DEV_RESUME_FROM_HOST : 1;  /*!< Set when the device receives a resume from the host. Cleared
                                                     by writing to SIE_STATUS.RESUME                                           */
      __IOM uint32_t SETUP_REQ  : 1;            /*!< Device. Source: SIE_STATUS.SETUP_REC                                      */
      __IOM uint32_t DEV_SOF    : 1;            /*!< Set every time the device receives a SOF (Start of Frame) packet.
                                                     Cleared by reading SOF_RD                                                 */
      __IOM uint32_t ABORT_DONE : 1;            /*!< Raised when any bit in ABORT_DONE is set. Clear by clearing
                                                     all bits in ABORT_DONE.                                                   */
      __IOM uint32_t EP_STALL_NAK : 1;          /*!< Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by
                                                     clearing all bits in EP_STATUS_STALL_NAK.                                 */
            uint32_t            : 12;
    } INTF_b;
  } ;

  union {
    __IOM uint32_t INTS;                        /*!< Interrupt status after masking & forcing                                  */

    struct {
      __IM  uint32_t HOST_CONN_DIS : 1;         /*!< Host: raised when a device is connected or disconnected (i.e.
                                                     when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED    */
      __IM  uint32_t HOST_RESUME : 1;           /*!< Host: raised when a device wakes up the host. Cleared by writing
                                                     to SIE_STATUS.RESUME                                                      */
      __IM  uint32_t HOST_SOF   : 1;            /*!< Host: raised every time the host sends a SOF (Start of Frame).
                                                     Cleared by reading SOF_RD                                                 */
      __IM  uint32_t TRANS_COMPLETE : 1;        /*!< Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
                                                     writing to this bit.                                                      */
      __IM  uint32_t BUFF_STATUS : 1;           /*!< Raised when any bit in BUFF_STATUS is set. Clear by clearing
                                                     all bits in BUFF_STATUS.                                                  */
      __IM  uint32_t ERROR_DATA_SEQ : 1;        /*!< Source: SIE_STATUS.DATA_SEQ_ERROR                                         */
      __IM  uint32_t ERROR_RX_TIMEOUT : 1;      /*!< Source: SIE_STATUS.RX_TIMEOUT                                             */
      __IM  uint32_t ERROR_RX_OVERFLOW : 1;     /*!< Source: SIE_STATUS.RX_OVERFLOW                                            */
      __IM  uint32_t ERROR_BIT_STUFF : 1;       /*!< Source: SIE_STATUS.BIT_STUFF_ERROR                                        */
      __IM  uint32_t ERROR_CRC  : 1;            /*!< Source: SIE_STATUS.CRC_ERROR                                              */
      __IM  uint32_t STALL      : 1;            /*!< Source: SIE_STATUS.STALL_REC                                              */
      __IM  uint32_t VBUS_DETECT : 1;           /*!< Source: SIE_STATUS.VBUS_DETECTED                                          */
      __IM  uint32_t BUS_RESET  : 1;            /*!< Source: SIE_STATUS.BUS_RESET                                              */
      __IM  uint32_t DEV_CONN_DIS : 1;          /*!< Set when the device connection state changes. Cleared by writing
                                                     to SIE_STATUS.CONNECTED                                                   */
      __IM  uint32_t DEV_SUSPEND : 1;           /*!< Set when the device suspend state changes. Cleared by writing
                                                     to SIE_STATUS.SUSPENDED                                                   */
      __IM  uint32_t DEV_RESUME_FROM_HOST : 1;  /*!< Set when the device receives a resume from the host. Cleared
                                                     by writing to SIE_STATUS.RESUME                                           */
      __IM  uint32_t SETUP_REQ  : 1;            /*!< Device. Source: SIE_STATUS.SETUP_REC                                      */
      __IM  uint32_t DEV_SOF    : 1;            /*!< Set every time the device receives a SOF (Start of Frame) packet.
                                                     Cleared by reading SOF_RD                                                 */
      __IM  uint32_t ABORT_DONE : 1;            /*!< Raised when any bit in ABORT_DONE is set. Clear by clearing
                                                     all bits in ABORT_DONE.                                                   */
      __IM  uint32_t EP_STALL_NAK : 1;          /*!< Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by
                                                     clearing all bits in EP_STATUS_STALL_NAK.                                 */
            uint32_t            : 12;
    } INTS_b;
  } ;
} USBCTRL_REGS_Type;                            /*!< Size = 156 (0x9c)                                                         */



/* =========================================================================================================================== */
/* ================                                           PIO0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Programmable IO block (PIO0)
  */

typedef struct {                                /*!< PIO0 Structure                                                            */

  union {
    __IOM uint32_t CTRL;                        /*!< PIO control register                                                      */

