mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t SM_ENABLE  : 4;            /*!< Enable/disable each of the four state machines by writing 1/0
                                                     to each of these four bits. When disabled, a state machine
                                                     will cease executing instructions, except those written
                                                     directly to SMx_INSTR by the system. Multiple bits can
                                                     be set/cleared at once to run/halt multiple state machines
                                                     simultaneously.                                                           */
      __IOM uint32_t SM_RESTART : 4;            /*!< Write 1 to instantly clear internal SM state which may be otherwise
                                                     difficult to access and will affect future execution.

                                                     Specifically, the following are cleared: input and output
                                                     shift counters; the contents of the input shift register;
                                                     the delay counter; the waiting-on-IRQ state; any stalled
                                                     instruction written to SMx_INSTR or run by OUT/MOV EXEC;
                                                     any pin write left asserted due to OUT_STICKY.

                                                     The program counter, the contents of the output shift register
                                                     and the X/Y scratch registers are not affected.                           */
      __IOM uint32_t CLKDIV_RESTART : 4;        /*!< Restart a state machine's clock divider from an initial phase
                                                     of 0. Clock dividers are free-running, so once started,
                                                     their output (including fractional jitter) is completely
                                                     determined by the integer/fractional divisor configured
                                                     in SMx_CLKDIV. This means that, if multiple clock dividers
                                                     with the same divisor are restarted simultaneously, by
                                                     writing multiple 1 bits to this field, the execution clocks
                                                     of those state machines will run in precise lockstep.

                                                     Note that setting/clearing SM_ENABLE does not stop the
                                                     clock divider from running, so once multiple state machines'
                                                     clocks are synchronised, it is safe to disable/reenable
                                                     a state machine, whilst keeping the clock dividers in sync.

                                                     Note also that CLKDIV_RESTART can be written to whilst
                                                     the state machine is running, and this is useful to resynchronise
                                                     clock dividers after the divisors (SMx_CLKDIV) have been
                                                     changed on-the-fly.                                                       */
            uint32_t            : 20;
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t FSTAT;                       /*!< FIFO status register                                                      */

    struct {
      __IM  uint32_t RXFULL     : 4;            /*!< State machine RX FIFO is full                                             */
            uint32_t            : 4;
      __IM  uint32_t RXEMPTY    : 4;            /*!< State machine RX FIFO is empty                                            */
            uint32_t            : 4;
      __IM  uint32_t TXFULL     : 4;            /*!< State machine TX FIFO is full                                             */
            uint32_t            : 4;
      __IM  uint32_t TXEMPTY    : 4;            /*!< State machine TX FIFO is empty                                            */
            uint32_t            : 4;
    } FSTAT_b;
  } ;

  union {
    __IOM uint32_t FDEBUG;                      /*!< FIFO debug register                                                       */

    struct {
      __IOM uint32_t RXSTALL    : 4;            /*!< State machine has stalled on full RX FIFO during a blocking
                                                     PUSH, or an IN with autopush enabled. This flag is also
                                                     set when a nonblocking PUSH to a full FIFO took place,
                                                     in which case the state machine has dropped data. Write
                                                     1 to clear.                                                               */
            uint32_t            : 4;
      __IOM uint32_t RXUNDER    : 4;            /*!< RX FIFO underflow (i.e. read-on-empty by the system) has occurred.
                                                     Write 1 to clear. Note that read-on-empty does not perturb
                                                     the state of the FIFO in any way, but the data returned
                                                     by reading from an empty FIFO is undefined, so this flag
                                                     generally only becomes set due to some kind of software
                                                     error.                                                                    */
            uint32_t            : 4;
      __IOM uint32_t TXOVER     : 4;            /*!< TX FIFO overflow (i.e. write-on-full by the system) has occurred.
                                                     Write 1 to clear. Note that write-on-full does not alter
                                                     the state or contents of the FIFO in any way, but the data
                                                     that the system attempted to write is dropped, so if this
                                                     flag is set, your software has quite likely dropped some
                                                     data on the floor.                                                        */
            uint32_t            : 4;
      __IOM uint32_t TXSTALL    : 4;            /*!< State machine has stalled on empty TX FIFO during a blocking
                                                     PULL, or an OUT with autopull enabled. Write 1 to clear.                  */
            uint32_t            : 4;
    } FDEBUG_b;
  } ;

  union {
    __IOM uint32_t FLEVEL;                      /*!< FIFO levels                                                               */

