mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t IRQ        : 8;            /*!< IRQ                                                                       */
            uint32_t            : 24;
    } IRQ_b;
  } ;

  union {
    __IOM uint32_t IRQ_FORCE;                   /*!< Writing a 1 to each of these bits will forcibly assert the corresponding
                                                     IRQ. Note this is different to the INTF register: writing
                                                     here affects PIO internal state. INTF just asserts the
                                                     processor-facing IRQ signal for testing ISRs, and is not
                                                     visible to the state machines.                                            */

    struct {
      __OM  uint32_t IRQ_FORCE  : 8;            /*!< IRQ_FORCE                                                                 */
            uint32_t            : 24;
    } IRQ_FORCE_b;
  } ;
  __IOM uint32_t  INPUT_SYNC_BYPASS;            /*!< There is a 2-flipflop synchronizer on each GPIO input, which
                                                     protects PIO logic from metastabilities. This increases
                                                     input delay, and for fast synchronous IO (e.g. SPI) these
                                                     synchronizers may need to be bypassed. Each bit in this
                                                     register corresponds to one GPIO.
                                                     0 -> input is synchronized (default)
                                                     1 -> synchronizer is bypassed
                                                     If in doubt, leave this register as all zeroes.                           */
  __IM  uint32_t  DBG_PADOUT;                   /*!< Read to sample the pad output values PIO is currently driving
                                                     to the GPIOs. On RP2040 there are 30 GPIOs, so the two
                                                     most significant bits are hardwired to 0.                                 */
  __IM  uint32_t  DBG_PADOE;                    /*!< Read to sample the pad output enables (direction) PIO is currently
                                                     driving to the GPIOs. On RP2040 there are 30 GPIOs, so
                                                     the two most significant bits are hardwired to 0.                         */

  union {
    __IOM uint32_t DBG_CFGINFO;                 /*!< The PIO hardware has some free parameters that may vary between
                                                     chip products.
                                                     These should be provided in the chip datasheet, but are
                                                     also exposed here.                                                        */

    struct {
      __IM  uint32_t FIFO_DEPTH : 6;            /*!< The depth of the state machine TX/RX FIFOs, measured in words.
                                                     Joining fifos via SHIFTCTRL_FJOIN gives one FIFO with double
                                                     this depth.                                                               */
            uint32_t            : 2;
      __IM  uint32_t SM_COUNT   : 4;            /*!< The number of state machines this PIO instance is equipped with.          */
            uint32_t            : 4;
      __IM  uint32_t IMEM_SIZE  : 6;            /*!< The size of the instruction memory, measured in units of one
                                                     instruction                                                               */
            uint32_t            : 10;
    } DBG_CFGINFO_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM0;                  /*!< Write-only access to instruction memory location 0                        */

    struct {
      __OM  uint32_t INSTR_MEM0 : 16;           /*!< INSTR_MEM0                                                                */
            uint32_t            : 16;
    } INSTR_MEM0_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM1;                  /*!< Write-only access to instruction memory location 1                        */

    struct {
      __OM  uint32_t INSTR_MEM1 : 16;           /*!< INSTR_MEM1                                                                */
            uint32_t            : 16;
    } INSTR_MEM1_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM2;                  /*!< Write-only access to instruction memory location 2                        */

    struct {
      __OM  uint32_t INSTR_MEM2 : 16;           /*!< INSTR_MEM2                                                                */
            uint32_t            : 16;
    } INSTR_MEM2_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM3;                  /*!< Write-only access to instruction memory location 3                        */

    struct {
      __OM  uint32_t INSTR_MEM3 : 16;           /*!< INSTR_MEM3                                                                */
            uint32_t            : 16;
    } INSTR_MEM3_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM4;                  /*!< Write-only access to instruction memory location 4                        */

    struct {
      __OM  uint32_t INSTR_MEM4 : 16;           /*!< INSTR_MEM4                                                                */
            uint32_t            : 16;
    } INSTR_MEM4_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM5;                  /*!< Write-only access to instruction memory location 5                        */

    struct {
      __OM  uint32_t INSTR_MEM5 : 16;           /*!< INSTR_MEM5                                                                */
            uint32_t            : 16;
    } INSTR_MEM5_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM6;                  /*!< Write-only access to instruction memory location 6                        */

