mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __OM  uint32_t INSTR_MEM6 : 16;           /*!< INSTR_MEM6                                                                */
            uint32_t            : 16;
    } INSTR_MEM6_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM7;                  /*!< Write-only access to instruction memory location 7                        */

    struct {
      __OM  uint32_t INSTR_MEM7 : 16;           /*!< INSTR_MEM7                                                                */
            uint32_t            : 16;
    } INSTR_MEM7_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM8;                  /*!< Write-only access to instruction memory location 8                        */

    struct {
      __OM  uint32_t INSTR_MEM8 : 16;           /*!< INSTR_MEM8                                                                */
            uint32_t            : 16;
    } INSTR_MEM8_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM9;                  /*!< Write-only access to instruction memory location 9                        */

    struct {
      __OM  uint32_t INSTR_MEM9 : 16;           /*!< INSTR_MEM9                                                                */
            uint32_t            : 16;
    } INSTR_MEM9_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM10;                 /*!< Write-only access to instruction memory location 10                       */

    struct {
      __OM  uint32_t INSTR_MEM10 : 16;          /*!< INSTR_MEM10                                                               */
            uint32_t            : 16;
    } INSTR_MEM10_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM11;                 /*!< Write-only access to instruction memory location 11                       */

    struct {
      __OM  uint32_t INSTR_MEM11 : 16;          /*!< INSTR_MEM11                                                               */
            uint32_t            : 16;
    } INSTR_MEM11_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM12;                 /*!< Write-only access to instruction memory location 12                       */

    struct {
      __OM  uint32_t INSTR_MEM12 : 16;          /*!< INSTR_MEM12                                                               */
            uint32_t            : 16;
    } INSTR_MEM12_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM13;                 /*!< Write-only access to instruction memory location 13                       */

    struct {
      __OM  uint32_t INSTR_MEM13 : 16;          /*!< INSTR_MEM13                                                               */
            uint32_t            : 16;
    } INSTR_MEM13_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM14;                 /*!< Write-only access to instruction memory location 14                       */

    struct {
      __OM  uint32_t INSTR_MEM14 : 16;          /*!< INSTR_MEM14                                                               */
            uint32_t            : 16;
    } INSTR_MEM14_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM15;                 /*!< Write-only access to instruction memory location 15                       */

    struct {
      __OM  uint32_t INSTR_MEM15 : 16;          /*!< INSTR_MEM15                                                               */
            uint32_t            : 16;
    } INSTR_MEM15_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM16;                 /*!< Write-only access to instruction memory location 16                       */

    struct {
      __OM  uint32_t INSTR_MEM16 : 16;          /*!< INSTR_MEM16                                                               */
            uint32_t            : 16;
    } INSTR_MEM16_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM17;                 /*!< Write-only access to instruction memory location 17                       */

    struct {
      __OM  uint32_t INSTR_MEM17 : 16;          /*!< INSTR_MEM17                                                               */
            uint32_t            : 16;
    } INSTR_MEM17_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM18;                 /*!< Write-only access to instruction memory location 18                       */

    struct {
      __OM  uint32_t INSTR_MEM18 : 16;          /*!< INSTR_MEM18                                                               */
            uint32_t            : 16;
    } INSTR_MEM18_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM19;                 /*!< Write-only access to instruction memory location 19                       */

    struct {
      __OM  uint32_t INSTR_MEM19 : 16;          /*!< INSTR_MEM19                                                               */
            uint32_t            : 16;
    } INSTR_MEM19_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM20;                 /*!< Write-only access to instruction memory location 20                       */

    struct {
      __OM  uint32_t INSTR_MEM20 : 16;          /*!< INSTR_MEM20                                                               */
            uint32_t            : 16;
    } INSTR_MEM20_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM21;                 /*!< Write-only access to instruction memory location 21                       */

    struct {
      __OM  uint32_t INSTR_MEM21 : 16;          /*!< INSTR_MEM21                                                               */
            uint32_t            : 16;
    } INSTR_MEM21_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM22;                 /*!< Write-only access to instruction memory location 22                       */

    struct {
      __OM  uint32_t INSTR_MEM22 : 16;          /*!< INSTR_MEM22                                                               */
            uint32_t            : 16;
    } INSTR_MEM22_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM23;                 /*!< Write-only access to instruction memory location 23                       */

    struct {
      __OM  uint32_t INSTR_MEM23 : 16;          /*!< INSTR_MEM23                                                               */
            uint32_t            : 16;
    } INSTR_MEM23_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM24;                 /*!< Write-only access to instruction memory location 24                       */

