mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __OM  uint32_t INSTR_MEM24 : 16;          /*!< INSTR_MEM24                                                               */
            uint32_t            : 16;
    } INSTR_MEM24_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM25;                 /*!< Write-only access to instruction memory location 25                       */

    struct {
      __OM  uint32_t INSTR_MEM25 : 16;          /*!< INSTR_MEM25                                                               */
            uint32_t            : 16;
    } INSTR_MEM25_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM26;                 /*!< Write-only access to instruction memory location 26                       */

    struct {
      __OM  uint32_t INSTR_MEM26 : 16;          /*!< INSTR_MEM26                                                               */
            uint32_t            : 16;
    } INSTR_MEM26_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM27;                 /*!< Write-only access to instruction memory location 27                       */

    struct {
      __OM  uint32_t INSTR_MEM27 : 16;          /*!< INSTR_MEM27                                                               */
            uint32_t            : 16;
    } INSTR_MEM27_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM28;                 /*!< Write-only access to instruction memory location 28                       */

    struct {
      __OM  uint32_t INSTR_MEM28 : 16;          /*!< INSTR_MEM28                                                               */
            uint32_t            : 16;
    } INSTR_MEM28_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM29;                 /*!< Write-only access to instruction memory location 29                       */

    struct {
      __OM  uint32_t INSTR_MEM29 : 16;          /*!< INSTR_MEM29                                                               */
            uint32_t            : 16;
    } INSTR_MEM29_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM30;                 /*!< Write-only access to instruction memory location 30                       */

    struct {
      __OM  uint32_t INSTR_MEM30 : 16;          /*!< INSTR_MEM30                                                               */
            uint32_t            : 16;
    } INSTR_MEM30_b;
  } ;

  union {
    __IOM uint32_t INSTR_MEM31;                 /*!< Write-only access to instruction memory location 31                       */

    struct {
      __OM  uint32_t INSTR_MEM31 : 16;          /*!< INSTR_MEM31                                                               */
            uint32_t            : 16;
    } INSTR_MEM31_b;
  } ;

  union {
    __IOM uint32_t SM0_CLKDIV;                  /*!< Clock divisor register for state machine 0
                                                     Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256)                 */

    struct {
            uint32_t            : 8;
      __IOM uint32_t FRAC       : 8;            /*!< Fractional part of clock divisor                                          */
      __IOM uint32_t INT        : 16;           /*!< Effective frequency is sysclk/(int + frac/256).
                                                     Value of 0 is interpreted as 65536. If INT is 0, FRAC must
                                                     also be 0.                                                                */
    } SM0_CLKDIV_b;
  } ;

  union {
    __IOM uint32_t SM0_EXECCTRL;                /*!< Execution/behavioural settings for state machine 0                        */

    struct {
      __IOM uint32_t STATUS_N   : 4;            /*!< Comparison level for the MOV x, STATUS instruction                        */
      __IOM uint32_t STATUS_SEL : 1;            /*!< Comparison used for the MOV x, STATUS instruction.                        */
            uint32_t            : 2;
      __IOM uint32_t WRAP_BOTTOM : 5;           /*!< After reaching wrap_top, execution is wrapped to this address.            */
      __IOM uint32_t WRAP_TOP   : 5;            /*!< After reaching this address, execution is wrapped to wrap_bottom.
                                                     If the instruction is a jump, and the jump condition is
                                                     true, the jump takes priority.                                            */
      __IOM uint32_t OUT_STICKY : 1;            /*!< Continuously assert the most recent OUT/SET to the pins                   */
      __IOM uint32_t INLINE_OUT_EN : 1;         /*!< If 1, use a bit of OUT data as an auxiliary write enable
                                                     When used in conjunction with OUT_STICKY, writes with an
                                                     enable of 0 will
                                                     deassert the latest pin write. This can create useful masking/override
                                                     behaviour
                                                     due to the priority ordering of state machine pin writes
                                                     (SM0 < SM1 < ...)                                                         */
      __IOM uint32_t OUT_EN_SEL : 5;            /*!< Which data bit to use for inline OUT enable                               */
      __IOM uint32_t JMP_PIN    : 5;            /*!< The GPIO number to use as condition for JMP PIN. Unaffected
                                                     by input mapping.                                                         */
      __IOM uint32_t SIDE_PINDIR : 1;           /*!< If 1, side-set data is asserted to pin directions, instead of
                                                     pin values                                                                */
      __IOM uint32_t SIDE_EN    : 1;            /*!< If 1, the MSB of the Delay/Side-set instruction field is used
                                                     as side-set enable, rather than a side-set data bit. This
                                                     allows instructions to perform side-set optionally, rather
                                                     than on every instruction, but the maximum possible side-set
                                                     width is reduced from 5 to 4. Note that the value of PINCTRL_SIDESET_COUN
                                                     is inclusive of this enable bit.                                          */
      __IM  uint32_t EXEC_STALLED : 1;          /*!< If 1, an instruction written to SMx_INSTR is stalled, and latched
                                                     by the state machine. Will clear to 0 once this instruction
                                                     completes.                                                                */
    } SM0_EXECCTRL_b;
  } ;

  union {
    __IOM uint32_t SM0_SHIFTCTRL;               /*!< Control behaviour of the input/output shift registers for state
                                                     machine 0                                                                 */

