mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t FRAC       : 8;            /*!< Fractional part of clock divisor                                          */
      __IOM uint32_t INT        : 16;           /*!< Effective frequency is sysclk/(int + frac/256).
                                                     Value of 0 is interpreted as 65536. If INT is 0, FRAC must
                                                     also be 0.                                                                */
    } SM1_CLKDIV_b;
  } ;

  union {
    __IOM uint32_t SM1_EXECCTRL;                /*!< Execution/behavioural settings for state machine 1                        */

    struct {
      __IOM uint32_t STATUS_N   : 4;            /*!< Comparison level for the MOV x, STATUS instruction                        */
      __IOM uint32_t STATUS_SEL : 1;            /*!< Comparison used for the MOV x, STATUS instruction.                        */
            uint32_t            : 2;
      __IOM uint32_t WRAP_BOTTOM : 5;           /*!< After reaching wrap_top, execution is wrapped to this address.            */
      __IOM uint32_t WRAP_TOP   : 5;            /*!< After reaching this address, execution is wrapped to wrap_bottom.
                                                     If the instruction is a jump, and the jump condition is
                                                     true, the jump takes priority.                                            */
      __IOM uint32_t OUT_STICKY : 1;            /*!< Continuously assert the most recent OUT/SET to the pins                   */
      __IOM uint32_t INLINE_OUT_EN : 1;         /*!< If 1, use a bit of OUT data as an auxiliary write enable
                                                     When used in conjunction with OUT_STICKY, writes with an
                                                     enable of 0 will
                                                     deassert the latest pin write. This can create useful masking/override
                                                     behaviour
                                                     due to the priority ordering of state machine pin writes
                                                     (SM0 < SM1 < ...)                                                         */
      __IOM uint32_t OUT_EN_SEL : 5;            /*!< Which data bit to use for inline OUT enable                               */
      __IOM uint32_t JMP_PIN    : 5;            /*!< The GPIO number to use as condition for JMP PIN. Unaffected
                                                     by input mapping.                                                         */
      __IOM uint32_t SIDE_PINDIR : 1;           /*!< If 1, side-set data is asserted to pin directions, instead of
                                                     pin values                                                                */
      __IOM uint32_t SIDE_EN    : 1;            /*!< If 1, the MSB of the Delay/Side-set instruction field is used
                                                     as side-set enable, rather than a side-set data bit. This
                                                     allows instructions to perform side-set optionally, rather
                                                     than on every instruction, but the maximum possible side-set
                                                     width is reduced from 5 to 4. Note that the value of PINCTRL_SIDESET_COUN
                                                     is inclusive of this enable bit.                                          */
      __IM  uint32_t EXEC_STALLED : 1;          /*!< If 1, an instruction written to SMx_INSTR is stalled, and latched
                                                     by the state machine. Will clear to 0 once this instruction
                                                     completes.                                                                */
    } SM1_EXECCTRL_b;
  } ;

  union {
    __IOM uint32_t SM1_SHIFTCTRL;               /*!< Control behaviour of the input/output shift registers for state
                                                     machine 1                                                                 */

    struct {
            uint32_t            : 16;
      __IOM uint32_t AUTOPUSH   : 1;            /*!< Push automatically when the input shift register is filled,
                                                     i.e. on an IN instruction which causes the input shift
                                                     counter to reach or exceed PUSH_THRESH.                                   */
      __IOM uint32_t AUTOPULL   : 1;            /*!< Pull automatically when the output shift register is emptied,
                                                     i.e. on or following an OUT instruction which causes the
                                                     output shift counter to reach or exceed PULL_THRESH.                      */
      __IOM uint32_t IN_SHIFTDIR : 1;           /*!< 1 = shift input shift register to right (data enters from left).
                                                     0 = to left.                                                              */
      __IOM uint32_t OUT_SHIFTDIR : 1;          /*!< 1 = shift out of output shift register to right. 0 = to left.             */
      __IOM uint32_t PUSH_THRESH : 5;           /*!< Number of bits shifted into ISR before autopush, or conditional
                                                     push (PUSH IFFULL), will take place.
                                                     Write 0 for value of 32.                                                  */
      __IOM uint32_t PULL_THRESH : 5;           /*!< Number of bits shifted out of OSR before autopull, or conditional
                                                     pull (PULL IFEMPTY), will take place.
                                                     Write 0 for value of 32.                                                  */
      __IOM uint32_t FJOIN_TX   : 1;            /*!< When 1, TX FIFO steals the RX FIFO's storage, and becomes twice
                                                     as deep.
                                                     RX FIFO is disabled as a result (always reads as both full
                                                     and empty).
                                                     FIFOs are flushed when this bit is changed.                               */
      __IOM uint32_t FJOIN_RX   : 1;            /*!< When 1, RX FIFO steals the TX FIFO's storage, and becomes twice
                                                     as deep.
                                                     TX FIFO is disabled as a result (always reads as both full
                                                     and empty).
                                                     FIFOs are flushed when this bit is changed.                               */
    } SM1_SHIFTCTRL_b;
  } ;

  union {
    __IOM uint32_t SM1_ADDR;                    /*!< Current instruction address of state machine 1                            */

