mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t SM1_ADDR   : 5;            /*!< SM1_ADDR                                                                  */
            uint32_t            : 27;
    } SM1_ADDR_b;
  } ;

  union {
    __IOM uint32_t SM1_INSTR;                   /*!< Read to see the instruction currently addressed by state machine
                                                     1's program counter
                                                     Write to execute an instruction immediately (including
                                                     jumps) and then resume execution.                                         */

    struct {
      __IOM uint32_t SM1_INSTR  : 16;           /*!< SM1_INSTR                                                                 */
            uint32_t            : 16;
    } SM1_INSTR_b;
  } ;

  union {
    __IOM uint32_t SM1_PINCTRL;                 /*!< State machine pin control                                                 */

    struct {
      __IOM uint32_t OUT_BASE   : 5;            /*!< The lowest-numbered pin that will be affected by an OUT PINS,
                                                     OUT PINDIRS or MOV PINS instruction. The data written to
                                                     this pin will always be the least-significant bit of the
                                                     OUT or MOV data.                                                          */
      __IOM uint32_t SET_BASE   : 5;            /*!< The lowest-numbered pin that will be affected by a SET PINS
                                                     or SET PINDIRS instruction. The data written to this pin
                                                     is the least-significant bit of the SET data.                             */
      __IOM uint32_t SIDESET_BASE : 5;          /*!< The lowest-numbered pin that will be affected by a side-set
                                                     operation. The MSBs of an instruction's side-set/delay
                                                     field (up to 5, determined by SIDESET_COUNT) are used for
                                                     side-set data, with the remaining LSBs used for delay.
                                                     The least-significant bit of the side-set portion is the
                                                     bit written to this pin, with more-significant bits written
                                                     to higher-numbered pins.                                                  */
      __IOM uint32_t IN_BASE    : 5;            /*!< The pin which is mapped to the least-significant bit of a state
                                                     machine's IN data bus. Higher-numbered pins are mapped
                                                     to consecutively more-significant data bits, with a modulo
                                                     of 32 applied to pin number.                                              */
      __IOM uint32_t OUT_COUNT  : 6;            /*!< The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV
                                                     PINS instruction. In the range 0 to 32 inclusive.                         */
      __IOM uint32_t SET_COUNT  : 3;            /*!< The number of pins asserted by a SET. In the range 0 to 5 inclusive.      */
      __IOM uint32_t SIDESET_COUNT : 3;         /*!< The number of MSBs of the Delay/Side-set instruction field which
                                                     are used for side-set. Inclusive of the enable bit, if
                                                     present. Minimum of 0 (all delay bits, no side-set) and
                                                     maximum of 5 (all side-set, no delay).                                    */
    } SM1_PINCTRL_b;
  } ;

  union {
    __IOM uint32_t SM2_CLKDIV;                  /*!< Clock divisor register for state machine 2
                                                     Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256)                 */

    struct {
            uint32_t            : 8;
      __IOM uint32_t FRAC       : 8;            /*!< Fractional part of clock divisor                                          */
      __IOM uint32_t INT        : 16;           /*!< Effective frequency is sysclk/(int + frac/256).
                                                     Value of 0 is interpreted as 65536. If INT is 0, FRAC must
                                                     also be 0.                                                                */
    } SM2_CLKDIV_b;
  } ;

  union {
    __IOM uint32_t SM2_EXECCTRL;                /*!< Execution/behavioural settings for state machine 2                        */

    struct {
      __IOM uint32_t STATUS_N   : 4;            /*!< Comparison level for the MOV x, STATUS instruction                        */
      __IOM uint32_t STATUS_SEL : 1;            /*!< Comparison used for the MOV x, STATUS instruction.                        */
            uint32_t            : 2;
      __IOM uint32_t WRAP_BOTTOM : 5;           /*!< After reaching wrap_top, execution is wrapped to this address.            */
      __IOM uint32_t WRAP_TOP   : 5;            /*!< After reaching this address, execution is wrapped to wrap_bottom.
                                                     If the instruction is a jump, and the jump condition is
                                                     true, the jump takes priority.                                            */
      __IOM uint32_t OUT_STICKY : 1;            /*!< Continuously assert the most recent OUT/SET to the pins                   */
      __IOM uint32_t INLINE_OUT_EN : 1;         /*!< If 1, use a bit of OUT data as an auxiliary write enable
                                                     When used in conjunction with OUT_STICKY, writes with an
                                                     enable of 0 will
                                                     deassert the latest pin write. This can create useful masking/override
                                                     behaviour
                                                     due to the priority ordering of state machine pin writes
                                                     (SM0 < SM1 < ...)                                                         */
      __IOM uint32_t OUT_EN_SEL : 5;            /*!< Which data bit to use for inline OUT enable                               */
      __IOM uint32_t JMP_PIN    : 5;            /*!< The GPIO number to use as condition for JMP PIN. Unaffected
                                                     by input mapping.                                                         */
      __IOM uint32_t SIDE_PINDIR : 1;           /*!< If 1, side-set data is asserted to pin directions, instead of
                                                     pin values                                                                */
      __IOM uint32_t SIDE_EN    : 1;            /*!< If 1, the MSB of the Delay/Side-set instruction field is used
                                                     as side-set enable, rather than a side-set data bit. This
                                                     allows instructions to perform side-set optionally, rather
                                                     than on every instruction, but the maximum possible side-set
                                                     width is reduced from 5 to 4. Note that the value of PINCTRL_SIDESET_COUN
                                                     is inclusive of this enable bit.                                          */
      __IM  uint32_t EXEC_STALLED : 1;          /*!< If 1, an instruction written to SMx_INSTR is stalled, and latched
                                                     by the state machine. Will clear to 0 once this instruction
                                                     completes.                                                                */
    } SM2_EXECCTRL_b;
  } ;

  union {
    __IOM uint32_t SM2_SHIFTCTRL;               /*!< Control behaviour of the input/output shift registers for state
                                                     machine 2                                                                 */

