mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
            uint32_t            : 16;
      __IOM uint32_t AUTOPUSH   : 1;            /*!< Push automatically when the input shift register is filled,
                                                     i.e. on an IN instruction which causes the input shift
                                                     counter to reach or exceed PUSH_THRESH.                                   */
      __IOM uint32_t AUTOPULL   : 1;            /*!< Pull automatically when the output shift register is emptied,
                                                     i.e. on or following an OUT instruction which causes the
                                                     output shift counter to reach or exceed PULL_THRESH.                      */
      __IOM uint32_t IN_SHIFTDIR : 1;           /*!< 1 = shift input shift register to right (data enters from left).
                                                     0 = to left.                                                              */
      __IOM uint32_t OUT_SHIFTDIR : 1;          /*!< 1 = shift out of output shift register to right. 0 = to left.             */
      __IOM uint32_t PUSH_THRESH : 5;           /*!< Number of bits shifted into ISR before autopush, or conditional
                                                     push (PUSH IFFULL), will take place.
                                                     Write 0 for value of 32.                                                  */
      __IOM uint32_t PULL_THRESH : 5;           /*!< Number of bits shifted out of OSR before autopull, or conditional
                                                     pull (PULL IFEMPTY), will take place.
                                                     Write 0 for value of 32.                                                  */
      __IOM uint32_t FJOIN_TX   : 1;            /*!< When 1, TX FIFO steals the RX FIFO's storage, and becomes twice
                                                     as deep.
                                                     RX FIFO is disabled as a result (always reads as both full
                                                     and empty).
                                                     FIFOs are flushed when this bit is changed.                               */
      __IOM uint32_t FJOIN_RX   : 1;            /*!< When 1, RX FIFO steals the TX FIFO's storage, and becomes twice
                                                     as deep.
                                                     TX FIFO is disabled as a result (always reads as both full
                                                     and empty).
                                                     FIFOs are flushed when this bit is changed.                               */
    } SM2_SHIFTCTRL_b;
  } ;

  union {
    __IOM uint32_t SM2_ADDR;                    /*!< Current instruction address of state machine 2                            */

    struct {
      __IM  uint32_t SM2_ADDR   : 5;            /*!< SM2_ADDR                                                                  */
            uint32_t            : 27;
    } SM2_ADDR_b;
  } ;

  union {
    __IOM uint32_t SM2_INSTR;                   /*!< Read to see the instruction currently addressed by state machine
                                                     2's program counter
                                                     Write to execute an instruction immediately (including
                                                     jumps) and then resume execution.                                         */

    struct {
      __IOM uint32_t SM2_INSTR  : 16;           /*!< SM2_INSTR                                                                 */
            uint32_t            : 16;
    } SM2_INSTR_b;
  } ;

  union {
    __IOM uint32_t SM2_PINCTRL;                 /*!< State machine pin control                                                 */

    struct {
      __IOM uint32_t OUT_BASE   : 5;            /*!< The lowest-numbered pin that will be affected by an OUT PINS,
                                                     OUT PINDIRS or MOV PINS instruction. The data written to
                                                     this pin will always be the least-significant bit of the
                                                     OUT or MOV data.                                                          */
      __IOM uint32_t SET_BASE   : 5;            /*!< The lowest-numbered pin that will be affected by a SET PINS
                                                     or SET PINDIRS instruction. The data written to this pin
                                                     is the least-significant bit of the SET data.                             */
      __IOM uint32_t SIDESET_BASE : 5;          /*!< The lowest-numbered pin that will be affected by a side-set
                                                     operation. The MSBs of an instruction's side-set/delay
                                                     field (up to 5, determined by SIDESET_COUNT) are used for
                                                     side-set data, with the remaining LSBs used for delay.
                                                     The least-significant bit of the side-set portion is the
                                                     bit written to this pin, with more-significant bits written
                                                     to higher-numbered pins.                                                  */
      __IOM uint32_t IN_BASE    : 5;            /*!< The pin which is mapped to the least-significant bit of a state
                                                     machine's IN data bus. Higher-numbered pins are mapped
                                                     to consecutively more-significant data bits, with a modulo
                                                     of 32 applied to pin number.                                              */
      __IOM uint32_t OUT_COUNT  : 6;            /*!< The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV
                                                     PINS instruction. In the range 0 to 32 inclusive.                         */
      __IOM uint32_t SET_COUNT  : 3;            /*!< The number of pins asserted by a SET. In the range 0 to 5 inclusive.      */
      __IOM uint32_t SIDESET_COUNT : 3;         /*!< The number of MSBs of the Delay/Side-set instruction field which
                                                     are used for side-set. Inclusive of the enable bit, if
                                                     present. Minimum of 0 (all delay bits, no side-set) and
                                                     maximum of 5 (all side-set, no delay).                                    */
    } SM2_PINCTRL_b;
  } ;

  union {
    __IOM uint32_t SM3_CLKDIV;                  /*!< Clock divisor register for state machine 3
                                                     Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256)                 */

