mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t SM3_ADDR   : 5;            /*!< SM3_ADDR                                                                  */
            uint32_t            : 27;
    } SM3_ADDR_b;
  } ;

  union {
    __IOM uint32_t SM3_INSTR;                   /*!< Read to see the instruction currently addressed by state machine
                                                     3's program counter
                                                     Write to execute an instruction immediately (including
                                                     jumps) and then resume execution.                                         */

    struct {
      __IOM uint32_t SM3_INSTR  : 16;           /*!< SM3_INSTR                                                                 */
            uint32_t            : 16;
    } SM3_INSTR_b;
  } ;

  union {
    __IOM uint32_t SM3_PINCTRL;                 /*!< State machine pin control                                                 */

    struct {
      __IOM uint32_t OUT_BASE   : 5;            /*!< The lowest-numbered pin that will be affected by an OUT PINS,
                                                     OUT PINDIRS or MOV PINS instruction. The data written to
                                                     this pin will always be the least-significant bit of the
                                                     OUT or MOV data.                                                          */
      __IOM uint32_t SET_BASE   : 5;            /*!< The lowest-numbered pin that will be affected by a SET PINS
                                                     or SET PINDIRS instruction. The data written to this pin
                                                     is the least-significant bit of the SET data.                             */
      __IOM uint32_t SIDESET_BASE : 5;          /*!< The lowest-numbered pin that will be affected by a side-set
                                                     operation. The MSBs of an instruction's side-set/delay
                                                     field (up to 5, determined by SIDESET_COUNT) are used for
                                                     side-set data, with the remaining LSBs used for delay.
                                                     The least-significant bit of the side-set portion is the
                                                     bit written to this pin, with more-significant bits written
                                                     to higher-numbered pins.                                                  */
      __IOM uint32_t IN_BASE    : 5;            /*!< The pin which is mapped to the least-significant bit of a state
                                                     machine's IN data bus. Higher-numbered pins are mapped
                                                     to consecutively more-significant data bits, with a modulo
                                                     of 32 applied to pin number.                                              */
      __IOM uint32_t OUT_COUNT  : 6;            /*!< The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV
                                                     PINS instruction. In the range 0 to 32 inclusive.                         */
      __IOM uint32_t SET_COUNT  : 3;            /*!< The number of pins asserted by a SET. In the range 0 to 5 inclusive.      */
      __IOM uint32_t SIDESET_COUNT : 3;         /*!< The number of MSBs of the Delay/Side-set instruction field which
                                                     are used for side-set. Inclusive of the enable bit, if
                                                     present. Minimum of 0 (all delay bits, no side-set) and
                                                     maximum of 5 (all side-set, no delay).                                    */
    } SM3_PINCTRL_b;
  } ;

  union {
    __IOM uint32_t INTR;                        /*!< Raw Interrupts                                                            */

    struct {
      __IM  uint32_t SM0_RXNEMPTY : 1;          /*!< SM0_RXNEMPTY                                                              */
      __IM  uint32_t SM1_RXNEMPTY : 1;          /*!< SM1_RXNEMPTY                                                              */
      __IM  uint32_t SM2_RXNEMPTY : 1;          /*!< SM2_RXNEMPTY                                                              */
      __IM  uint32_t SM3_RXNEMPTY : 1;          /*!< SM3_RXNEMPTY                                                              */
      __IM  uint32_t SM0_TXNFULL : 1;           /*!< SM0_TXNFULL                                                               */
      __IM  uint32_t SM1_TXNFULL : 1;           /*!< SM1_TXNFULL                                                               */
      __IM  uint32_t SM2_TXNFULL : 1;           /*!< SM2_TXNFULL                                                               */
      __IM  uint32_t SM3_TXNFULL : 1;           /*!< SM3_TXNFULL                                                               */
      __IM  uint32_t SM0        : 1;            /*!< SM0                                                                       */
      __IM  uint32_t SM1        : 1;            /*!< SM1                                                                       */
      __IM  uint32_t SM2        : 1;            /*!< SM2                                                                       */
      __IM  uint32_t SM3        : 1;            /*!< SM3                                                                       */
            uint32_t            : 20;
    } INTR_b;
  } ;

  union {
    __IOM uint32_t IRQ0_INTE;                   /*!< Interrupt Enable for irq0                                                 */

    struct {
      __IOM uint32_t SM0_RXNEMPTY : 1;          /*!< SM0_RXNEMPTY                                                              */
      __IOM uint32_t SM1_RXNEMPTY : 1;          /*!< SM1_RXNEMPTY                                                              */
      __IOM uint32_t SM2_RXNEMPTY : 1;          /*!< SM2_RXNEMPTY                                                              */
      __IOM uint32_t SM3_RXNEMPTY : 1;          /*!< SM3_RXNEMPTY                                                              */
      __IOM uint32_t SM0_TXNFULL : 1;           /*!< SM0_TXNFULL                                                               */
      __IOM uint32_t SM1_TXNFULL : 1;           /*!< SM1_TXNFULL                                                               */
      __IOM uint32_t SM2_TXNFULL : 1;           /*!< SM2_TXNFULL                                                               */
      __IOM uint32_t SM3_TXNFULL : 1;           /*!< SM3_TXNFULL                                                               */
      __IOM uint32_t SM0        : 1;            /*!< SM0                                                                       */
      __IOM uint32_t SM1        : 1;            /*!< SM1                                                                       */
      __IOM uint32_t SM2        : 1;            /*!< SM2                                                                       */
      __IOM uint32_t SM3        : 1;            /*!< SM3                                                                       */
            uint32_t            : 20;
    } IRQ0_INTE_b;
  } ;

  union {
    __IOM uint32_t IRQ0_INTF;                   /*!< Interrupt Force for irq0                                                  */

