mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t SM0_RXNEMPTY : 1;          /*!< SM0_RXNEMPTY                                                              */
      __IOM uint32_t SM1_RXNEMPTY : 1;          /*!< SM1_RXNEMPTY                                                              */
      __IOM uint32_t SM2_RXNEMPTY : 1;          /*!< SM2_RXNEMPTY                                                              */
      __IOM uint32_t SM3_RXNEMPTY : 1;          /*!< SM3_RXNEMPTY                                                              */
      __IOM uint32_t SM0_TXNFULL : 1;           /*!< SM0_TXNFULL                                                               */
      __IOM uint32_t SM1_TXNFULL : 1;           /*!< SM1_TXNFULL                                                               */
      __IOM uint32_t SM2_TXNFULL : 1;           /*!< SM2_TXNFULL                                                               */
      __IOM uint32_t SM3_TXNFULL : 1;           /*!< SM3_TXNFULL                                                               */
      __IOM uint32_t SM0        : 1;            /*!< SM0                                                                       */
      __IOM uint32_t SM1        : 1;            /*!< SM1                                                                       */
      __IOM uint32_t SM2        : 1;            /*!< SM2                                                                       */
      __IOM uint32_t SM3        : 1;            /*!< SM3                                                                       */
            uint32_t            : 20;
    } IRQ0_INTF_b;
  } ;

  union {
    __IOM uint32_t IRQ0_INTS;                   /*!< Interrupt status after masking & forcing for irq0                         */

    struct {
      __IM  uint32_t SM0_RXNEMPTY : 1;          /*!< SM0_RXNEMPTY                                                              */
      __IM  uint32_t SM1_RXNEMPTY : 1;          /*!< SM1_RXNEMPTY                                                              */
      __IM  uint32_t SM2_RXNEMPTY : 1;          /*!< SM2_RXNEMPTY                                                              */
      __IM  uint32_t SM3_RXNEMPTY : 1;          /*!< SM3_RXNEMPTY                                                              */
      __IM  uint32_t SM0_TXNFULL : 1;           /*!< SM0_TXNFULL                                                               */
      __IM  uint32_t SM1_TXNFULL : 1;           /*!< SM1_TXNFULL                                                               */
      __IM  uint32_t SM2_TXNFULL : 1;           /*!< SM2_TXNFULL                                                               */
      __IM  uint32_t SM3_TXNFULL : 1;           /*!< SM3_TXNFULL                                                               */
      __IM  uint32_t SM0        : 1;            /*!< SM0                                                                       */
      __IM  uint32_t SM1        : 1;            /*!< SM1                                                                       */
      __IM  uint32_t SM2        : 1;            /*!< SM2                                                                       */
      __IM  uint32_t SM3        : 1;            /*!< SM3                                                                       */
            uint32_t            : 20;
    } IRQ0_INTS_b;
  } ;

  union {
    __IOM uint32_t IRQ1_INTE;                   /*!< Interrupt Enable for irq1                                                 */

    struct {
      __IOM uint32_t SM0_RXNEMPTY : 1;          /*!< SM0_RXNEMPTY                                                              */
      __IOM uint32_t SM1_RXNEMPTY : 1;          /*!< SM1_RXNEMPTY                                                              */
      __IOM uint32_t SM2_RXNEMPTY : 1;          /*!< SM2_RXNEMPTY                                                              */
      __IOM uint32_t SM3_RXNEMPTY : 1;          /*!< SM3_RXNEMPTY                                                              */
      __IOM uint32_t SM0_TXNFULL : 1;           /*!< SM0_TXNFULL                                                               */
      __IOM uint32_t SM1_TXNFULL : 1;           /*!< SM1_TXNFULL                                                               */
      __IOM uint32_t SM2_TXNFULL : 1;           /*!< SM2_TXNFULL                                                               */
      __IOM uint32_t SM3_TXNFULL : 1;           /*!< SM3_TXNFULL                                                               */
      __IOM uint32_t SM0        : 1;            /*!< SM0                                                                       */
      __IOM uint32_t SM1        : 1;            /*!< SM1                                                                       */
      __IOM uint32_t SM2        : 1;            /*!< SM2                                                                       */
      __IOM uint32_t SM3        : 1;            /*!< SM3                                                                       */
            uint32_t            : 20;
    } IRQ1_INTE_b;
  } ;

  union {
    __IOM uint32_t IRQ1_INTF;                   /*!< Interrupt Force for irq1                                                  */

    struct {
      __IOM uint32_t SM0_RXNEMPTY : 1;          /*!< SM0_RXNEMPTY                                                              */
      __IOM uint32_t SM1_RXNEMPTY : 1;          /*!< SM1_RXNEMPTY                                                              */
      __IOM uint32_t SM2_RXNEMPTY : 1;          /*!< SM2_RXNEMPTY                                                              */
      __IOM uint32_t SM3_RXNEMPTY : 1;          /*!< SM3_RXNEMPTY                                                              */
      __IOM uint32_t SM0_TXNFULL : 1;           /*!< SM0_TXNFULL                                                               */
      __IOM uint32_t SM1_TXNFULL : 1;           /*!< SM1_TXNFULL                                                               */
      __IOM uint32_t SM2_TXNFULL : 1;           /*!< SM2_TXNFULL                                                               */
      __IOM uint32_t SM3_TXNFULL : 1;           /*!< SM3_TXNFULL                                                               */
      __IOM uint32_t SM0        : 1;            /*!< SM0                                                                       */
      __IOM uint32_t SM1        : 1;            /*!< SM1                                                                       */
      __IOM uint32_t SM2        : 1;            /*!< SM2                                                                       */
      __IOM uint32_t SM3        : 1;            /*!< SM3                                                                       */
            uint32_t            : 20;
    } IRQ1_INTF_b;
  } ;

  union {
    __IOM uint32_t IRQ1_INTS;                   /*!< Interrupt status after masking & forcing for irq1                         */

