mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t SM0_RXNEMPTY : 1;          /*!< SM0_RXNEMPTY                                                              */
      __IM  uint32_t SM1_RXNEMPTY : 1;          /*!< SM1_RXNEMPTY                                                              */
      __IM  uint32_t SM2_RXNEMPTY : 1;          /*!< SM2_RXNEMPTY                                                              */
      __IM  uint32_t SM3_RXNEMPTY : 1;          /*!< SM3_RXNEMPTY                                                              */
      __IM  uint32_t SM0_TXNFULL : 1;           /*!< SM0_TXNFULL                                                               */
      __IM  uint32_t SM1_TXNFULL : 1;           /*!< SM1_TXNFULL                                                               */
      __IM  uint32_t SM2_TXNFULL : 1;           /*!< SM2_TXNFULL                                                               */
      __IM  uint32_t SM3_TXNFULL : 1;           /*!< SM3_TXNFULL                                                               */
      __IM  uint32_t SM0        : 1;            /*!< SM0                                                                       */
      __IM  uint32_t SM1        : 1;            /*!< SM1                                                                       */
      __IM  uint32_t SM2        : 1;            /*!< SM2                                                                       */
      __IM  uint32_t SM3        : 1;            /*!< SM3                                                                       */
            uint32_t            : 20;
    } IRQ1_INTS_b;
  } ;
} PIO0_Type;                                    /*!< Size = 324 (0x144)                                                        */



/* =========================================================================================================================== */
/* ================                                            SIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Single-cycle IO block
        Provides core-local and inter-core hardware for the two processors, with single-cycle access. (SIO)
  */

typedef struct {                                /*!< SIO Structure                                                             */
  __IM  uint32_t  CPUID;                        /*!< Processor core identifier
                                                     Value is 0 when read from processor core 0, and 1 when
                                                     read from processor core 1.                                               */

  union {
    __IOM uint32_t GPIO_IN;                     /*!< Input value for GPIO pins                                                 */

    struct {
      __IM  uint32_t GPIO_IN    : 30;           /*!< Input value for GPIO0...29                                                */
            uint32_t            : 2;
    } GPIO_IN_b;
  } ;

  union {
    __IOM uint32_t GPIO_HI_IN;                  /*!< Input value for QSPI pins                                                 */

    struct {
      __IM  uint32_t GPIO_HI_IN : 6;            /*!< Input value on QSPI IO in order 0..5: SCLK, SSn, SD0, SD1, SD2,
                                                     SD3                                                                       */
            uint32_t            : 26;
    } GPIO_HI_IN_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t GPIO_OUT;                    /*!< GPIO output value                                                         */

    struct {
      __IOM uint32_t GPIO_OUT   : 30;           /*!< Set output level (1/0 -> high/low) for GPIO0...29.
                                                     Reading back gives the last value written, NOT the input
                                                     value from the pins.
                                                     If core 0 and core 1 both write to GPIO_OUT simultaneously
                                                     (or to a SET/CLR/XOR alias),
                                                     the result is as though the write from core 0 took place
                                                     first,
                                                     and the write from core 1 was then applied to that intermediate
                                                     result.                                                                   */
            uint32_t            : 2;
    } GPIO_OUT_b;
  } ;

  union {
    __IOM uint32_t GPIO_OUT_SET;                /*!< GPIO output value set                                                     */

    struct {
      __OM  uint32_t GPIO_OUT_SET : 30;         /*!< Perform an atomic bit-set on GPIO_OUT, i.e. `GPIO_OUT |= wdata`           */
            uint32_t            : 2;
    } GPIO_OUT_SET_b;
  } ;

  union {
    __IOM uint32_t GPIO_OUT_CLR;                /*!< GPIO output value clear                                                   */

    struct {
      __OM  uint32_t GPIO_OUT_CLR : 30;         /*!< Perform an atomic bit-clear on GPIO_OUT, i.e. `GPIO_OUT &= ~wdata`        */
            uint32_t            : 2;
    } GPIO_OUT_CLR_b;
  } ;

  union {
    __IOM uint32_t GPIO_OUT_XOR;                /*!< GPIO output value XOR                                                     */

    struct {
      __OM  uint32_t GPIO_OUT_XOR : 30;         /*!< Perform an atomic bitwise XOR on GPIO_OUT, i.e. `GPIO_OUT ^=
                                                     wdata`                                                                    */
            uint32_t            : 2;
    } GPIO_OUT_XOR_b;
  } ;

  union {
    __IOM uint32_t GPIO_OE;                     /*!< GPIO output enable                                                        */

