mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t GPIO_OE    : 30;           /*!< Set output enable (1/0 -> output/input) for GPIO0...29.
                                                     Reading back gives the last value written.
                                                     If core 0 and core 1 both write to GPIO_OE simultaneously
                                                     (or to a SET/CLR/XOR alias),
                                                     the result is as though the write from core 0 took place
                                                     first,
                                                     and the write from core 1 was then applied to that intermediate
                                                     result.                                                                   */
            uint32_t            : 2;
    } GPIO_OE_b;
  } ;

  union {
    __IOM uint32_t GPIO_OE_SET;                 /*!< GPIO output enable set                                                    */

    struct {
      __OM  uint32_t GPIO_OE_SET : 30;          /*!< Perform an atomic bit-set on GPIO_OE, i.e. `GPIO_OE |= wdata`             */
            uint32_t            : 2;
    } GPIO_OE_SET_b;
  } ;

  union {
    __IOM uint32_t GPIO_OE_CLR;                 /*!< GPIO output enable clear                                                  */

    struct {
      __OM  uint32_t GPIO_OE_CLR : 30;          /*!< Perform an atomic bit-clear on GPIO_OE, i.e. `GPIO_OE &= ~wdata`          */
            uint32_t            : 2;
    } GPIO_OE_CLR_b;
  } ;

  union {
    __IOM uint32_t GPIO_OE_XOR;                 /*!< GPIO output enable XOR                                                    */

    struct {
      __OM  uint32_t GPIO_OE_XOR : 30;          /*!< Perform an atomic bitwise XOR on GPIO_OE, i.e. `GPIO_OE ^= wdata`         */
            uint32_t            : 2;
    } GPIO_OE_XOR_b;
  } ;

  union {
    __IOM uint32_t GPIO_HI_OUT;                 /*!< QSPI output value                                                         */

    struct {
      __IOM uint32_t GPIO_HI_OUT : 6;           /*!< Set output level (1/0 -> high/low) for QSPI IO0...5.
                                                     Reading back gives the last value written, NOT the input
                                                     value from the pins.
                                                     If core 0 and core 1 both write to GPIO_HI_OUT simultaneously
                                                     (or to a SET/CLR/XOR alias),
                                                     the result is as though the write from core 0 took place
                                                     first,
                                                     and the write from core 1 was then applied to that intermediate
                                                     result.                                                                   */
            uint32_t            : 26;
    } GPIO_HI_OUT_b;
  } ;

  union {
    __IOM uint32_t GPIO_HI_OUT_SET;             /*!< QSPI output value set                                                     */

    struct {
      __OM  uint32_t GPIO_HI_OUT_SET : 6;       /*!< Perform an atomic bit-set on GPIO_HI_OUT, i.e. `GPIO_HI_OUT
                                                     |= wdata`                                                                 */
            uint32_t            : 26;
    } GPIO_HI_OUT_SET_b;
  } ;

  union {
    __IOM uint32_t GPIO_HI_OUT_CLR;             /*!< QSPI output value clear                                                   */

    struct {
      __OM  uint32_t GPIO_HI_OUT_CLR : 6;       /*!< Perform an atomic bit-clear on GPIO_HI_OUT, i.e. `GPIO_HI_OUT
                                                     &= ~wdata`                                                                */
            uint32_t            : 26;
    } GPIO_HI_OUT_CLR_b;
  } ;

  union {
    __IOM uint32_t GPIO_HI_OUT_XOR;             /*!< QSPI output value XOR                                                     */

    struct {
      __OM  uint32_t GPIO_HI_OUT_XOR : 6;       /*!< Perform an atomic bitwise XOR on GPIO_HI_OUT, i.e. `GPIO_HI_OUT
                                                     ^= wdata`                                                                 */
            uint32_t            : 26;
    } GPIO_HI_OUT_XOR_b;
  } ;

  union {
    __IOM uint32_t GPIO_HI_OE;                  /*!< QSPI output enable                                                        */

    struct {
      __IOM uint32_t GPIO_HI_OE : 6;            /*!< Set output enable (1/0 -> output/input) for QSPI IO0...5.
                                                     Reading back gives the last value written.
                                                     If core 0 and core 1 both write to GPIO_HI_OE simultaneously
                                                     (or to a SET/CLR/XOR alias),
                                                     the result is as though the write from core 0 took place
                                                     first,
                                                     and the write from core 1 was then applied to that intermediate
                                                     result.                                                                   */
            uint32_t            : 26;
    } GPIO_HI_OE_b;
  } ;

  union {
    __IOM uint32_t GPIO_HI_OE_SET;              /*!< QSPI output enable set                                                    */

    struct {
      __OM  uint32_t GPIO_HI_OE_SET : 6;        /*!< Perform an atomic bit-set on GPIO_HI_OE, i.e. `GPIO_HI_OE |=
                                                     wdata`                                                                    */
            uint32_t            : 26;
    } GPIO_HI_OE_SET_b;
  } ;

  union {
    __IOM uint32_t GPIO_HI_OE_CLR;              /*!< QSPI output enable clear                                                  */

