mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __OM  uint32_t GPIO_HI_OE_CLR : 6;        /*!< Perform an atomic bit-clear on GPIO_HI_OE, i.e. `GPIO_HI_OE
                                                     &= ~wdata`                                                                */
            uint32_t            : 26;
    } GPIO_HI_OE_CLR_b;
  } ;

  union {
    __IOM uint32_t GPIO_HI_OE_XOR;              /*!< QSPI output enable XOR                                                    */

    struct {
      __OM  uint32_t GPIO_HI_OE_XOR : 6;        /*!< Perform an atomic bitwise XOR on GPIO_HI_OE, i.e. `GPIO_HI_OE
                                                     ^= wdata`                                                                 */
            uint32_t            : 26;
    } GPIO_HI_OE_XOR_b;
  } ;

  union {
    __IOM uint32_t FIFO_ST;                     /*!< Status register for inter-core FIFOs (mailboxes).
                                                     There is one FIFO in the core 0 -> core 1 direction, and
                                                     one core 1 -> core 0. Both are 32 bits wide and 8 words
                                                     deep.
                                                     Core 0 can see the read side of the 1->0 FIFO (RX), and
                                                     the write side of 0->1 FIFO (TX).
                                                     Core 1 can see the read side of the 0->1 FIFO (RX), and
                                                     the write side of 1->0 FIFO (TX).
                                                     The SIO IRQ for each core is the logical OR of the VLD,
                                                     WOF and ROE fields of its FIFO_ST register.                               */

    struct {
      __IM  uint32_t VLD        : 1;            /*!< Value is 1 if this core's RX FIFO is not empty (i.e. if FIFO_RD
                                                     is valid)                                                                 */
      __IM  uint32_t RDY        : 1;            /*!< Value is 1 if this core's TX FIFO is not full (i.e. if FIFO_WR
                                                     is ready for more data)                                                   */
      __IOM uint32_t WOF        : 1;            /*!< Sticky flag indicating the TX FIFO was written when full. This
                                                     write was ignored by the FIFO.                                            */
      __IOM uint32_t ROE        : 1;            /*!< Sticky flag indicating the RX FIFO was read when empty. This
                                                     read was ignored by the FIFO.                                             */
            uint32_t            : 28;
    } FIFO_ST_b;
  } ;
  __OM  uint32_t  FIFO_WR;                      /*!< Write access to this core's TX FIFO                                       */
  __IM  uint32_t  FIFO_RD;                      /*!< Read access to this core's RX FIFO                                        */
  __IM  uint32_t  SPINLOCK_ST;                  /*!< Spinlock state
                                                     A bitmap containing the state of all 32 spinlocks (1=locked).
                                                     Mainly intended for debugging.                                            */
  __IOM uint32_t  DIV_UDIVIDEND;                /*!< Divider unsigned dividend
                                                     Write to the DIVIDEND operand of the divider, i.e. the
                                                     p in `p / q`.
                                                     Any operand write starts a new calculation. The results
                                                     appear in QUOTIENT, REMAINDER.
                                                     UDIVIDEND/SDIVIDEND are aliases of the same internal register.
                                                     The U alias starts an
                                                     unsigned calculation, and the S alias starts a signed calculation.        */
  __IOM uint32_t  DIV_UDIVISOR;                 /*!< Divider unsigned divisor
                                                     Write to the DIVISOR operand of the divider, i.e. the q
                                                     in `p / q`.
                                                     Any operand write starts a new calculation. The results
                                                     appear in QUOTIENT, REMAINDER.
                                                     UDIVISOR/SDIVISOR are aliases of the same internal register.
                                                     The U alias starts an
                                                     unsigned calculation, and the S alias starts a signed calculation.        */
  __IOM uint32_t  DIV_SDIVIDEND;                /*!< Divider signed dividend
                                                     The same as UDIVIDEND, but starts a signed calculation,
                                                     rather than unsigned.                                                     */
  __IOM uint32_t  DIV_SDIVISOR;                 /*!< Divider signed divisor
                                                     The same as UDIVISOR, but starts a signed calculation,
                                                     rather than unsigned.                                                     */
  __IOM uint32_t  DIV_QUOTIENT;                 /*!< Divider result quotient
                                                     The result of `DIVIDEND / DIVISOR` (division). Contents
                                                     undefined while CSR_READY is low.
                                                     For signed calculations, QUOTIENT is negative when the
                                                     signs of DIVIDEND and DIVISOR differ.
                                                     This register can be written to directly, for context save/restore
                                                     purposes. This halts any
                                                     in-progress calculation and sets the CSR_READY and CSR_DIRTY
                                                     flags.
                                                     Reading from QUOTIENT clears the CSR_DIRTY flag, so should
                                                     read results in the order
                                                     REMAINDER, QUOTIENT if CSR_DIRTY is used.                                 */
  __IOM uint32_t  DIV_REMAINDER;                /*!< Divider result remainder
                                                     The result of `DIVIDEND % DIVISOR` (modulo). Contents undefined
                                                     while CSR_READY is low.
                                                     For signed calculations, REMAINDER is negative only when
                                                     DIVIDEND is negative.
                                                     This register can be written to directly, for context save/restore
                                                     purposes. This halts any
                                                     in-progress calculation and sets the CSR_READY and CSR_DIRTY
                                                     flags.                                                                    */

  union {
    __IOM uint32_t DIV_CSR;                     /*!< Control and status register for divider.                                  */

