mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IM  uint32_t READY      : 1;            /*!< Reads as 0 when a calculation is in progress, 1 otherwise.
                                                     Writing an operand (xDIVIDEND, xDIVISOR) will immediately
                                                     start a new calculation, no
                                                     matter if one is already in progress.
                                                     Writing to a result register will immediately terminate
                                                     any in-progress calculation
                                                     and set the READY and DIRTY flags.                                        */
      __IM  uint32_t DIRTY      : 1;            /*!< Changes to 1 when any register is written, and back to 0 when
                                                     QUOTIENT is read.
                                                     Software can use this flag to make save/restore more efficient
                                                     (skip if not DIRTY).
                                                     If the flag is used in this way, it's recommended to either
                                                     read QUOTIENT only,
                                                     or REMAINDER and then QUOTIENT, to prevent data loss on
                                                     context switch.                                                           */
            uint32_t            : 30;
    } DIV_CSR_b;
  } ;
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  INTERP0_ACCUM0;               /*!< Read/write access to accumulator 0                                        */
  __IOM uint32_t  INTERP0_ACCUM1;               /*!< Read/write access to accumulator 1                                        */
  __IOM uint32_t  INTERP0_BASE0;                /*!< Read/write access to BASE0 register.                                      */
  __IOM uint32_t  INTERP0_BASE1;                /*!< Read/write access to BASE1 register.                                      */
  __IOM uint32_t  INTERP0_BASE2;                /*!< Read/write access to BASE2 register.                                      */
  __IM  uint32_t  INTERP0_POP_LANE0;            /*!< Read LANE0 result, and simultaneously write lane results to
                                                     both accumulators (POP).                                                  */
  __IM  uint32_t  INTERP0_POP_LANE1;            /*!< Read LANE1 result, and simultaneously write lane results to
                                                     both accumulators (POP).                                                  */
  __IM  uint32_t  INTERP0_POP_FULL;             /*!< Read FULL result, and simultaneously write lane results to both
                                                     accumulators (POP).                                                       */
  __IM  uint32_t  INTERP0_PEEK_LANE0;           /*!< Read LANE0 result, without altering any internal state (PEEK).            */
  __IM  uint32_t  INTERP0_PEEK_LANE1;           /*!< Read LANE1 result, without altering any internal state (PEEK).            */
  __IM  uint32_t  INTERP0_PEEK_FULL;            /*!< Read FULL result, without altering any internal state (PEEK).             */

  union {
    __IOM uint32_t INTERP0_CTRL_LANE0;          /*!< Control register for lane 0                                               */

    struct {
      __IOM uint32_t SHIFT      : 5;            /*!< Logical right-shift applied to accumulator before masking                 */
      __IOM uint32_t MASK_LSB   : 5;            /*!< The least-significant bit allowed to pass by the mask (inclusive)         */
      __IOM uint32_t MASK_MSB   : 5;            /*!< The most-significant bit allowed to pass by the mask (inclusive)
                                                     Setting MSB < LSB may cause chip to turn inside-out                       */
      __IOM uint32_t SIGNED     : 1;            /*!< If SIGNED is set, the shifted and masked accumulator value is
                                                     sign-extended to 32 bits
                                                     before adding to BASE0, and LANE0 PEEK/POP appear extended
                                                     to 32 bits when read by processor.                                        */
      __IOM uint32_t CROSS_INPUT : 1;           /*!< If 1, feed the opposite lane's accumulator into this lane's
                                                     shift + mask hardware.
                                                     Takes effect even if ADD_RAW is set (the CROSS_INPUT mux
                                                     is before the shift+mask bypass)                                          */
      __IOM uint32_t CROSS_RESULT : 1;          /*!< If 1, feed the opposite lane's result into this lane's accumulator
                                                     on POP.                                                                   */
      __IOM uint32_t ADD_RAW    : 1;            /*!< If 1, mask + shift is bypassed for LANE0 result. This does not
                                                     affect FULL result.                                                       */
      __IOM uint32_t FORCE_MSB  : 2;            /*!< ORed into bits 29:28 of the lane result presented to the processor
                                                     on the bus.
                                                     No effect on the internal 32-bit datapath. Handy for using
                                                     a lane to generate sequence
                                                     of pointers into flash or SRAM.                                           */
      __IOM uint32_t BLEND      : 1;            /*!< Only present on INTERP0 on each core. If BLEND mode is enabled:
                                                     - LANE1 result is a linear interpolation between BASE0
                                                     and BASE1, controlled
                                                     by the 8 LSBs of lane 1 shift and mask value (a fractional
                                                     number between
                                                     0 and 255/256ths)
                                                     - LANE0 result does not have BASE0 added (yields only the
                                                     8 LSBs of lane 1 shift+mask value)
                                                     - FULL result does not have lane 1 shift+mask value added
                                                     (BASE2 + lane 0 shift+mask)
                                                     LANE1 SIGNED flag controls whether the interpolation is
                                                     signed or unsigned.                                                       */
            uint32_t            : 1;
      __IM  uint32_t OVERF0     : 1;            /*!< Indicates if any masked-off MSBs in ACCUM0 are set.                       */
      __IM  uint32_t OVERF1     : 1;            /*!< Indicates if any masked-off MSBs in ACCUM1 are set.                       */
      __IM  uint32_t OVERF      : 1;            /*!< Set if either OVERF0 or OVERF1 is set.                                    */
            uint32_t            : 6;
    } INTERP0_CTRL_LANE0_b;
  } ;

  union {
    __IOM uint32_t INTERP0_CTRL_LANE1;          /*!< Control register for lane 1                                               */

