mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t SHIFT      : 5;            /*!< Logical right-shift applied to accumulator before masking                 */
      __IOM uint32_t MASK_LSB   : 5;            /*!< The least-significant bit allowed to pass by the mask (inclusive)         */
      __IOM uint32_t MASK_MSB   : 5;            /*!< The most-significant bit allowed to pass by the mask (inclusive)
                                                     Setting MSB < LSB may cause chip to turn inside-out                       */
      __IOM uint32_t SIGNED     : 1;            /*!< If SIGNED is set, the shifted and masked accumulator value is
                                                     sign-extended to 32 bits
                                                     before adding to BASE1, and LANE1 PEEK/POP appear extended
                                                     to 32 bits when read by processor.                                        */
      __IOM uint32_t CROSS_INPUT : 1;           /*!< If 1, feed the opposite lane's accumulator into this lane's
                                                     shift + mask hardware.
                                                     Takes effect even if ADD_RAW is set (the CROSS_INPUT mux
                                                     is before the shift+mask bypass)                                          */
      __IOM uint32_t CROSS_RESULT : 1;          /*!< If 1, feed the opposite lane's result into this lane's accumulator
                                                     on POP.                                                                   */
      __IOM uint32_t ADD_RAW    : 1;            /*!< If 1, mask + shift is bypassed for LANE1 result. This does not
                                                     affect FULL result.                                                       */
      __IOM uint32_t FORCE_MSB  : 2;            /*!< ORed into bits 29:28 of the lane result presented to the processor
                                                     on the bus.
                                                     No effect on the internal 32-bit datapath. Handy for using
                                                     a lane to generate sequence
                                                     of pointers into flash or SRAM.                                           */
            uint32_t            : 11;
    } INTERP0_CTRL_LANE1_b;
  } ;

  union {
    __IOM uint32_t INTERP0_ACCUM0_ADD;          /*!< Values written here are atomically added to ACCUM0
                                                     Reading yields lane 0's raw shift and mask value (BASE0
                                                     not added).                                                               */

    struct {
      __IOM uint32_t INTERP0_ACCUM0_ADD : 24;   /*!< INTERP0_ACCUM0_ADD                                                        */
            uint32_t            : 8;
    } INTERP0_ACCUM0_ADD_b;
  } ;

  union {
    __IOM uint32_t INTERP0_ACCUM1_ADD;          /*!< Values written here are atomically added to ACCUM1
                                                     Reading yields lane 1's raw shift and mask value (BASE1
                                                     not added).                                                               */

    struct {
      __IOM uint32_t INTERP0_ACCUM1_ADD : 24;   /*!< INTERP0_ACCUM1_ADD                                                        */
            uint32_t            : 8;
    } INTERP0_ACCUM1_ADD_b;
  } ;
  __OM  uint32_t  INTERP0_BASE_1AND0;           /*!< On write, the lower 16 bits go to BASE0, upper bits to BASE1
                                                     simultaneously.
                                                     Each half is sign-extended to 32 bits if that lane's SIGNED
                                                     flag is set.                                                              */
  __IOM uint32_t  INTERP1_ACCUM0;               /*!< Read/write access to accumulator 0                                        */
  __IOM uint32_t  INTERP1_ACCUM1;               /*!< Read/write access to accumulator 1                                        */
  __IOM uint32_t  INTERP1_BASE0;                /*!< Read/write access to BASE0 register.                                      */
  __IOM uint32_t  INTERP1_BASE1;                /*!< Read/write access to BASE1 register.                                      */
  __IOM uint32_t  INTERP1_BASE2;                /*!< Read/write access to BASE2 register.                                      */
  __IM  uint32_t  INTERP1_POP_LANE0;            /*!< Read LANE0 result, and simultaneously write lane results to
                                                     both accumulators (POP).                                                  */
  __IM  uint32_t  INTERP1_POP_LANE1;            /*!< Read LANE1 result, and simultaneously write lane results to
                                                     both accumulators (POP).                                                  */
  __IM  uint32_t  INTERP1_POP_FULL;             /*!< Read FULL result, and simultaneously write lane results to both
                                                     accumulators (POP).                                                       */
  __IM  uint32_t  INTERP1_PEEK_LANE0;           /*!< Read LANE0 result, without altering any internal state (PEEK).            */
  __IM  uint32_t  INTERP1_PEEK_LANE1;           /*!< Read LANE1 result, without altering any internal state (PEEK).            */
  __IM  uint32_t  INTERP1_PEEK_FULL;            /*!< Read FULL result, without altering any internal state (PEEK).             */

  union {
    __IOM uint32_t INTERP1_CTRL_LANE0;          /*!< Control register for lane 0                                               */

    struct {
      __IOM uint32_t SHIFT      : 5;            /*!< Logical right-shift applied to accumulator before masking                 */
      __IOM uint32_t MASK_LSB   : 5;            /*!< The least-significant bit allowed to pass by the mask (inclusive)         */
      __IOM uint32_t MASK_MSB   : 5;            /*!< The most-significant bit allowed to pass by the mask (inclusive)
                                                     Setting MSB < LSB may cause chip to turn inside-out                       */
      __IOM uint32_t SIGNED     : 1;            /*!< If SIGNED is set, the shifted and masked accumulator value is
                                                     sign-extended to 32 bits
                                                     before adding to BASE0, and LANE0 PEEK/POP appear extended
                                                     to 32 bits when read by processor.                                        */
      __IOM uint32_t CROSS_INPUT : 1;           /*!< If 1, feed the opposite lane's accumulator into this lane's
                                                     shift + mask hardware.
                                                     Takes effect even if ADD_RAW is set (the CROSS_INPUT mux
                                                     is before the shift+mask bypass)                                          */
      __IOM uint32_t CROSS_RESULT : 1;          /*!< If 1, feed the opposite lane's result into this lane's accumulator
                                                     on POP.                                                                   */
      __IOM uint32_t ADD_RAW    : 1;            /*!< If 1, mask + shift is bypassed for LANE0 result. This does not
                                                     affect FULL result.                                                       */
      __IOM uint32_t FORCE_MSB  : 2;            /*!< ORed into bits 29:28 of the lane result presented to the processor
                                                     on the bus.
                                                     No effect on the internal 32-bit datapath. Handy for using
                                                     a lane to generate sequence
                                                     of pointers into flash or SRAM.                                           */
            uint32_t            : 1;
      __IOM uint32_t CLAMP      : 1;            /*!< Only present on INTERP1 on each core. If CLAMP mode is enabled:
                                                     - LANE0 result is shifted and masked ACCUM0, clamped by
                                                     a lower bound of
                                                     BASE0 and an upper bound of BASE1.
                                                     - Signedness of these comparisons is determined by LANE0_CTRL_SIGNED      */
      __IM  uint32_t OVERF0     : 1;            /*!< Indicates if any masked-off MSBs in ACCUM0 are set.                       */
      __IM  uint32_t OVERF1     : 1;            /*!< Indicates if any masked-off MSBs in ACCUM1 are set.                       */
      __IM  uint32_t OVERF      : 1;            /*!< Set if either OVERF0 or OVERF1 is set.                                    */
            uint32_t            : 6;
    } INTERP1_CTRL_LANE0_b;
  } ;

  union {
    __IOM uint32_t INTERP1_CTRL_LANE1;          /*!< Control register for lane 1                                               */

