mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t SHIFT      : 5;            /*!< Logical right-shift applied to accumulator before masking                 */
      __IOM uint32_t MASK_LSB   : 5;            /*!< The least-significant bit allowed to pass by the mask (inclusive)         */
      __IOM uint32_t MASK_MSB   : 5;            /*!< The most-significant bit allowed to pass by the mask (inclusive)
                                                     Setting MSB < LSB may cause chip to turn inside-out                       */
      __IOM uint32_t SIGNED     : 1;            /*!< If SIGNED is set, the shifted and masked accumulator value is
                                                     sign-extended to 32 bits
                                                     before adding to BASE1, and LANE1 PEEK/POP appear extended
                                                     to 32 bits when read by processor.                                        */
      __IOM uint32_t CROSS_INPUT : 1;           /*!< If 1, feed the opposite lane's accumulator into this lane's
                                                     shift + mask hardware.
                                                     Takes effect even if ADD_RAW is set (the CROSS_INPUT mux
                                                     is before the shift+mask bypass)                                          */
      __IOM uint32_t CROSS_RESULT : 1;          /*!< If 1, feed the opposite lane's result into this lane's accumulator
                                                     on POP.                                                                   */
      __IOM uint32_t ADD_RAW    : 1;            /*!< If 1, mask + shift is bypassed for LANE1 result. This does not
                                                     affect FULL result.                                                       */
      __IOM uint32_t FORCE_MSB  : 2;            /*!< ORed into bits 29:28 of the lane result presented to the processor
                                                     on the bus.
                                                     No effect on the internal 32-bit datapath. Handy for using
                                                     a lane to generate sequence
                                                     of pointers into flash or SRAM.                                           */
            uint32_t            : 11;
    } INTERP1_CTRL_LANE1_b;
  } ;

  union {
    __IOM uint32_t INTERP1_ACCUM0_ADD;          /*!< Values written here are atomically added to ACCUM0
                                                     Reading yields lane 0's raw shift and mask value (BASE0
                                                     not added).                                                               */

    struct {
      __IOM uint32_t INTERP1_ACCUM0_ADD : 24;   /*!< INTERP1_ACCUM0_ADD                                                        */
            uint32_t            : 8;
    } INTERP1_ACCUM0_ADD_b;
  } ;

  union {
    __IOM uint32_t INTERP1_ACCUM1_ADD;          /*!< Values written here are atomically added to ACCUM1
                                                     Reading yields lane 1's raw shift and mask value (BASE1
                                                     not added).                                                               */

    struct {
      __IOM uint32_t INTERP1_ACCUM1_ADD : 24;   /*!< INTERP1_ACCUM1_ADD                                                        */
            uint32_t            : 8;
    } INTERP1_ACCUM1_ADD_b;
  } ;
  __OM  uint32_t  INTERP1_BASE_1AND0;           /*!< On write, the lower 16 bits go to BASE0, upper bits to BASE1
                                                     simultaneously.
                                                     Each half is sign-extended to 32 bits if that lane's SIGNED
                                                     flag is set.                                                              */
  __IOM uint32_t  SPINLOCK0;                    /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK1;                    /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK2;                    /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK3;                    /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK4;                    /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK5;                    /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK6;                    /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK7;                    /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK8;                    /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK9;                    /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK10;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK11;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK12;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK13;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK14;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK15;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK16;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK17;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK18;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK19;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK20;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK21;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK22;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK23;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK24;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK25;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

