mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK26;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK27;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK28;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK29;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK30;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
  __IOM uint32_t  SPINLOCK31;                   /*!< Reading from a spinlock address will:
                                                     - Return 0 if lock is already locked
                                                     - Otherwise return nonzero, and simultaneously claim the
                                                     lock

                                                     Writing (any value) releases the lock.
                                                     If core 0 and core 1 attempt to claim the same lock simultaneously,
                                                     core 0 wins.
                                                     The value returned on success is 0x1 << lock number.                      */
} SIO_Type;                                     /*!< Size = 384 (0x180)                                                        */



/* =========================================================================================================================== */
/* ================                                            PPB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PPB (PPB)
  */

typedef struct {                                /*!< PPB Structure                                                             */
  __IM  uint32_t  RESERVED[14340];

  union {
    __IOM uint32_t SYST_CSR;                    /*!< Use the SysTick Control and Status Register to enable the SysTick
                                                     features.                                                                 */

    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< Enable SysTick counter:
                                                     0 = Counter disabled.
                                                     1 = Counter enabled.                                                      */
      __IOM uint32_t TICKINT    : 1;            /*!< Enables SysTick exception request:
                                                     0 = Counting down to zero does not assert the SysTick exception
                                                     request.
                                                     1 = Counting down to zero to asserts the SysTick exception
                                                     request.                                                                  */
      __IOM uint32_t CLKSOURCE  : 1;            /*!< SysTick clock source. Always reads as one if SYST_CALIB reports
                                                     NOREF.
                                                     Selects the SysTick timer clock source:
                                                     0 = External reference clock.
                                                     1 = Processor clock.                                                      */
            uint32_t            : 13;
      __IM  uint32_t COUNTFLAG  : 1;            /*!< Returns 1 if timer counted to 0 since last time this was read.
                                                     Clears on read by application or debugger.                                */
            uint32_t            : 15;
    } SYST_CSR_b;
  } ;

  union {
    __IOM uint32_t SYST_RVR;                    /*!< Use the SysTick Reload Value Register to specify the start value
                                                     to load into the current value register when the counter
                                                     reaches 0. It can be any value between 0 and 0x00FFFFFF.
                                                     A start value of 0 is possible, but has no effect because
                                                     the SysTick interrupt and COUNTFLAG are activated when
                                                     counting from 1 to 0. The reset value of this register
                                                     is UNKNOWN.
                                                     To generate a multi-shot timer with a period of N processor
                                                     clock cycles, use a RELOAD value of N-1. For example, if
                                                     the SysTick interrupt is required every 100 clock pulses,
                                                     set RELOAD to 99.                                                         */

