mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t RELOAD     : 24;           /*!< Value to load into the SysTick Current Value Register when the
                                                     counter reaches 0.                                                        */
            uint32_t            : 8;
    } SYST_RVR_b;
  } ;

  union {
    __IOM uint32_t SYST_CVR;                    /*!< Use the SysTick Current Value Register to find the current value
                                                     in the register. The reset value of this register is UNKNOWN.             */

    struct {
      __IOM uint32_t CURRENT    : 24;           /*!< Reads return the current value of the SysTick counter. This
                                                     register is write-clear. Writing to it with any value clears
                                                     the register to 0. Clearing this register also clears the
                                                     COUNTFLAG bit of the SysTick Control and Status Register.                 */
            uint32_t            : 8;
    } SYST_CVR_b;
  } ;

  union {
    __IOM uint32_t SYST_CALIB;                  /*!< Use the SysTick Calibration Value Register to enable software
                                                     to scale to any required speed using divide and multiply.                 */

    struct {
      __IM  uint32_t TENMS      : 24;           /*!< An optional Reload value to be used for 10ms (100Hz) timing,
                                                     subject to system clock skew errors. If the value reads
                                                     as 0, the calibration value is not known.                                 */
            uint32_t            : 6;
      __IM  uint32_t SKEW       : 1;            /*!< If reads as 1, the calibration value for 10ms is inexact (due
                                                     to clock frequency).                                                      */
      __IM  uint32_t NOREF      : 1;            /*!< If reads as 1, the Reference clock is not provided - the CLKSOURCE
                                                     bit of the SysTick Control and Status register will be
                                                     forced to 1 and cannot be cleared to 0.                                   */
    } SYST_CALIB_b;
  } ;
  __IM  uint32_t  RESERVED1[56];

  union {
    __IOM uint32_t NVIC_ISER;                   /*!< Use the Interrupt Set-Enable Register to enable interrupts and
                                                     determine which interrupts are currently enabled.
                                                     If a pending interrupt is enabled, the NVIC activates the
                                                     interrupt based on its priority. If an interrupt is not
                                                     enabled, asserting its interrupt signal changes the interrupt
                                                     state to pending, but the NVIC never activates the interrupt,
                                                     regardless of its priority.                                               */

    struct {
      __IOM uint32_t SETENA     : 32;           /*!< Interrupt set-enable bits.
                                                     Write:
                                                     0 = No effect.
                                                     1 = Enable interrupt.
                                                     Read:
                                                     0 = Interrupt disabled.
                                                     1 = Interrupt enabled.                                                    */
    } NVIC_ISER_b;
  } ;
  __IM  uint32_t  RESERVED2[31];

  union {
    __IOM uint32_t NVIC_ICER;                   /*!< Use the Interrupt Clear-Enable Registers to disable interrupts
                                                     and determine which interrupts are currently enabled.                     */

    struct {
      __IOM uint32_t CLRENA     : 32;           /*!< Interrupt clear-enable bits.
                                                     Write:
                                                     0 = No effect.
                                                     1 = Disable interrupt.
                                                     Read:
                                                     0 = Interrupt disabled.
                                                     1 = Interrupt enabled.                                                    */
    } NVIC_ICER_b;
  } ;
  __IM  uint32_t  RESERVED3[31];

  union {
    __IOM uint32_t NVIC_ISPR;                   /*!< The NVIC_ISPR forces interrupts into the pending state, and
                                                     shows which interrupts are pending.                                       */

    struct {
      __IOM uint32_t SETPEND    : 32;           /*!< Interrupt set-pending bits.
                                                     Write:
                                                     0 = No effect.
                                                     1 = Changes interrupt state to pending.
                                                     Read:
                                                     0 = Interrupt is not pending.
                                                     1 = Interrupt is pending.
                                                     Note: Writing 1 to the NVIC_ISPR bit corresponding to:
                                                     An interrupt that is pending has no effect.
                                                     A disabled interrupt sets the state of that interrupt to
                                                     pending.                                                                  */
    } NVIC_ISPR_b;
  } ;
  __IM  uint32_t  RESERVED4[31];

  union {
    __IOM uint32_t NVIC_ICPR;                   /*!< Use the Interrupt Clear-Pending Register to clear pending interrupts
                                                     and determine which interrupts are currently pending.                     */

