mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t CLRPEND    : 32;           /*!< Interrupt clear-pending bits.
                                                     Write:
                                                     0 = No effect.
                                                     1 = Removes pending state and interrupt.
                                                     Read:
                                                     0 = Interrupt is not pending.
                                                     1 = Interrupt is pending.                                                 */
    } NVIC_ICPR_b;
  } ;
  __IM  uint32_t  RESERVED5[95];

  union {
    __IOM uint32_t NVIC_IPR0;                   /*!< Use the Interrupt Priority Registers to assign a priority from
                                                     0 to 3 to each of the available interrupts. 0 is the highest
                                                     priority, and 3 is the lowest.
                                                     Note: Writing 1 to an NVIC_ICPR bit does not affect the
                                                     active state of the corresponding interrupt.
                                                     These registers are only word-accessible                                  */

    struct {
            uint32_t            : 6;
      __IOM uint32_t IP_0       : 2;            /*!< Priority of interrupt 0                                                   */
            uint32_t            : 6;
      __IOM uint32_t IP_1       : 2;            /*!< Priority of interrupt 1                                                   */
            uint32_t            : 6;
      __IOM uint32_t IP_2       : 2;            /*!< Priority of interrupt 2                                                   */
            uint32_t            : 6;
      __IOM uint32_t IP_3       : 2;            /*!< Priority of interrupt 3                                                   */
    } NVIC_IPR0_b;
  } ;

  union {
    __IOM uint32_t NVIC_IPR1;                   /*!< Use the Interrupt Priority Registers to assign a priority from
                                                     0 to 3 to each of the available interrupts. 0 is the highest
                                                     priority, and 3 is the lowest.                                            */

    struct {
            uint32_t            : 6;
      __IOM uint32_t IP_4       : 2;            /*!< Priority of interrupt 4                                                   */
            uint32_t            : 6;
      __IOM uint32_t IP_5       : 2;            /*!< Priority of interrupt 5                                                   */
            uint32_t            : 6;
      __IOM uint32_t IP_6       : 2;            /*!< Priority of interrupt 6                                                   */
            uint32_t            : 6;
      __IOM uint32_t IP_7       : 2;            /*!< Priority of interrupt 7                                                   */
    } NVIC_IPR1_b;
  } ;

  union {
    __IOM uint32_t NVIC_IPR2;                   /*!< Use the Interrupt Priority Registers to assign a priority from
                                                     0 to 3 to each of the available interrupts. 0 is the highest
                                                     priority, and 3 is the lowest.                                            */

    struct {
            uint32_t            : 6;
      __IOM uint32_t IP_8       : 2;            /*!< Priority of interrupt 8                                                   */
            uint32_t            : 6;
      __IOM uint32_t IP_9       : 2;            /*!< Priority of interrupt 9                                                   */
            uint32_t            : 6;
      __IOM uint32_t IP_10      : 2;            /*!< Priority of interrupt 10                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_11      : 2;            /*!< Priority of interrupt 11                                                  */
    } NVIC_IPR2_b;
  } ;

  union {
    __IOM uint32_t NVIC_IPR3;                   /*!< Use the Interrupt Priority Registers to assign a priority from
                                                     0 to 3 to each of the available interrupts. 0 is the highest
                                                     priority, and 3 is the lowest.                                            */

    struct {
            uint32_t            : 6;
      __IOM uint32_t IP_12      : 2;            /*!< Priority of interrupt 12                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_13      : 2;            /*!< Priority of interrupt 13                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_14      : 2;            /*!< Priority of interrupt 14                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_15      : 2;            /*!< Priority of interrupt 15                                                  */
    } NVIC_IPR3_b;
  } ;

  union {
    __IOM uint32_t NVIC_IPR4;                   /*!< Use the Interrupt Priority Registers to assign a priority from
                                                     0 to 3 to each of the available interrupts. 0 is the highest
                                                     priority, and 3 is the lowest.                                            */

    struct {
            uint32_t            : 6;
      __IOM uint32_t IP_16      : 2;            /*!< Priority of interrupt 16                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_17      : 2;            /*!< Priority of interrupt 17                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_18      : 2;            /*!< Priority of interrupt 18                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_19      : 2;            /*!< Priority of interrupt 19                                                  */
    } NVIC_IPR4_b;
  } ;

  union {
    __IOM uint32_t NVIC_IPR5;                   /*!< Use the Interrupt Priority Registers to assign a priority from
                                                     0 to 3 to each of the available interrupts. 0 is the highest
                                                     priority, and 3 is the lowest.                                            */

