mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
            uint32_t            : 6;
      __IOM uint32_t IP_20      : 2;            /*!< Priority of interrupt 20                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_21      : 2;            /*!< Priority of interrupt 21                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_22      : 2;            /*!< Priority of interrupt 22                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_23      : 2;            /*!< Priority of interrupt 23                                                  */
    } NVIC_IPR5_b;
  } ;

  union {
    __IOM uint32_t NVIC_IPR6;                   /*!< Use the Interrupt Priority Registers to assign a priority from
                                                     0 to 3 to each of the available interrupts. 0 is the highest
                                                     priority, and 3 is the lowest.                                            */

    struct {
            uint32_t            : 6;
      __IOM uint32_t IP_24      : 2;            /*!< Priority of interrupt 24                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_25      : 2;            /*!< Priority of interrupt 25                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_26      : 2;            /*!< Priority of interrupt 26                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_27      : 2;            /*!< Priority of interrupt 27                                                  */
    } NVIC_IPR6_b;
  } ;

  union {
    __IOM uint32_t NVIC_IPR7;                   /*!< Use the Interrupt Priority Registers to assign a priority from
                                                     0 to 3 to each of the available interrupts. 0 is the highest
                                                     priority, and 3 is the lowest.                                            */

    struct {
            uint32_t            : 6;
      __IOM uint32_t IP_28      : 2;            /*!< Priority of interrupt 28                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_29      : 2;            /*!< Priority of interrupt 29                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_30      : 2;            /*!< Priority of interrupt 30                                                  */
            uint32_t            : 6;
      __IOM uint32_t IP_31      : 2;            /*!< Priority of interrupt 31                                                  */
    } NVIC_IPR7_b;
  } ;
  __IM  uint32_t  RESERVED6[568];

  union {
    __IOM uint32_t CPUID;                       /*!< Read the CPU ID Base Register to determine: the ID number of
                                                     the processor core, the version number of the processor
                                                     core, the implementation details of the processor core.                   */

    struct {
      __IM  uint32_t REVISION   : 4;            /*!< Minor revision number m in the rnpm revision status:
                                                     0x1 = Patch 1.                                                            */
      __IM  uint32_t PARTNO     : 12;           /*!< Number of processor within family: 0xC60 = Cortex-M0+                     */
      __IM  uint32_t ARCHITECTURE : 4;          /*!< Constant that defines the architecture of the processor:
                                                     0xC = ARMv6-M architecture.                                               */
      __IM  uint32_t VARIANT    : 4;            /*!< Major revision number n in the rnpm revision status:
                                                     0x0 = Revision 0.                                                         */
      __IM  uint32_t IMPLEMENTER : 8;           /*!< Implementor code: 0x41 = ARM                                              */
    } CPUID_b;
  } ;

  union {
    __IOM uint32_t ICSR;                        /*!< Use the Interrupt Control State Register to set a pending Non-Maskable
                                                     Interrupt (NMI), set or clear a pending PendSV, set or
                                                     clear a pending SysTick, check for pending exceptions,
                                                     check the vector number of the highest priority pended
                                                     exception, check the vector number of the active exception.               */

    struct {
      __IM  uint32_t VECTACTIVE : 9;            /*!< Active exception number field. Reset clears the VECTACTIVE field.         */
            uint32_t            : 3;
      __IM  uint32_t VECTPENDING : 9;           /*!< Indicates the exception number for the highest priority pending
                                                     exception: 0 = no pending exceptions. Non zero = The pending
                                                     state includes the effect of memory-mapped enable and mask
                                                     registers. It does not include the PRIMASK special-purpose
                                                     register qualifier.                                                       */
            uint32_t            : 1;
      __IM  uint32_t ISRPENDING : 1;            /*!< External interrupt pending flag                                           */
      __IM  uint32_t ISRPREEMPT : 1;            /*!< The system can only access this bit when the core is halted.
                                                     It indicates that a pending interrupt is to be taken in
                                                     the next running cycle. If C_MASKINTS is clear in the Debug
                                                     Halting Control and Status Register, the interrupt is serviced.           */
            uint32_t            : 1;
      __IOM uint32_t PENDSTCLR  : 1;            /*!< SysTick exception clear-pending bit.
                                                     Write:
                                                     0 = No effect.
                                                     1 = Removes the pending state from the SysTick exception.
                                                     This bit is WO. On a register read its value is Unknown.                  */
      __IOM uint32_t PENDSTSET  : 1;            /*!< SysTick exception set-pending bit.
                                                     Write:
                                                     0 = No effect.
                                                     1 = Changes SysTick exception state to pending.
                                                     Read:
                                                     0 = SysTick exception is not pending.
                                                     1 = SysTick exception is pending.                                         */
      __IOM uint32_t PENDSVCLR  : 1;            /*!< PendSV clear-pending bit.
                                                     Write:
                                                     0 = No effect.
                                                     1 = Removes the pending state from the PendSV exception.                  */
      __IOM uint32_t PENDSVSET  : 1;            /*!< PendSV set-pending bit.
                                                     Write:
                                                     0 = No effect.
                                                     1 = Changes PendSV exception state to pending.
                                                     Read:
                                                     0 = PendSV exception is not pending.
                                                     1 = PendSV exception is pending.
                                                     Writing 1 to this bit is the only way to set the PendSV
                                                     exception state to pending.                                               */
            uint32_t            : 2;
      __IOM uint32_t NMIPENDSET : 1;            /*!< Setting this bit will activate an NMI. Since NMI is the highest
                                                     priority exception, it will activate as soon as it is registered.
                                                     NMI set-pending bit.
                                                     Write:
                                                     0 = No effect.
                                                     1 = Changes NMI exception state to pending.
                                                     Read:
                                                     0 = NMI exception is not pending.
                                                     1 = NMI exception is pending.
                                                     Because NMI is the highest-priority exception, normally
                                                     the processor enters the NMI
                                                     exception handler as soon as it detects a write of 1 to
                                                     this bit. Entering the handler then clears
                                                     this bit to 0. This means a read of this bit by the NMI
                                                     exception handler returns 1 only if the
                                                     NMI signal is reasserted while the processor is executing
                                                     that handler.                                                             */
    } ICSR_b;
  } ;

  union {
    __IOM uint32_t VTOR;                        /*!< The VTOR holds the vector table offset address.                           */

