mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t TBLOFF     : 24;           /*!< Bits [31:8] of the indicate the vector table offset address.              */
    } VTOR_b;
  } ;

  union {
    __IOM uint32_t AIRCR;                       /*!< Use the Application Interrupt and Reset Control Register to:
                                                     determine data endianness, clear all active state information
                                                     from debug halt mode, request a system reset.                             */

    struct {
            uint32_t            : 1;
      __IOM uint32_t VECTCLRACTIVE : 1;         /*!< Clears all active state information for fixed and configurable
                                                     exceptions. This bit: is self-clearing, can only be set
                                                     by the DAP when the core is halted. When set: clears all
                                                     active exception status of the processor, forces a return
                                                     to Thread mode, forces an IPSR of 0. A debugger must re-initialize
                                                     the stack.                                                                */
      __IOM uint32_t SYSRESETREQ : 1;           /*!< Writing 1 to this bit causes the SYSRESETREQ signal to the outer
                                                     system to be asserted to request a reset. The intention
                                                     is to force a large system reset of all major components
                                                     except for debug. The C_HALT bit in the DHCSR is cleared
                                                     as a result of the system reset requested. The debugger
                                                     does not lose contact with the device.                                    */
            uint32_t            : 12;
      __IM  uint32_t ENDIANESS  : 1;            /*!< Data endianness implemented:
                                                     0 = Little-endian.                                                        */
      __IOM uint32_t VECTKEY    : 16;           /*!< Register key:
                                                     Reads as Unknown
                                                     On writes, write 0x05FA to VECTKEY, otherwise the write
                                                     is ignored.                                                               */
    } AIRCR_b;
  } ;

  union {
    __IOM uint32_t SCR;                         /*!< System Control Register. Use the System Control Register for
                                                     power-management functions: signal to the system when the
                                                     processor can enter a low power state, control how the
                                                     processor enters and exits low power states.                              */

    struct {
            uint32_t            : 1;
      __IOM uint32_t SLEEPONEXIT : 1;           /*!< Indicates sleep-on-exit when returning from Handler mode to
                                                     Thread mode:
                                                     0 = Do not sleep when returning to Thread mode.
                                                     1 = Enter sleep, or deep sleep, on return from an ISR to
                                                     Thread mode.
                                                     Setting this bit to 1 enables an interrupt driven application
                                                     to avoid returning to an empty main application.                          */
      __IOM uint32_t SLEEPDEEP  : 1;            /*!< Controls whether the processor uses sleep or deep sleep as its
                                                     low power mode:
                                                     0 = Sleep.
                                                     1 = Deep sleep.                                                           */
            uint32_t            : 1;
      __IOM uint32_t SEVONPEND  : 1;            /*!< Send Event on Pending bit:
                                                     0 = Only enabled interrupts or events can wakeup the processor,
                                                     disabled interrupts are excluded.
                                                     1 = Enabled events and all interrupts, including disabled
                                                     interrupts, can wakeup the processor.
                                                     When an event or interrupt becomes pending, the event signal
                                                     wakes up the processor from WFE. If the
                                                     processor is not waiting for an event, the event is registered
                                                     and affects the next WFE.
                                                     The processor also wakes up on execution of an SEV instruction
                                                     or an external event.                                                     */
            uint32_t            : 27;
    } SCR_b;
  } ;

  union {
    __IOM uint32_t CCR;                         /*!< The Configuration and Control Register permanently enables stack
                                                     alignment and causes unaligned accesses to result in a
                                                     Hard Fault.                                                               */

    struct {
            uint32_t            : 3;
      __IM  uint32_t UNALIGN_TRP : 1;           /*!< Always reads as one, indicates that all unaligned accesses generate
                                                     a HardFault.                                                              */
            uint32_t            : 5;
      __IM  uint32_t STKALIGN   : 1;            /*!< Always reads as one, indicates 8-byte stack alignment on exception
                                                     entry. On exception entry, the processor uses bit[9] of
                                                     the stacked PSR to indicate the stack alignment. On return
                                                     from the exception it uses this stacked bit to restore
                                                     the correct stack alignment.                                              */
            uint32_t            : 22;
    } CCR_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t SHPR2;                       /*!< System handlers are a special class of exception handler that
                                                     can have their priority set to any of the priority levels.
                                                     Use the System Handler Priority Register 2 to set the priority
                                                     of SVCall.                                                                */

