mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
            uint32_t            : 30;
      __IOM uint32_t PRI_11     : 2;            /*!< Priority of system handler 11, SVCall                                     */
    } SHPR2_b;
  } ;

  union {
    __IOM uint32_t SHPR3;                       /*!< System handlers are a special class of exception handler that
                                                     can have their priority set to any of the priority levels.
                                                     Use the System Handler Priority Register 3 to set the priority
                                                     of PendSV and SysTick.                                                    */

    struct {
            uint32_t            : 22;
      __IOM uint32_t PRI_14     : 2;            /*!< Priority of system handler 14, PendSV                                     */
            uint32_t            : 6;
      __IOM uint32_t PRI_15     : 2;            /*!< Priority of system handler 15, SysTick                                    */
    } SHPR3_b;
  } ;

  union {
    __IOM uint32_t SHCSR;                       /*!< Use the System Handler Control and State Register to determine
                                                     or clear the pending status of SVCall.                                    */

    struct {
            uint32_t            : 15;
      __IOM uint32_t SVCALLPENDED : 1;          /*!< Reads as 1 if SVCall is Pending. Write 1 to set pending SVCall,
                                                     write 0 to clear pending SVCall.                                          */
            uint32_t            : 16;
    } SHCSR_b;
  } ;
  __IM  uint32_t  RESERVED8[26];

  union {
    __IOM uint32_t MPU_TYPE;                    /*!< Read the MPU Type Register to determine if the processor implements
                                                     an MPU, and how many regions the MPU supports.                            */

    struct {
      __IM  uint32_t SEPARATE   : 1;            /*!< Indicates support for separate instruction and data address
                                                     maps. Reads as 0 as ARMv6-M only supports a unified MPU.                  */
            uint32_t            : 7;
      __IM  uint32_t DREGION    : 8;            /*!< Number of regions supported by the MPU.                                   */
      __IM  uint32_t IREGION    : 8;            /*!< Instruction region. Reads as zero as ARMv6-M only supports a
                                                     unified MPU.                                                              */
            uint32_t            : 8;
    } MPU_TYPE_b;
  } ;

  union {
    __IOM uint32_t MPU_CTRL;                    /*!< Use the MPU Control Register to enable and disable the MPU,
                                                     and to control whether the default memory map is enabled
                                                     as a background region for privileged accesses, and whether
                                                     the MPU is enabled for HardFaults and NMIs.                               */

    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< Enables the MPU. If the MPU is disabled, privileged and unprivileged
                                                     accesses use the default memory map.
                                                     0 = MPU disabled.
                                                     1 = MPU enabled.                                                          */
      __IOM uint32_t HFNMIENA   : 1;            /*!< Controls the use of the MPU for HardFaults and NMIs. Setting
                                                     this bit when ENABLE is clear results in UNPREDICTABLE
                                                     behaviour.
                                                     When the MPU is enabled:
                                                     0 = MPU is disabled during HardFault and NMI handlers,
                                                     regardless of the value of the ENABLE bit.
                                                     1 = the MPU is enabled during HardFault and NMI handlers.                 */
      __IOM uint32_t PRIVDEFENA : 1;            /*!< Controls whether the default memory map is enabled as a background
                                                     region for privileged accesses. This bit is ignored when
                                                     ENABLE is clear.
                                                     0 = If the MPU is enabled, disables use of the default
                                                     memory map. Any memory access to a location not
                                                     covered by any enabled region causes a fault.
                                                     1 = If the MPU is enabled, enables use of the default memory
                                                     map as a background region for privileged software accesses.
                                                     When enabled, the background region acts as if it is region
                                                     number -1. Any region that is defined and enabled has priority
                                                     over this default map.                                                    */
            uint32_t            : 29;
    } MPU_CTRL_b;
  } ;

  union {
    __IOM uint32_t MPU_RNR;                     /*!< Use the MPU Region Number Register to select the region currently
                                                     accessed by MPU_RBAR and MPU_RASR.                                        */

    struct {
      __IOM uint32_t REGION     : 4;            /*!< Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR
                                                     registers.
                                                     The MPU supports 8 memory regions, so the permitted values
                                                     of this field are 0-7.                                                    */
            uint32_t            : 28;
    } MPU_RNR_b;
  } ;

  union {
    __IOM uint32_t MPU_RBAR;                    /*!< Read the MPU Region Base Address Register to determine the base
                                                     address of the region identified by MPU_RNR. Write to update
                                                     the base address of said region or that of a specified
                                                     region, with whose number MPU_RNR will also be updated.                   */

