mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
    struct {
      __IOM uint32_t REGION     : 4;            /*!< On writes, specifies the number of the region whose base address
                                                     to update provided VALID is set written as 1. On reads,
                                                     returns bits [3:0] of MPU_RNR.                                            */
      __IOM uint32_t VALID      : 1;            /*!< On writes, indicates whether the write must update the base
                                                     address of the region identified by the REGION field, updating
                                                     the MPU_RNR to indicate this new region.
                                                     Write:
                                                     0 = MPU_RNR not changed, and the processor:
                                                     Updates the base address for the region specified in the
                                                     MPU_RNR.
                                                     Ignores the value of the REGION field.
                                                     1 = The processor:
                                                     Updates the value of the MPU_RNR to the value of the REGION
                                                     field.
                                                     Updates the base address for the region specified in the
                                                     REGION field.
                                                     Always reads as zero.                                                     */
            uint32_t            : 3;
      __IOM uint32_t ADDR       : 24;           /*!< Base address of the region.                                               */
    } MPU_RBAR_b;
  } ;

  union {
    __IOM uint32_t MPU_RASR;                    /*!< Use the MPU Region Attribute and Size Register to define the
                                                     size, access behaviour and memory type of the region identified
                                                     by MPU_RNR, and enable that region.                                       */

    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< Enables the region.                                                       */
      __IOM uint32_t SIZE       : 5;            /*!< Indicates the region size. Region size in bytes = 2^(SIZE+1).
                                                     The minimum permitted value is 7 (b00111) = 256Bytes                      */
            uint32_t            : 2;
      __IOM uint32_t SRD        : 8;            /*!< Subregion Disable. For regions of 256 bytes or larger, each
                                                     bit of this field controls whether one of the eight equal
                                                     subregions is enabled.                                                    */
      __IOM uint32_t ATTRS      : 16;           /*!< The MPU Region Attribute field. Use to define the region attribute
                                                     control.
                                                     28 = XN: Instruction access disable bit:
                                                     0 = Instruction fetches enabled.
                                                     1 = Instruction fetches disabled.
                                                     26:24 = AP: Access permission field
                                                     18 = S: Shareable bit
                                                     17 = C: Cacheable bit
                                                     16 = B: Bufferable bit                                                    */
    } MPU_RASR_b;
  } ;
} PPB_Type;                                     /*!< Size = 60836 (0xeda4)                                                     */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define XIP_CTRL_BASE               0x14000000UL
#define XIP_SSI_BASE                0x18000000UL
#define SYSINFO_BASE                0x40000000UL
#define SYSCFG_BASE                 0x40004000UL
#define CLOCKS_BASE                 0x40008000UL
#define RESETS_BASE                 0x4000C000UL
#define PSM_BASE                    0x40010000UL
#define IO_BANK0_BASE               0x40014000UL
#define IO_QSPI_BASE                0x40018000UL
#define PADS_BANK0_BASE             0x4001C000UL
#define PADS_QSPI_BASE              0x40020000UL
#define XOSC_BASE                   0x40024000UL
#define PLL_SYS_BASE                0x40028000UL
#define PLL_USB_BASE                0x4002C000UL
#define BUSCTRL_BASE                0x40030000UL
#define UART0_BASE                  0x40034000UL
#define UART1_BASE                  0x40038000UL
#define SPI0_BASE                   0x4003C000UL
#define SPI1_BASE                   0x40040000UL
#define I2C0_BASE                   0x40044000UL
#define I2C1_BASE                   0x40048000UL
#define ADC_BASE                    0x4004C000UL
#define PWM_BASE                    0x40050000UL
#define TIMER_BASE                  0x40054000UL
#define WATCHDOG_BASE               0x40058000UL
#define RTC_BASE                    0x4005C000UL
#define ROSC_BASE                   0x40060000UL
#define VREG_AND_CHIP_RESET_BASE    0x40064000UL
#define TBMAN_BASE                  0x4006C000UL
#define DMA_BASE                    0x50000000UL
#define USBCTRL_DPRAM_BASE          0x50100000UL
#define USBCTRL_REGS_BASE           0x50110000UL
#define PIO0_BASE                   0x50200000UL
#define PIO1_BASE                   0x50300000UL
#define SIO_BASE                    0xD0000000UL
#define PPB_BASE                    0xE0000000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

// #define XIP_CTRL                    ((XIP_CTRL_Type*)          XIP_CTRL_BASE)
// #define XIP_SSI                     ((XIP_SSI_Type*)           XIP_SSI_BASE)
// #define SYSINFO                     ((SYSINFO_Type*)           SYSINFO_BASE)
// #define SYSCFG                      ((SYSCFG_Type*)            SYSCFG_BASE)
// #define CLOCKS                      ((CLOCKS_Type*)            CLOCKS_BASE)
// #define RESETS                      ((RESETS_Type*)            RESETS_BASE)
// #define PSM                         ((PSM_Type*)               PSM_BASE)
// #define IO_BANK0                    ((IO_BANK0_Type*)          IO_BANK0_BASE)
// #define IO_QSPI                     ((IO_QSPI_Type*)           IO_QSPI_BASE)
// #define PADS_BANK0                  ((PADS_BANK0_Type*)        PADS_BANK0_BASE)
// #define PADS_QSPI                   ((PADS_QSPI_Type*)         PADS_QSPI_BASE)
// #define XOSC                        ((XOSC_Type*)              XOSC_BASE)
// #define PLL_SYS                     ((PLL_SYS_Type*)           PLL_SYS_BASE)
// #define PLL_USB                     ((PLL_SYS_Type*)           PLL_USB_BASE)
// #define BUSCTRL                     ((BUSCTRL_Type*)           BUSCTRL_BASE)
// #define UART0                       ((UART0_Type*)             UART0_BASE)
// #define UART1                       ((UART0_Type*)             UART1_BASE)
// #define SPI0                        ((SPI0_Type*)              SPI0_BASE)
// #define SPI1                        ((SPI0_Type*)              SPI1_BASE)
// #define I2C0                        ((I2C0_Type*)              I2C0_BASE)
// #define I2C1                        ((I2C0_Type*)              I2C1_BASE)
// #define ADC                         ((ADC_Type*)               ADC_BASE)
// #define PWM                         ((PWM_Type*)               PWM_BASE)
// #define TIMER                       ((TIMER_Type*)             TIMER_BASE)
// #define WATCHDOG                    ((WATCHDOG_Type*)          WATCHDOG_BASE)
// #define RTC                         ((RTC_Type*)               RTC_BASE)
// #define ROSC                        ((ROSC_Type*)              ROSC_BASE)
// #define VREG_AND_CHIP_RESET         ((VREG_AND_CHIP_RESET_Type*)  VREG_AND_CHIP_RESET_BASE)
// #define TBMAN                       ((TBMAN_Type*)             TBMAN_BASE)
// #define DMA                         ((DMA_Type*)               DMA_BASE)
// #define USBCTRL_DPRAM               ((USBCTRL_DPRAM_Type*)     USBCTRL_DPRAM_BASE)
// #define USBCTRL_REGS                ((USBCTRL_REGS_Type*)      USBCTRL_REGS_BASE)
// #define PIO0                        ((PIO0_Type*)              PIO0_BASE)
// #define PIO1                        ((PIO0_Type*)              PIO1_BASE)
// #define SIO                         ((SIO_Type*)               SIO_BASE)
// #define PPB                         ((PPB_Type*)               PPB_BASE)

