mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                         XIP_CTRL                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define XIP_CTRL_CTRL_POWER_DOWN_Pos      (3UL)                     /*!< POWER_DOWN (Bit 3)                                    */
#define XIP_CTRL_CTRL_POWER_DOWN_Msk      (0x8UL)                   /*!< POWER_DOWN (Bitfield-Mask: 0x01)                      */
#define XIP_CTRL_CTRL_ERR_BADWRITE_Pos    (1UL)                     /*!< ERR_BADWRITE (Bit 1)                                  */
#define XIP_CTRL_CTRL_ERR_BADWRITE_Msk    (0x2UL)                   /*!< ERR_BADWRITE (Bitfield-Mask: 0x01)                    */
#define XIP_CTRL_CTRL_EN_Pos              (0UL)                     /*!< EN (Bit 0)                                            */
#define XIP_CTRL_CTRL_EN_Msk              (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  FLUSH  ========================================================= */
#define XIP_CTRL_FLUSH_FLUSH_Pos          (0UL)                     /*!< FLUSH (Bit 0)                                         */
#define XIP_CTRL_FLUSH_FLUSH_Msk          (0x1UL)                   /*!< FLUSH (Bitfield-Mask: 0x01)                           */
/* =========================================================  STAT  ========================================================== */
#define XIP_CTRL_STAT_FIFO_FULL_Pos       (2UL)                     /*!< FIFO_FULL (Bit 2)                                     */
#define XIP_CTRL_STAT_FIFO_FULL_Msk       (0x4UL)                   /*!< FIFO_FULL (Bitfield-Mask: 0x01)                       */
#define XIP_CTRL_STAT_FIFO_EMPTY_Pos      (1UL)                     /*!< FIFO_EMPTY (Bit 1)                                    */
#define XIP_CTRL_STAT_FIFO_EMPTY_Msk      (0x2UL)                   /*!< FIFO_EMPTY (Bitfield-Mask: 0x01)                      */
#define XIP_CTRL_STAT_FLUSH_READY_Pos     (0UL)                     /*!< FLUSH_READY (Bit 0)                                   */
#define XIP_CTRL_STAT_FLUSH_READY_Msk     (0x1UL)                   /*!< FLUSH_READY (Bitfield-Mask: 0x01)                     */
/* ========================================================  CTR_HIT  ======================================================== */
/* ========================================================  CTR_ACC  ======================================================== */
/* ======================================================  STREAM_ADDR  ====================================================== */
#define XIP_CTRL_STREAM_ADDR_STREAM_ADDR_Pos (2UL)                  /*!< STREAM_ADDR (Bit 2)                                   */
#define XIP_CTRL_STREAM_ADDR_STREAM_ADDR_Msk (0xfffffffcUL)         /*!< STREAM_ADDR (Bitfield-Mask: 0x3fffffff)               */
/* ======================================================  STREAM_CTR  ======================================================= */
#define XIP_CTRL_STREAM_CTR_STREAM_CTR_Pos (0UL)                    /*!< STREAM_CTR (Bit 0)                                    */
#define XIP_CTRL_STREAM_CTR_STREAM_CTR_Msk (0x3fffffUL)             /*!< STREAM_CTR (Bitfield-Mask: 0x3fffff)                  */
/* ======================================================  STREAM_FIFO  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          XIP_SSI                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CTRLR0  ========================================================= */
#define XIP_SSI_CTRLR0_SSTE_Pos           (24UL)                    /*!< SSTE (Bit 24)                                         */
#define XIP_SSI_CTRLR0_SSTE_Msk           (0x1000000UL)             /*!< SSTE (Bitfield-Mask: 0x01)                            */
#define XIP_SSI_CTRLR0_SPI_FRF_Pos        (21UL)                    /*!< SPI_FRF (Bit 21)                                      */
#define XIP_SSI_CTRLR0_SPI_FRF_Msk        (0x600000UL)              /*!< SPI_FRF (Bitfield-Mask: 0x03)                         */
#define XIP_SSI_CTRLR0_DFS_32_Pos         (16UL)                    /*!< DFS_32 (Bit 16)                                       */
#define XIP_SSI_CTRLR0_DFS_32_Msk         (0x1f0000UL)              /*!< DFS_32 (Bitfield-Mask: 0x1f)                          */
#define XIP_SSI_CTRLR0_CFS_Pos            (12UL)                    /*!< CFS (Bit 12)                                          */
#define XIP_SSI_CTRLR0_CFS_Msk            (0xf000UL)                /*!< CFS (Bitfield-Mask: 0x0f)                             */
#define XIP_SSI_CTRLR0_SRL_Pos            (11UL)                    /*!< SRL (Bit 11)                                          */
#define XIP_SSI_CTRLR0_SRL_Msk            (0x800UL)                 /*!< SRL (Bitfield-Mask: 0x01)                             */
#define XIP_SSI_CTRLR0_SLV_OE_Pos         (10UL)                    /*!< SLV_OE (Bit 10)                                       */
#define XIP_SSI_CTRLR0_SLV_OE_Msk         (0x400UL)                 /*!< SLV_OE (Bitfield-Mask: 0x01)                          */
#define XIP_SSI_CTRLR0_TMOD_Pos           (8UL)                     /*!< TMOD (Bit 8)                                          */
#define XIP_SSI_CTRLR0_TMOD_Msk           (0x300UL)                 /*!< TMOD (Bitfield-Mask: 0x03)                            */
#define XIP_SSI_CTRLR0_SCPOL_Pos          (7UL)                     /*!< SCPOL (Bit 7)                                         */
#define XIP_SSI_CTRLR0_SCPOL_Msk          (0x80UL)                  /*!< SCPOL (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_CTRLR0_SCPH_Pos           (6UL)                     /*!< SCPH (Bit 6)                                          */
#define XIP_SSI_CTRLR0_SCPH_Msk           (0x40UL)                  /*!< SCPH (Bitfield-Mask: 0x01)                            */
#define XIP_SSI_CTRLR0_FRF_Pos            (4UL)                     /*!< FRF (Bit 4)                                           */
#define XIP_SSI_CTRLR0_FRF_Msk            (0x30UL)                  /*!< FRF (Bitfield-Mask: 0x03)                             */
#define XIP_SSI_CTRLR0_DFS_Pos            (0UL)                     /*!< DFS (Bit 0)                                           */
#define XIP_SSI_CTRLR0_DFS_Msk            (0xfUL)                   /*!< DFS (Bitfield-Mask: 0x0f)                             */
/* ========================================================  CTRLR1  ========================================================= */
#define XIP_SSI_CTRLR1_NDF_Pos            (0UL)                     /*!< NDF (Bit 0)                                           */
#define XIP_SSI_CTRLR1_NDF_Msk            (0xffffUL)                /*!< NDF (Bitfield-Mask: 0xffff)                           */
/* ========================================================  SSIENR  ========================================================= */
#define XIP_SSI_SSIENR_SSI_EN_Pos         (0UL)                     /*!< SSI_EN (Bit 0)                                        */
#define XIP_SSI_SSIENR_SSI_EN_Msk         (0x1UL)                   /*!< SSI_EN (Bitfield-Mask: 0x01)                          */
/* =========================================================  MWCR  ========================================================== */
#define XIP_SSI_MWCR_MHS_Pos              (2UL)                     /*!< MHS (Bit 2)                                           */
#define XIP_SSI_MWCR_MHS_Msk              (0x4UL)                   /*!< MHS (Bitfield-Mask: 0x01)                             */
#define XIP_SSI_MWCR_MDD_Pos              (1UL)                     /*!< MDD (Bit 1)                                           */
#define XIP_SSI_MWCR_MDD_Msk              (0x2UL)                   /*!< MDD (Bitfield-Mask: 0x01)                             */
#define XIP_SSI_MWCR_MWMOD_Pos            (0UL)                     /*!< MWMOD (Bit 0)                                         */
#define XIP_SSI_MWCR_MWMOD_Msk            (0x1UL)                   /*!< MWMOD (Bitfield-Mask: 0x01)                           */
/* ==========================================================  SER  ========================================================== */
#define XIP_SSI_SER_SER_Pos               (0UL)                     /*!< SER (Bit 0)                                           */
#define XIP_SSI_SER_SER_Msk               (0x1UL)                   /*!< SER (Bitfield-Mask: 0x01)                             */
/* =========================================================  BAUDR  ========================================================= */
#define XIP_SSI_BAUDR_SCKDV_Pos           (0UL)                     /*!< SCKDV (Bit 0)                                         */
#define XIP_SSI_BAUDR_SCKDV_Msk           (0xffffUL)                /*!< SCKDV (Bitfield-Mask: 0xffff)                         */
/* ========================================================  TXFTLR  ========================================================= */
#define XIP_SSI_TXFTLR_TFT_Pos            (0UL)                     /*!< TFT (Bit 0)                                           */
#define XIP_SSI_TXFTLR_TFT_Msk            (0xffUL)                  /*!< TFT (Bitfield-Mask: 0xff)                             */
/* ========================================================  RXFTLR  ========================================================= */
#define XIP_SSI_RXFTLR_RFT_Pos            (0UL)                     /*!< RFT (Bit 0)                                           */
#define XIP_SSI_RXFTLR_RFT_Msk            (0xffUL)                  /*!< RFT (Bitfield-Mask: 0xff)                             */
/* =========================================================  TXFLR  ========================================================= */
#define XIP_SSI_TXFLR_TFTFL_Pos           (0UL)                     /*!< TFTFL (Bit 0)                                         */
#define XIP_SSI_TXFLR_TFTFL_Msk           (0xffUL)                  /*!< TFTFL (Bitfield-Mask: 0xff)                           */
/* =========================================================  RXFLR  ========================================================= */
#define XIP_SSI_RXFLR_RXTFL_Pos           (0UL)                     /*!< RXTFL (Bit 0)                                         */
#define XIP_SSI_RXFLR_RXTFL_Msk           (0xffUL)                  /*!< RXTFL (Bitfield-Mask: 0xff)                           */
/* ==========================================================  SR  =========================================================== */
#define XIP_SSI_SR_DCOL_Pos               (6UL)                     /*!< DCOL (Bit 6)                                          */
#define XIP_SSI_SR_DCOL_Msk               (0x40UL)                  /*!< DCOL (Bitfield-Mask: 0x01)                            */
#define XIP_SSI_SR_TXE_Pos                (5UL)                     /*!< TXE (Bit 5)                                           */
#define XIP_SSI_SR_TXE_Msk                (0x20UL)                  /*!< TXE (Bitfield-Mask: 0x01)                             */
#define XIP_SSI_SR_RFF_Pos                (4UL)                     /*!< RFF (Bit 4)                                           */
#define XIP_SSI_SR_RFF_Msk                (0x10UL)                  /*!< RFF (Bitfield-Mask: 0x01)                             */
#define XIP_SSI_SR_RFNE_Pos               (3UL)                     /*!< RFNE (Bit 3)                                          */
#define XIP_SSI_SR_RFNE_Msk               (0x8UL)                   /*!< RFNE (Bitfield-Mask: 0x01)                            */
#define XIP_SSI_SR_TFE_Pos                (2UL)                     /*!< TFE (Bit 2)                                           */
#define XIP_SSI_SR_TFE_Msk                (0x4UL)                   /*!< TFE (Bitfield-Mask: 0x01)                             */
#define XIP_SSI_SR_TFNF_Pos               (1UL)                     /*!< TFNF (Bit 1)                                          */
#define XIP_SSI_SR_TFNF_Msk               (0x2UL)                   /*!< TFNF (Bitfield-Mask: 0x01)                            */
#define XIP_SSI_SR_BUSY_Pos               (0UL)                     /*!< BUSY (Bit 0)                                          */
#define XIP_SSI_SR_BUSY_Msk               (0x1UL)                   /*!< BUSY (Bitfield-Mask: 0x01)                            */
/* ==========================================================  IMR  ========================================================== */
#define XIP_SSI_IMR_MSTIM_Pos             (5UL)                     /*!< MSTIM (Bit 5)                                         */
#define XIP_SSI_IMR_MSTIM_Msk             (0x20UL)                  /*!< MSTIM (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_IMR_RXFIM_Pos             (4UL)                     /*!< RXFIM (Bit 4)                                         */
#define XIP_SSI_IMR_RXFIM_Msk             (0x10UL)                  /*!< RXFIM (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_IMR_RXOIM_Pos             (3UL)                     /*!< RXOIM (Bit 3)                                         */
#define XIP_SSI_IMR_RXOIM_Msk             (0x8UL)                   /*!< RXOIM (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_IMR_RXUIM_Pos             (2UL)                     /*!< RXUIM (Bit 2)                                         */
#define XIP_SSI_IMR_RXUIM_Msk             (0x4UL)                   /*!< RXUIM (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_IMR_TXOIM_Pos             (1UL)                     /*!< TXOIM (Bit 1)                                         */
#define XIP_SSI_IMR_TXOIM_Msk             (0x2UL)                   /*!< TXOIM (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_IMR_TXEIM_Pos             (0UL)                     /*!< TXEIM (Bit 0)                                         */
#define XIP_SSI_IMR_TXEIM_Msk             (0x1UL)                   /*!< TXEIM (Bitfield-Mask: 0x01)                           */
/* ==========================================================  ISR  ========================================================== */
#define XIP_SSI_ISR_MSTIS_Pos             (5UL)                     /*!< MSTIS (Bit 5)                                         */
#define XIP_SSI_ISR_MSTIS_Msk             (0x20UL)                  /*!< MSTIS (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_ISR_RXFIS_Pos             (4UL)                     /*!< RXFIS (Bit 4)                                         */
#define XIP_SSI_ISR_RXFIS_Msk             (0x10UL)                  /*!< RXFIS (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_ISR_RXOIS_Pos             (3UL)                     /*!< RXOIS (Bit 3)                                         */
#define XIP_SSI_ISR_RXOIS_Msk             (0x8UL)                   /*!< RXOIS (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_ISR_RXUIS_Pos             (2UL)                     /*!< RXUIS (Bit 2)                                         */
#define XIP_SSI_ISR_RXUIS_Msk             (0x4UL)                   /*!< RXUIS (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_ISR_TXOIS_Pos             (1UL)                     /*!< TXOIS (Bit 1)                                         */
#define XIP_SSI_ISR_TXOIS_Msk             (0x2UL)                   /*!< TXOIS (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_ISR_TXEIS_Pos             (0UL)                     /*!< TXEIS (Bit 0)                                         */
#define XIP_SSI_ISR_TXEIS_Msk             (0x1UL)                   /*!< TXEIS (Bitfield-Mask: 0x01)                           */
/* =========================================================  RISR  ========================================================== */
#define XIP_SSI_RISR_MSTIR_Pos            (5UL)                     /*!< MSTIR (Bit 5)                                         */
#define XIP_SSI_RISR_MSTIR_Msk            (0x20UL)                  /*!< MSTIR (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_RISR_RXFIR_Pos            (4UL)                     /*!< RXFIR (Bit 4)                                         */
#define XIP_SSI_RISR_RXFIR_Msk            (0x10UL)                  /*!< RXFIR (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_RISR_RXOIR_Pos            (3UL)                     /*!< RXOIR (Bit 3)                                         */
#define XIP_SSI_RISR_RXOIR_Msk            (0x8UL)                   /*!< RXOIR (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_RISR_RXUIR_Pos            (2UL)                     /*!< RXUIR (Bit 2)                                         */
#define XIP_SSI_RISR_RXUIR_Msk            (0x4UL)                   /*!< RXUIR (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_RISR_TXOIR_Pos            (1UL)                     /*!< TXOIR (Bit 1)                                         */
#define XIP_SSI_RISR_TXOIR_Msk            (0x2UL)                   /*!< TXOIR (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_RISR_TXEIR_Pos            (0UL)                     /*!< TXEIR (Bit 0)                                         */
#define XIP_SSI_RISR_TXEIR_Msk            (0x1UL)                   /*!< TXEIR (Bitfield-Mask: 0x01)                           */
/* ========================================================  TXOICR  ========================================================= */
#define XIP_SSI_TXOICR_TXOICR_Pos         (0UL)                     /*!< TXOICR (Bit 0)                                        */
#define XIP_SSI_TXOICR_TXOICR_Msk         (0x1UL)                   /*!< TXOICR (Bitfield-Mask: 0x01)                          */
/* ========================================================  RXOICR  ========================================================= */
#define XIP_SSI_RXOICR_RXOICR_Pos         (0UL)                     /*!< RXOICR (Bit 0)                                        */
#define XIP_SSI_RXOICR_RXOICR_Msk         (0x1UL)                   /*!< RXOICR (Bitfield-Mask: 0x01)                          */
/* ========================================================  RXUICR  ========================================================= */
#define XIP_SSI_RXUICR_RXUICR_Pos         (0UL)                     /*!< RXUICR (Bit 0)                                        */
#define XIP_SSI_RXUICR_RXUICR_Msk         (0x1UL)                   /*!< RXUICR (Bitfield-Mask: 0x01)                          */
/* ========================================================  MSTICR  ========================================================= */
#define XIP_SSI_MSTICR_MSTICR_Pos         (0UL)                     /*!< MSTICR (Bit 0)                                        */
#define XIP_SSI_MSTICR_MSTICR_Msk         (0x1UL)                   /*!< MSTICR (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ICR  ========================================================== */
#define XIP_SSI_ICR_ICR_Pos               (0UL)                     /*!< ICR (Bit 0)                                           */
#define XIP_SSI_ICR_ICR_Msk               (0x1UL)                   /*!< ICR (Bitfield-Mask: 0x01)                             */
/* =========================================================  DMACR  ========================================================= */
#define XIP_SSI_DMACR_TDMAE_Pos           (1UL)                     /*!< TDMAE (Bit 1)                                         */
#define XIP_SSI_DMACR_TDMAE_Msk           (0x2UL)                   /*!< TDMAE (Bitfield-Mask: 0x01)                           */
#define XIP_SSI_DMACR_RDMAE_Pos           (0UL)                     /*!< RDMAE (Bit 0)                                         */
#define XIP_SSI_DMACR_RDMAE_Msk           (0x1UL)                   /*!< RDMAE (Bitfield-Mask: 0x01)                           */
/* ========================================================  DMATDLR  ======================================================== */
#define XIP_SSI_DMATDLR_DMATDL_Pos        (0UL)                     /*!< DMATDL (Bit 0)                                        */
#define XIP_SSI_DMATDLR_DMATDL_Msk        (0xffUL)                  /*!< DMATDL (Bitfield-Mask: 0xff)                          */
/* ========================================================  DMARDLR  ======================================================== */
#define XIP_SSI_DMARDLR_DMARDL_Pos        (0UL)                     /*!< DMARDL (Bit 0)                                        */
#define XIP_SSI_DMARDLR_DMARDL_Msk        (0xffUL)                  /*!< DMARDL (Bitfield-Mask: 0xff)                          */
/* ==========================================================  IDR  ========================================================== */
#define XIP_SSI_IDR_IDCODE_Pos            (0UL)                     /*!< IDCODE (Bit 0)                                        */
#define XIP_SSI_IDR_IDCODE_Msk            (0xffffffffUL)            /*!< IDCODE (Bitfield-Mask: 0xffffffff)                    */
/* ====================================================  SSI_VERSION_ID  ===================================================== */
#define XIP_SSI_SSI_VERSION_ID_SSI_COMP_VERSION_Pos (0UL)           /*!< SSI_COMP_VERSION (Bit 0)                              */
#define XIP_SSI_SSI_VERSION_ID_SSI_COMP_VERSION_Msk (0xffffffffUL)  /*!< SSI_COMP_VERSION (Bitfield-Mask: 0xffffffff)          */
/* ==========================================================  DR0  ========================================================== */
#define XIP_SSI_DR0_DR_Pos                (0UL)                     /*!< DR (Bit 0)                                            */
#define XIP_SSI_DR0_DR_Msk                (0xffffffffUL)            /*!< DR (Bitfield-Mask: 0xffffffff)                        */
/* =====================================================  RX_SAMPLE_DLY  ===================================================== */
