mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define XIP_SSI_RX_SAMPLE_DLY_RSD_Pos     (0UL)                     /*!< RSD (Bit 0)                                           */
#define XIP_SSI_RX_SAMPLE_DLY_RSD_Msk     (0xffUL)                  /*!< RSD (Bitfield-Mask: 0xff)                             */
/* ======================================================  SPI_CTRLR0  ======================================================= */
#define XIP_SSI_SPI_CTRLR0_XIP_CMD_Pos    (24UL)                    /*!< XIP_CMD (Bit 24)                                      */
#define XIP_SSI_SPI_CTRLR0_XIP_CMD_Msk    (0xff000000UL)            /*!< XIP_CMD (Bitfield-Mask: 0xff)                         */
#define XIP_SSI_SPI_CTRLR0_SPI_RXDS_EN_Pos (18UL)                   /*!< SPI_RXDS_EN (Bit 18)                                  */
#define XIP_SSI_SPI_CTRLR0_SPI_RXDS_EN_Msk (0x40000UL)              /*!< SPI_RXDS_EN (Bitfield-Mask: 0x01)                     */
#define XIP_SSI_SPI_CTRLR0_INST_DDR_EN_Pos (17UL)                   /*!< INST_DDR_EN (Bit 17)                                  */
#define XIP_SSI_SPI_CTRLR0_INST_DDR_EN_Msk (0x20000UL)              /*!< INST_DDR_EN (Bitfield-Mask: 0x01)                     */
#define XIP_SSI_SPI_CTRLR0_SPI_DDR_EN_Pos (16UL)                    /*!< SPI_DDR_EN (Bit 16)                                   */
#define XIP_SSI_SPI_CTRLR0_SPI_DDR_EN_Msk (0x10000UL)               /*!< SPI_DDR_EN (Bitfield-Mask: 0x01)                      */
#define XIP_SSI_SPI_CTRLR0_WAIT_CYCLES_Pos (11UL)                   /*!< WAIT_CYCLES (Bit 11)                                  */
#define XIP_SSI_SPI_CTRLR0_WAIT_CYCLES_Msk (0xf800UL)               /*!< WAIT_CYCLES (Bitfield-Mask: 0x1f)                     */
#define XIP_SSI_SPI_CTRLR0_INST_L_Pos     (8UL)                     /*!< INST_L (Bit 8)                                        */
#define XIP_SSI_SPI_CTRLR0_INST_L_Msk     (0x300UL)                 /*!< INST_L (Bitfield-Mask: 0x03)                          */
#define XIP_SSI_SPI_CTRLR0_ADDR_L_Pos     (2UL)                     /*!< ADDR_L (Bit 2)                                        */
#define XIP_SSI_SPI_CTRLR0_ADDR_L_Msk     (0x3cUL)                  /*!< ADDR_L (Bitfield-Mask: 0x0f)                          */
#define XIP_SSI_SPI_CTRLR0_TRANS_TYPE_Pos (0UL)                     /*!< TRANS_TYPE (Bit 0)                                    */
#define XIP_SSI_SPI_CTRLR0_TRANS_TYPE_Msk (0x3UL)                   /*!< TRANS_TYPE (Bitfield-Mask: 0x03)                      */
/* ====================================================  TXD_DRIVE_EDGE  ===================================================== */
#define XIP_SSI_TXD_DRIVE_EDGE_TDE_Pos    (0UL)                     /*!< TDE (Bit 0)                                           */
#define XIP_SSI_TXD_DRIVE_EDGE_TDE_Msk    (0xffUL)                  /*!< TDE (Bitfield-Mask: 0xff)                             */


/* =========================================================================================================================== */
/* ================                                          SYSINFO                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CHIP_ID  ======================================================== */
#define SYSINFO_CHIP_ID_REVISION_Pos      (28UL)                    /*!< REVISION (Bit 28)                                     */
#define SYSINFO_CHIP_ID_REVISION_Msk      (0xf0000000UL)            /*!< REVISION (Bitfield-Mask: 0x0f)                        */
#define SYSINFO_CHIP_ID_PART_Pos          (12UL)                    /*!< PART (Bit 12)                                         */
#define SYSINFO_CHIP_ID_PART_Msk          (0xffff000UL)             /*!< PART (Bitfield-Mask: 0xffff)                          */
#define SYSINFO_CHIP_ID_MANUFACTURER_Pos  (0UL)                     /*!< MANUFACTURER (Bit 0)                                  */
#define SYSINFO_CHIP_ID_MANUFACTURER_Msk  (0xfffUL)                 /*!< MANUFACTURER (Bitfield-Mask: 0xfff)                   */
/* =======================================================  PLATFORM  ======================================================== */
#define SYSINFO_PLATFORM_ASIC_Pos         (1UL)                     /*!< ASIC (Bit 1)                                          */
#define SYSINFO_PLATFORM_ASIC_Msk         (0x2UL)                   /*!< ASIC (Bitfield-Mask: 0x01)                            */
#define SYSINFO_PLATFORM_FPGA_Pos         (0UL)                     /*!< FPGA (Bit 0)                                          */
#define SYSINFO_PLATFORM_FPGA_Msk         (0x1UL)                   /*!< FPGA (Bitfield-Mask: 0x01)                            */
/* =====================================================  GITREF_RP2040  ===================================================== */


/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */

/* ====================================================  PROC0_NMI_MASK  ===================================================== */
/* ====================================================  PROC1_NMI_MASK  ===================================================== */
/* ======================================================  PROC_CONFIG  ====================================================== */
#define SYSCFG_PROC_CONFIG_PROC1_DAP_INSTID_Pos (28UL)              /*!< PROC1_DAP_INSTID (Bit 28)                             */
#define SYSCFG_PROC_CONFIG_PROC1_DAP_INSTID_Msk (0xf0000000UL)      /*!< PROC1_DAP_INSTID (Bitfield-Mask: 0x0f)                */
#define SYSCFG_PROC_CONFIG_PROC0_DAP_INSTID_Pos (24UL)              /*!< PROC0_DAP_INSTID (Bit 24)                             */
#define SYSCFG_PROC_CONFIG_PROC0_DAP_INSTID_Msk (0xf000000UL)       /*!< PROC0_DAP_INSTID (Bitfield-Mask: 0x0f)                */
#define SYSCFG_PROC_CONFIG_PROC1_HALTED_Pos (1UL)                   /*!< PROC1_HALTED (Bit 1)                                  */
#define SYSCFG_PROC_CONFIG_PROC1_HALTED_Msk (0x2UL)                 /*!< PROC1_HALTED (Bitfield-Mask: 0x01)                    */
#define SYSCFG_PROC_CONFIG_PROC0_HALTED_Pos (0UL)                   /*!< PROC0_HALTED (Bit 0)                                  */
#define SYSCFG_PROC_CONFIG_PROC0_HALTED_Msk (0x1UL)                 /*!< PROC0_HALTED (Bitfield-Mask: 0x01)                    */
/* ==================================================  PROC_IN_SYNC_BYPASS  ================================================== */
#define SYSCFG_PROC_IN_SYNC_BYPASS_PROC_IN_SYNC_BYPASS_Pos (0UL)    /*!< PROC_IN_SYNC_BYPASS (Bit 0)                           */
#define SYSCFG_PROC_IN_SYNC_BYPASS_PROC_IN_SYNC_BYPASS_Msk (0x3fffffffUL) /*!< PROC_IN_SYNC_BYPASS (Bitfield-Mask: 0x3fffffff) */
/* ================================================  PROC_IN_SYNC_BYPASS_HI  ================================================= */
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_PROC_IN_SYNC_BYPASS_HI_Pos (0UL) /*!< PROC_IN_SYNC_BYPASS_HI (Bit 0)                     */
#define SYSCFG_PROC_IN_SYNC_BYPASS_HI_PROC_IN_SYNC_BYPASS_HI_Msk (0x3fUL) /*!< PROC_IN_SYNC_BYPASS_HI (Bitfield-Mask: 0x3f)    */
/* =======================================================  DBGFORCE  ======================================================== */
#define SYSCFG_DBGFORCE_PROC1_ATTACH_Pos  (7UL)                     /*!< PROC1_ATTACH (Bit 7)                                  */
#define SYSCFG_DBGFORCE_PROC1_ATTACH_Msk  (0x80UL)                  /*!< PROC1_ATTACH (Bitfield-Mask: 0x01)                    */
#define SYSCFG_DBGFORCE_PROC1_SWCLK_Pos   (6UL)                     /*!< PROC1_SWCLK (Bit 6)                                   */
#define SYSCFG_DBGFORCE_PROC1_SWCLK_Msk   (0x40UL)                  /*!< PROC1_SWCLK (Bitfield-Mask: 0x01)                     */
#define SYSCFG_DBGFORCE_PROC1_SWDI_Pos    (5UL)                     /*!< PROC1_SWDI (Bit 5)                                    */
#define SYSCFG_DBGFORCE_PROC1_SWDI_Msk    (0x20UL)                  /*!< PROC1_SWDI (Bitfield-Mask: 0x01)                      */
#define SYSCFG_DBGFORCE_PROC1_SWDO_Pos    (4UL)                     /*!< PROC1_SWDO (Bit 4)                                    */
#define SYSCFG_DBGFORCE_PROC1_SWDO_Msk    (0x10UL)                  /*!< PROC1_SWDO (Bitfield-Mask: 0x01)                      */
#define SYSCFG_DBGFORCE_PROC0_ATTACH_Pos  (3UL)                     /*!< PROC0_ATTACH (Bit 3)                                  */
#define SYSCFG_DBGFORCE_PROC0_ATTACH_Msk  (0x8UL)                   /*!< PROC0_ATTACH (Bitfield-Mask: 0x01)                    */
#define SYSCFG_DBGFORCE_PROC0_SWCLK_Pos   (2UL)                     /*!< PROC0_SWCLK (Bit 2)                                   */
#define SYSCFG_DBGFORCE_PROC0_SWCLK_Msk   (0x4UL)                   /*!< PROC0_SWCLK (Bitfield-Mask: 0x01)                     */
#define SYSCFG_DBGFORCE_PROC0_SWDI_Pos    (1UL)                     /*!< PROC0_SWDI (Bit 1)                                    */
#define SYSCFG_DBGFORCE_PROC0_SWDI_Msk    (0x2UL)                   /*!< PROC0_SWDI (Bitfield-Mask: 0x01)                      */
#define SYSCFG_DBGFORCE_PROC0_SWDO_Pos    (0UL)                     /*!< PROC0_SWDO (Bit 0)                                    */
#define SYSCFG_DBGFORCE_PROC0_SWDO_Msk    (0x1UL)                   /*!< PROC0_SWDO (Bitfield-Mask: 0x01)                      */
/* =====================================================  MEMPOWERDOWN  ====================================================== */
#define SYSCFG_MEMPOWERDOWN_ROM_Pos       (7UL)                     /*!< ROM (Bit 7)                                           */
#define SYSCFG_MEMPOWERDOWN_ROM_Msk       (0x80UL)                  /*!< ROM (Bitfield-Mask: 0x01)                             */
#define SYSCFG_MEMPOWERDOWN_USB_Pos       (6UL)                     /*!< USB (Bit 6)                                           */
#define SYSCFG_MEMPOWERDOWN_USB_Msk       (0x40UL)                  /*!< USB (Bitfield-Mask: 0x01)                             */
#define SYSCFG_MEMPOWERDOWN_SRAM5_Pos     (5UL)                     /*!< SRAM5 (Bit 5)                                         */
#define SYSCFG_MEMPOWERDOWN_SRAM5_Msk     (0x20UL)                  /*!< SRAM5 (Bitfield-Mask: 0x01)                           */
#define SYSCFG_MEMPOWERDOWN_SRAM4_Pos     (4UL)                     /*!< SRAM4 (Bit 4)                                         */
#define SYSCFG_MEMPOWERDOWN_SRAM4_Msk     (0x10UL)                  /*!< SRAM4 (Bitfield-Mask: 0x01)                           */
#define SYSCFG_MEMPOWERDOWN_SRAM3_Pos     (3UL)                     /*!< SRAM3 (Bit 3)                                         */
#define SYSCFG_MEMPOWERDOWN_SRAM3_Msk     (0x8UL)                   /*!< SRAM3 (Bitfield-Mask: 0x01)                           */
#define SYSCFG_MEMPOWERDOWN_SRAM2_Pos     (2UL)                     /*!< SRAM2 (Bit 2)                                         */
#define SYSCFG_MEMPOWERDOWN_SRAM2_Msk     (0x4UL)                   /*!< SRAM2 (Bitfield-Mask: 0x01)                           */
#define SYSCFG_MEMPOWERDOWN_SRAM1_Pos     (1UL)                     /*!< SRAM1 (Bit 1)                                         */
#define SYSCFG_MEMPOWERDOWN_SRAM1_Msk     (0x2UL)                   /*!< SRAM1 (Bitfield-Mask: 0x01)                           */
#define SYSCFG_MEMPOWERDOWN_SRAM0_Pos     (0UL)                     /*!< SRAM0 (Bit 0)                                         */
#define SYSCFG_MEMPOWERDOWN_SRAM0_Msk     (0x1UL)                   /*!< SRAM0 (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                          CLOCKS                                           ================ */
/* =========================================================================================================================== */

