mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ====================================================  CLK_GPOUT0_CTRL  ==================================================== */
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_Pos  (20UL)                    /*!< NUDGE (Bit 20)                                        */
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_Msk  (0x100000UL)              /*!< NUDGE (Bitfield-Mask: 0x01)                           */
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_Pos  (16UL)                    /*!< PHASE (Bit 16)                                        */
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_Msk  (0x30000UL)               /*!< PHASE (Bitfield-Mask: 0x03)                           */
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_Pos   (12UL)                    /*!< DC50 (Bit 12)                                         */
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_Msk   (0x1000UL)                /*!< DC50 (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_Pos (11UL)                    /*!< ENABLE (Bit 11)                                       */
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_Msk (0x800UL)                 /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_Pos   (10UL)                    /*!< KILL (Bit 10)                                         */
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_Msk   (0x400UL)                 /*!< KILL (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_Pos (5UL)                     /*!< AUXSRC (Bit 5)                                        */
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_Msk (0x1e0UL)                 /*!< AUXSRC (Bitfield-Mask: 0x0f)                          */
/* ====================================================  CLK_GPOUT0_DIV  ===================================================== */
#define CLOCKS_CLK_GPOUT0_DIV_INT_Pos     (8UL)                     /*!< INT (Bit 8)                                           */
#define CLOCKS_CLK_GPOUT0_DIV_INT_Msk     (0xffffff00UL)            /*!< INT (Bitfield-Mask: 0xffffff)                         */
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_Pos    (0UL)                     /*!< FRAC (Bit 0)                                          */
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_Msk    (0xffUL)                  /*!< FRAC (Bitfield-Mask: 0xff)                            */
/* ==================================================  CLK_GPOUT0_SELECTED  ================================================== */
/* ====================================================  CLK_GPOUT1_CTRL  ==================================================== */
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_Pos  (20UL)                    /*!< NUDGE (Bit 20)                                        */
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_Msk  (0x100000UL)              /*!< NUDGE (Bitfield-Mask: 0x01)                           */
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_Pos  (16UL)                    /*!< PHASE (Bit 16)                                        */
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_Msk  (0x30000UL)               /*!< PHASE (Bitfield-Mask: 0x03)                           */
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_Pos   (12UL)                    /*!< DC50 (Bit 12)                                         */
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_Msk   (0x1000UL)                /*!< DC50 (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_Pos (11UL)                    /*!< ENABLE (Bit 11)                                       */
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_Msk (0x800UL)                 /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_Pos   (10UL)                    /*!< KILL (Bit 10)                                         */
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_Msk   (0x400UL)                 /*!< KILL (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_Pos (5UL)                     /*!< AUXSRC (Bit 5)                                        */
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_Msk (0x1e0UL)                 /*!< AUXSRC (Bitfield-Mask: 0x0f)                          */
/* ====================================================  CLK_GPOUT1_DIV  ===================================================== */
#define CLOCKS_CLK_GPOUT1_DIV_INT_Pos     (8UL)                     /*!< INT (Bit 8)                                           */
#define CLOCKS_CLK_GPOUT1_DIV_INT_Msk     (0xffffff00UL)            /*!< INT (Bitfield-Mask: 0xffffff)                         */
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_Pos    (0UL)                     /*!< FRAC (Bit 0)                                          */
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_Msk    (0xffUL)                  /*!< FRAC (Bitfield-Mask: 0xff)                            */
/* ==================================================  CLK_GPOUT1_SELECTED  ================================================== */
/* ====================================================  CLK_GPOUT2_CTRL  ==================================================== */
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_Pos  (20UL)                    /*!< NUDGE (Bit 20)                                        */
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_Msk  (0x100000UL)              /*!< NUDGE (Bitfield-Mask: 0x01)                           */
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_Pos  (16UL)                    /*!< PHASE (Bit 16)                                        */
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_Msk  (0x30000UL)               /*!< PHASE (Bitfield-Mask: 0x03)                           */
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_Pos   (12UL)                    /*!< DC50 (Bit 12)                                         */
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_Msk   (0x1000UL)                /*!< DC50 (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_Pos (11UL)                    /*!< ENABLE (Bit 11)                                       */
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_Msk (0x800UL)                 /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_Pos   (10UL)                    /*!< KILL (Bit 10)                                         */
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_Msk   (0x400UL)                 /*!< KILL (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_Pos (5UL)                     /*!< AUXSRC (Bit 5)                                        */
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_Msk (0x1e0UL)                 /*!< AUXSRC (Bitfield-Mask: 0x0f)                          */
/* ====================================================  CLK_GPOUT2_DIV  ===================================================== */
#define CLOCKS_CLK_GPOUT2_DIV_INT_Pos     (8UL)                     /*!< INT (Bit 8)                                           */
#define CLOCKS_CLK_GPOUT2_DIV_INT_Msk     (0xffffff00UL)            /*!< INT (Bitfield-Mask: 0xffffff)                         */
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_Pos    (0UL)                     /*!< FRAC (Bit 0)                                          */
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_Msk    (0xffUL)                  /*!< FRAC (Bitfield-Mask: 0xff)                            */
/* ==================================================  CLK_GPOUT2_SELECTED  ================================================== */
/* ====================================================  CLK_GPOUT3_CTRL  ==================================================== */
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_Pos  (20UL)                    /*!< NUDGE (Bit 20)                                        */
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_Msk  (0x100000UL)              /*!< NUDGE (Bitfield-Mask: 0x01)                           */
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_Pos  (16UL)                    /*!< PHASE (Bit 16)                                        */
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_Msk  (0x30000UL)               /*!< PHASE (Bitfield-Mask: 0x03)                           */
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_Pos   (12UL)                    /*!< DC50 (Bit 12)                                         */
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_Msk   (0x1000UL)                /*!< DC50 (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_Pos (11UL)                    /*!< ENABLE (Bit 11)                                       */
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_Msk (0x800UL)                 /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_Pos   (10UL)                    /*!< KILL (Bit 10)                                         */
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_Msk   (0x400UL)                 /*!< KILL (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_Pos (5UL)                     /*!< AUXSRC (Bit 5)                                        */
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_Msk (0x1e0UL)                 /*!< AUXSRC (Bitfield-Mask: 0x0f)                          */
/* ====================================================  CLK_GPOUT3_DIV  ===================================================== */
#define CLOCKS_CLK_GPOUT3_DIV_INT_Pos     (8UL)                     /*!< INT (Bit 8)                                           */
#define CLOCKS_CLK_GPOUT3_DIV_INT_Msk     (0xffffff00UL)            /*!< INT (Bitfield-Mask: 0xffffff)                         */
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_Pos    (0UL)                     /*!< FRAC (Bit 0)                                          */
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_Msk    (0xffUL)                  /*!< FRAC (Bitfield-Mask: 0xff)                            */
/* ==================================================  CLK_GPOUT3_SELECTED  ================================================== */
/* =====================================================  CLK_REF_CTRL  ====================================================== */
#define CLOCKS_CLK_REF_CTRL_AUXSRC_Pos    (5UL)                     /*!< AUXSRC (Bit 5)                                        */
#define CLOCKS_CLK_REF_CTRL_AUXSRC_Msk    (0x60UL)                  /*!< AUXSRC (Bitfield-Mask: 0x03)                          */
#define CLOCKS_CLK_REF_CTRL_SRC_Pos       (0UL)                     /*!< SRC (Bit 0)                                           */
#define CLOCKS_CLK_REF_CTRL_SRC_Msk       (0x3UL)                   /*!< SRC (Bitfield-Mask: 0x03)                             */
/* ======================================================  CLK_REF_DIV  ====================================================== */
#define CLOCKS_CLK_REF_DIV_INT_Pos        (8UL)                     /*!< INT (Bit 8)                                           */
#define CLOCKS_CLK_REF_DIV_INT_Msk        (0x300UL)                 /*!< INT (Bitfield-Mask: 0x03)                             */
/* ===================================================  CLK_REF_SELECTED  ==================================================== */
/* =====================================================  CLK_SYS_CTRL  ====================================================== */
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_Pos    (5UL)                     /*!< AUXSRC (Bit 5)                                        */
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_Msk    (0xe0UL)                  /*!< AUXSRC (Bitfield-Mask: 0x07)                          */
#define CLOCKS_CLK_SYS_CTRL_SRC_Pos       (0UL)                     /*!< SRC (Bit 0)                                           */
#define CLOCKS_CLK_SYS_CTRL_SRC_Msk       (0x1UL)                   /*!< SRC (Bitfield-Mask: 0x01)                             */
/* ======================================================  CLK_SYS_DIV  ====================================================== */
#define CLOCKS_CLK_SYS_DIV_INT_Pos        (8UL)                     /*!< INT (Bit 8)                                           */
#define CLOCKS_CLK_SYS_DIV_INT_Msk        (0xffffff00UL)            /*!< INT (Bitfield-Mask: 0xffffff)                         */
#define CLOCKS_CLK_SYS_DIV_FRAC_Pos       (0UL)                     /*!< FRAC (Bit 0)                                          */
#define CLOCKS_CLK_SYS_DIV_FRAC_Msk       (0xffUL)                  /*!< FRAC (Bitfield-Mask: 0xff)                            */
/* ===================================================  CLK_SYS_SELECTED  ==================================================== */
/* =====================================================  CLK_PERI_CTRL  ===================================================== */
#define CLOCKS_CLK_PERI_CTRL_ENABLE_Pos   (11UL)                    /*!< ENABLE (Bit 11)                                       */
#define CLOCKS_CLK_PERI_CTRL_ENABLE_Msk   (0x800UL)                 /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define CLOCKS_CLK_PERI_CTRL_KILL_Pos     (10UL)                    /*!< KILL (Bit 10)                                         */
#define CLOCKS_CLK_PERI_CTRL_KILL_Msk     (0x400UL)                 /*!< KILL (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_Pos   (5UL)                     /*!< AUXSRC (Bit 5)                                        */
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_Msk   (0xe0UL)                  /*!< AUXSRC (Bitfield-Mask: 0x07)                          */
/* ===================================================  CLK_PERI_SELECTED  =================================================== */
/* =====================================================  CLK_USB_CTRL  ====================================================== */
#define CLOCKS_CLK_USB_CTRL_NUDGE_Pos     (20UL)                    /*!< NUDGE (Bit 20)                                        */
#define CLOCKS_CLK_USB_CTRL_NUDGE_Msk     (0x100000UL)              /*!< NUDGE (Bitfield-Mask: 0x01)                           */
#define CLOCKS_CLK_USB_CTRL_PHASE_Pos     (16UL)                    /*!< PHASE (Bit 16)                                        */
#define CLOCKS_CLK_USB_CTRL_PHASE_Msk     (0x30000UL)               /*!< PHASE (Bitfield-Mask: 0x03)                           */
#define CLOCKS_CLK_USB_CTRL_ENABLE_Pos    (11UL)                    /*!< ENABLE (Bit 11)                                       */
#define CLOCKS_CLK_USB_CTRL_ENABLE_Msk    (0x800UL)                 /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define CLOCKS_CLK_USB_CTRL_KILL_Pos      (10UL)                    /*!< KILL (Bit 10)                                         */
#define CLOCKS_CLK_USB_CTRL_KILL_Msk      (0x400UL)                 /*!< KILL (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_USB_CTRL_AUXSRC_Pos    (5UL)                     /*!< AUXSRC (Bit 5)                                        */
#define CLOCKS_CLK_USB_CTRL_AUXSRC_Msk    (0xe0UL)                  /*!< AUXSRC (Bitfield-Mask: 0x07)                          */
/* ======================================================  CLK_USB_DIV  ====================================================== */
#define CLOCKS_CLK_USB_DIV_INT_Pos        (8UL)                     /*!< INT (Bit 8)                                           */
#define CLOCKS_CLK_USB_DIV_INT_Msk        (0x300UL)                 /*!< INT (Bitfield-Mask: 0x03)                             */
/* ===================================================  CLK_USB_SELECTED  ==================================================== */
/* =====================================================  CLK_ADC_CTRL  ====================================================== */
#define CLOCKS_CLK_ADC_CTRL_NUDGE_Pos     (20UL)                    /*!< NUDGE (Bit 20)                                        */
#define CLOCKS_CLK_ADC_CTRL_NUDGE_Msk     (0x100000UL)              /*!< NUDGE (Bitfield-Mask: 0x01)                           */
#define CLOCKS_CLK_ADC_CTRL_PHASE_Pos     (16UL)                    /*!< PHASE (Bit 16)                                        */
#define CLOCKS_CLK_ADC_CTRL_PHASE_Msk     (0x30000UL)               /*!< PHASE (Bitfield-Mask: 0x03)                           */
#define CLOCKS_CLK_ADC_CTRL_ENABLE_Pos    (11UL)                    /*!< ENABLE (Bit 11)                                       */
#define CLOCKS_CLK_ADC_CTRL_ENABLE_Msk    (0x800UL)                 /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define CLOCKS_CLK_ADC_CTRL_KILL_Pos      (10UL)                    /*!< KILL (Bit 10)                                         */
#define CLOCKS_CLK_ADC_CTRL_KILL_Msk      (0x400UL)                 /*!< KILL (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_Pos    (5UL)                     /*!< AUXSRC (Bit 5)                                        */
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_Msk    (0xe0UL)                  /*!< AUXSRC (Bitfield-Mask: 0x07)                          */
/* ======================================================  CLK_ADC_DIV  ====================================================== */
#define CLOCKS_CLK_ADC_DIV_INT_Pos        (8UL)                     /*!< INT (Bit 8)                                           */
#define CLOCKS_CLK_ADC_DIV_INT_Msk        (0x300UL)                 /*!< INT (Bitfield-Mask: 0x03)                             */
/* ===================================================  CLK_ADC_SELECTED  ==================================================== */
/* =====================================================  CLK_RTC_CTRL  ====================================================== */
#define CLOCKS_CLK_RTC_CTRL_NUDGE_Pos     (20UL)                    /*!< NUDGE (Bit 20)                                        */
#define CLOCKS_CLK_RTC_CTRL_NUDGE_Msk     (0x100000UL)              /*!< NUDGE (Bitfield-Mask: 0x01)                           */
#define CLOCKS_CLK_RTC_CTRL_PHASE_Pos     (16UL)                    /*!< PHASE (Bit 16)                                        */
#define CLOCKS_CLK_RTC_CTRL_PHASE_Msk     (0x30000UL)               /*!< PHASE (Bitfield-Mask: 0x03)                           */
#define CLOCKS_CLK_RTC_CTRL_ENABLE_Pos    (11UL)                    /*!< ENABLE (Bit 11)                                       */
#define CLOCKS_CLK_RTC_CTRL_ENABLE_Msk    (0x800UL)                 /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define CLOCKS_CLK_RTC_CTRL_KILL_Pos      (10UL)                    /*!< KILL (Bit 10)                                         */
#define CLOCKS_CLK_RTC_CTRL_KILL_Msk      (0x400UL)                 /*!< KILL (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_RTC_CTRL_AUXSRC_Pos    (5UL)                     /*!< AUXSRC (Bit 5)                                        */
#define CLOCKS_CLK_RTC_CTRL_AUXSRC_Msk    (0xe0UL)                  /*!< AUXSRC (Bitfield-Mask: 0x07)                          */
/* ======================================================  CLK_RTC_DIV  ====================================================== */
#define CLOCKS_CLK_RTC_DIV_INT_Pos        (8UL)                     /*!< INT (Bit 8)                                           */
#define CLOCKS_CLK_RTC_DIV_INT_Msk        (0xffffff00UL)            /*!< INT (Bitfield-Mask: 0xffffff)                         */
#define CLOCKS_CLK_RTC_DIV_FRAC_Pos       (0UL)                     /*!< FRAC (Bit 0)                                          */
#define CLOCKS_CLK_RTC_DIV_FRAC_Msk       (0xffUL)                  /*!< FRAC (Bitfield-Mask: 0xff)                            */
/* ===================================================  CLK_RTC_SELECTED  ==================================================== */
/* ==================================================  CLK_SYS_RESUS_CTRL  =================================================== */
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_Pos (16UL)                  /*!< CLEAR (Bit 16)                                        */
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_Msk (0x10000UL)             /*!< CLEAR (Bitfield-Mask: 0x01)                           */
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_Pos (12UL)                   /*!< FRCE (Bit 12)                                         */
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_Msk (0x1000UL)               /*!< FRCE (Bitfield-Mask: 0x01)                            */
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_Pos (8UL)                  /*!< ENABLE (Bit 8)                                        */
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_Msk (0x100UL)              /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_Pos (0UL)                 /*!< TIMEOUT (Bit 0)                                       */
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_Msk (0xffUL)              /*!< TIMEOUT (Bitfield-Mask: 0xff)                         */
/* =================================================  CLK_SYS_RESUS_STATUS  ================================================== */
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_Pos (0UL)              /*!< RESUSSED (Bit 0)                                      */
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_Msk (0x1UL)            /*!< RESUSSED (Bitfield-Mask: 0x01)                        */
/* ======================================================  FC0_REF_KHZ  ====================================================== */
#define CLOCKS_FC0_REF_KHZ_FC0_REF_KHZ_Pos (0UL)                    /*!< FC0_REF_KHZ (Bit 0)                                   */
#define CLOCKS_FC0_REF_KHZ_FC0_REF_KHZ_Msk (0xfffffUL)              /*!< FC0_REF_KHZ (Bitfield-Mask: 0xfffff)                  */
/* ======================================================  FC0_MIN_KHZ  ====================================================== */
#define CLOCKS_FC0_MIN_KHZ_FC0_MIN_KHZ_Pos (0UL)                    /*!< FC0_MIN_KHZ (Bit 0)                                   */
#define CLOCKS_FC0_MIN_KHZ_FC0_MIN_KHZ_Msk (0x1ffffffUL)            /*!< FC0_MIN_KHZ (Bitfield-Mask: 0x1ffffff)                */
/* ======================================================  FC0_MAX_KHZ  ====================================================== */
#define CLOCKS_FC0_MAX_KHZ_FC0_MAX_KHZ_Pos (0UL)                    /*!< FC0_MAX_KHZ (Bit 0)                                   */
#define CLOCKS_FC0_MAX_KHZ_FC0_MAX_KHZ_Msk (0x1ffffffUL)            /*!< FC0_MAX_KHZ (Bitfield-Mask: 0x1ffffff)                */
/* =======================================================  FC0_DELAY  ======================================================= */
#define CLOCKS_FC0_DELAY_FC0_DELAY_Pos    (0UL)                     /*!< FC0_DELAY (Bit 0)                                     */
#define CLOCKS_FC0_DELAY_FC0_DELAY_Msk    (0x7UL)                   /*!< FC0_DELAY (Bitfield-Mask: 0x07)                       */
/* =====================================================  FC0_INTERVAL  ====================================================== */
#define CLOCKS_FC0_INTERVAL_FC0_INTERVAL_Pos (0UL)                  /*!< FC0_INTERVAL (Bit 0)                                  */
#define CLOCKS_FC0_INTERVAL_FC0_INTERVAL_Msk (0xfUL)                /*!< FC0_INTERVAL (Bitfield-Mask: 0x0f)                    */
/* ========================================================  FC0_SRC  ======================================================== */
#define CLOCKS_FC0_SRC_FC0_SRC_Pos        (0UL)                     /*!< FC0_SRC (Bit 0)                                       */
#define CLOCKS_FC0_SRC_FC0_SRC_Msk        (0xffUL)                  /*!< FC0_SRC (Bitfield-Mask: 0xff)                         */
/* ======================================================  FC0_STATUS  ======================================================= */
#define CLOCKS_FC0_STATUS_DIED_Pos        (28UL)                    /*!< DIED (Bit 28)                                         */
#define CLOCKS_FC0_STATUS_DIED_Msk        (0x10000000UL)            /*!< DIED (Bitfield-Mask: 0x01)                            */
