mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define CLOCKS_FC0_STATUS_FAST_Pos        (24UL)                    /*!< FAST (Bit 24)                                         */
#define CLOCKS_FC0_STATUS_FAST_Msk        (0x1000000UL)             /*!< FAST (Bitfield-Mask: 0x01)                            */
#define CLOCKS_FC0_STATUS_SLOW_Pos        (20UL)                    /*!< SLOW (Bit 20)                                         */
#define CLOCKS_FC0_STATUS_SLOW_Msk        (0x100000UL)              /*!< SLOW (Bitfield-Mask: 0x01)                            */
#define CLOCKS_FC0_STATUS_FAIL_Pos        (16UL)                    /*!< FAIL (Bit 16)                                         */
#define CLOCKS_FC0_STATUS_FAIL_Msk        (0x10000UL)               /*!< FAIL (Bitfield-Mask: 0x01)                            */
#define CLOCKS_FC0_STATUS_WAITING_Pos     (12UL)                    /*!< WAITING (Bit 12)                                      */
#define CLOCKS_FC0_STATUS_WAITING_Msk     (0x1000UL)                /*!< WAITING (Bitfield-Mask: 0x01)                         */
#define CLOCKS_FC0_STATUS_RUNNING_Pos     (8UL)                     /*!< RUNNING (Bit 8)                                       */
#define CLOCKS_FC0_STATUS_RUNNING_Msk     (0x100UL)                 /*!< RUNNING (Bitfield-Mask: 0x01)                         */
#define CLOCKS_FC0_STATUS_DONE_Pos        (4UL)                     /*!< DONE (Bit 4)                                          */
#define CLOCKS_FC0_STATUS_DONE_Msk        (0x10UL)                  /*!< DONE (Bitfield-Mask: 0x01)                            */
#define CLOCKS_FC0_STATUS_PASS_Pos        (0UL)                     /*!< PASS (Bit 0)                                          */
#define CLOCKS_FC0_STATUS_PASS_Msk        (0x1UL)                   /*!< PASS (Bitfield-Mask: 0x01)                            */
/* ======================================================  FC0_RESULT  ======================================================= */
#define CLOCKS_FC0_RESULT_KHZ_Pos         (5UL)                     /*!< KHZ (Bit 5)                                           */
#define CLOCKS_FC0_RESULT_KHZ_Msk         (0x3fffffe0UL)            /*!< KHZ (Bitfield-Mask: 0x1ffffff)                        */
#define CLOCKS_FC0_RESULT_FRAC_Pos        (0UL)                     /*!< FRAC (Bit 0)                                          */
#define CLOCKS_FC0_RESULT_FRAC_Msk        (0x1fUL)                  /*!< FRAC (Bitfield-Mask: 0x1f)                            */
/* =======================================================  WAKE_EN0  ======================================================== */
#define CLOCKS_WAKE_EN0_clk_sys_sram3_Pos (31UL)                    /*!< clk_sys_sram3 (Bit 31)                                */
#define CLOCKS_WAKE_EN0_clk_sys_sram3_Msk (0x80000000UL)            /*!< clk_sys_sram3 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_WAKE_EN0_clk_sys_sram2_Pos (30UL)                    /*!< clk_sys_sram2 (Bit 30)                                */
#define CLOCKS_WAKE_EN0_clk_sys_sram2_Msk (0x40000000UL)            /*!< clk_sys_sram2 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_WAKE_EN0_clk_sys_sram1_Pos (29UL)                    /*!< clk_sys_sram1 (Bit 29)                                */
#define CLOCKS_WAKE_EN0_clk_sys_sram1_Msk (0x20000000UL)            /*!< clk_sys_sram1 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_WAKE_EN0_clk_sys_sram0_Pos (28UL)                    /*!< clk_sys_sram0 (Bit 28)                                */
#define CLOCKS_WAKE_EN0_clk_sys_sram0_Msk (0x10000000UL)            /*!< clk_sys_sram0 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_WAKE_EN0_clk_sys_spi1_Pos  (27UL)                    /*!< clk_sys_spi1 (Bit 27)                                 */
#define CLOCKS_WAKE_EN0_clk_sys_spi1_Msk  (0x8000000UL)             /*!< clk_sys_spi1 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_WAKE_EN0_clk_peri_spi1_Pos (26UL)                    /*!< clk_peri_spi1 (Bit 26)                                */
#define CLOCKS_WAKE_EN0_clk_peri_spi1_Msk (0x4000000UL)             /*!< clk_peri_spi1 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_WAKE_EN0_clk_sys_spi0_Pos  (25UL)                    /*!< clk_sys_spi0 (Bit 25)                                 */
#define CLOCKS_WAKE_EN0_clk_sys_spi0_Msk  (0x2000000UL)             /*!< clk_sys_spi0 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_WAKE_EN0_clk_peri_spi0_Pos (24UL)                    /*!< clk_peri_spi0 (Bit 24)                                */
#define CLOCKS_WAKE_EN0_clk_peri_spi0_Msk (0x1000000UL)             /*!< clk_peri_spi0 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_WAKE_EN0_clk_sys_sio_Pos   (23UL)                    /*!< clk_sys_sio (Bit 23)                                  */
#define CLOCKS_WAKE_EN0_clk_sys_sio_Msk   (0x800000UL)              /*!< clk_sys_sio (Bitfield-Mask: 0x01)                     */
#define CLOCKS_WAKE_EN0_clk_sys_rtc_Pos   (22UL)                    /*!< clk_sys_rtc (Bit 22)                                  */
#define CLOCKS_WAKE_EN0_clk_sys_rtc_Msk   (0x400000UL)              /*!< clk_sys_rtc (Bitfield-Mask: 0x01)                     */
#define CLOCKS_WAKE_EN0_clk_rtc_rtc_Pos   (21UL)                    /*!< clk_rtc_rtc (Bit 21)                                  */
#define CLOCKS_WAKE_EN0_clk_rtc_rtc_Msk   (0x200000UL)              /*!< clk_rtc_rtc (Bitfield-Mask: 0x01)                     */
#define CLOCKS_WAKE_EN0_clk_sys_rosc_Pos  (20UL)                    /*!< clk_sys_rosc (Bit 20)                                 */
#define CLOCKS_WAKE_EN0_clk_sys_rosc_Msk  (0x100000UL)              /*!< clk_sys_rosc (Bitfield-Mask: 0x01)                    */
#define CLOCKS_WAKE_EN0_clk_sys_rom_Pos   (19UL)                    /*!< clk_sys_rom (Bit 19)                                  */
#define CLOCKS_WAKE_EN0_clk_sys_rom_Msk   (0x80000UL)               /*!< clk_sys_rom (Bitfield-Mask: 0x01)                     */
#define CLOCKS_WAKE_EN0_clk_sys_resets_Pos (18UL)                   /*!< clk_sys_resets (Bit 18)                               */
#define CLOCKS_WAKE_EN0_clk_sys_resets_Msk (0x40000UL)              /*!< clk_sys_resets (Bitfield-Mask: 0x01)                  */
#define CLOCKS_WAKE_EN0_clk_sys_pwm_Pos   (17UL)                    /*!< clk_sys_pwm (Bit 17)                                  */
#define CLOCKS_WAKE_EN0_clk_sys_pwm_Msk   (0x20000UL)               /*!< clk_sys_pwm (Bitfield-Mask: 0x01)                     */
#define CLOCKS_WAKE_EN0_clk_sys_psm_Pos   (16UL)                    /*!< clk_sys_psm (Bit 16)                                  */
#define CLOCKS_WAKE_EN0_clk_sys_psm_Msk   (0x10000UL)               /*!< clk_sys_psm (Bitfield-Mask: 0x01)                     */
#define CLOCKS_WAKE_EN0_clk_sys_pll_usb_Pos (15UL)                  /*!< clk_sys_pll_usb (Bit 15)                              */
#define CLOCKS_WAKE_EN0_clk_sys_pll_usb_Msk (0x8000UL)              /*!< clk_sys_pll_usb (Bitfield-Mask: 0x01)                 */
#define CLOCKS_WAKE_EN0_clk_sys_pll_sys_Pos (14UL)                  /*!< clk_sys_pll_sys (Bit 14)                              */
#define CLOCKS_WAKE_EN0_clk_sys_pll_sys_Msk (0x4000UL)              /*!< clk_sys_pll_sys (Bitfield-Mask: 0x01)                 */
#define CLOCKS_WAKE_EN0_clk_sys_pio1_Pos  (13UL)                    /*!< clk_sys_pio1 (Bit 13)                                 */
#define CLOCKS_WAKE_EN0_clk_sys_pio1_Msk  (0x2000UL)                /*!< clk_sys_pio1 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_WAKE_EN0_clk_sys_pio0_Pos  (12UL)                    /*!< clk_sys_pio0 (Bit 12)                                 */
#define CLOCKS_WAKE_EN0_clk_sys_pio0_Msk  (0x1000UL)                /*!< clk_sys_pio0 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_WAKE_EN0_clk_sys_pads_Pos  (11UL)                    /*!< clk_sys_pads (Bit 11)                                 */
#define CLOCKS_WAKE_EN0_clk_sys_pads_Msk  (0x800UL)                 /*!< clk_sys_pads (Bitfield-Mask: 0x01)                    */
#define CLOCKS_WAKE_EN0_clk_sys_vreg_and_chip_reset_Pos (10UL)      /*!< clk_sys_vreg_and_chip_reset (Bit 10)                  */
#define CLOCKS_WAKE_EN0_clk_sys_vreg_and_chip_reset_Msk (0x400UL)   /*!< clk_sys_vreg_and_chip_reset (Bitfield-Mask: 0x01)     */
#define CLOCKS_WAKE_EN0_clk_sys_jtag_Pos  (9UL)                     /*!< clk_sys_jtag (Bit 9)                                  */
#define CLOCKS_WAKE_EN0_clk_sys_jtag_Msk  (0x200UL)                 /*!< clk_sys_jtag (Bitfield-Mask: 0x01)                    */
#define CLOCKS_WAKE_EN0_clk_sys_io_Pos    (8UL)                     /*!< clk_sys_io (Bit 8)                                    */
#define CLOCKS_WAKE_EN0_clk_sys_io_Msk    (0x100UL)                 /*!< clk_sys_io (Bitfield-Mask: 0x01)                      */
#define CLOCKS_WAKE_EN0_clk_sys_i2c1_Pos  (7UL)                     /*!< clk_sys_i2c1 (Bit 7)                                  */
#define CLOCKS_WAKE_EN0_clk_sys_i2c1_Msk  (0x80UL)                  /*!< clk_sys_i2c1 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_WAKE_EN0_clk_sys_i2c0_Pos  (6UL)                     /*!< clk_sys_i2c0 (Bit 6)                                  */
#define CLOCKS_WAKE_EN0_clk_sys_i2c0_Msk  (0x40UL)                  /*!< clk_sys_i2c0 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_WAKE_EN0_clk_sys_dma_Pos   (5UL)                     /*!< clk_sys_dma (Bit 5)                                   */
#define CLOCKS_WAKE_EN0_clk_sys_dma_Msk   (0x20UL)                  /*!< clk_sys_dma (Bitfield-Mask: 0x01)                     */
#define CLOCKS_WAKE_EN0_clk_sys_busfabric_Pos (4UL)                 /*!< clk_sys_busfabric (Bit 4)                             */
#define CLOCKS_WAKE_EN0_clk_sys_busfabric_Msk (0x10UL)              /*!< clk_sys_busfabric (Bitfield-Mask: 0x01)               */
#define CLOCKS_WAKE_EN0_clk_sys_busctrl_Pos (3UL)                   /*!< clk_sys_busctrl (Bit 3)                               */
#define CLOCKS_WAKE_EN0_clk_sys_busctrl_Msk (0x8UL)                 /*!< clk_sys_busctrl (Bitfield-Mask: 0x01)                 */
#define CLOCKS_WAKE_EN0_clk_sys_adc_Pos   (2UL)                     /*!< clk_sys_adc (Bit 2)                                   */
#define CLOCKS_WAKE_EN0_clk_sys_adc_Msk   (0x4UL)                   /*!< clk_sys_adc (Bitfield-Mask: 0x01)                     */
#define CLOCKS_WAKE_EN0_clk_adc_adc_Pos   (1UL)                     /*!< clk_adc_adc (Bit 1)                                   */
#define CLOCKS_WAKE_EN0_clk_adc_adc_Msk   (0x2UL)                   /*!< clk_adc_adc (Bitfield-Mask: 0x01)                     */
#define CLOCKS_WAKE_EN0_clk_sys_clocks_Pos (0UL)                    /*!< clk_sys_clocks (Bit 0)                                */
#define CLOCKS_WAKE_EN0_clk_sys_clocks_Msk (0x1UL)                  /*!< clk_sys_clocks (Bitfield-Mask: 0x01)                  */
/* =======================================================  WAKE_EN1  ======================================================== */
#define CLOCKS_WAKE_EN1_clk_sys_xosc_Pos  (14UL)                    /*!< clk_sys_xosc (Bit 14)                                 */
#define CLOCKS_WAKE_EN1_clk_sys_xosc_Msk  (0x4000UL)                /*!< clk_sys_xosc (Bitfield-Mask: 0x01)                    */
#define CLOCKS_WAKE_EN1_clk_sys_xip_Pos   (13UL)                    /*!< clk_sys_xip (Bit 13)                                  */
#define CLOCKS_WAKE_EN1_clk_sys_xip_Msk   (0x2000UL)                /*!< clk_sys_xip (Bitfield-Mask: 0x01)                     */
#define CLOCKS_WAKE_EN1_clk_sys_watchdog_Pos (12UL)                 /*!< clk_sys_watchdog (Bit 12)                             */
#define CLOCKS_WAKE_EN1_clk_sys_watchdog_Msk (0x1000UL)             /*!< clk_sys_watchdog (Bitfield-Mask: 0x01)                */
#define CLOCKS_WAKE_EN1_clk_usb_usbctrl_Pos (11UL)                  /*!< clk_usb_usbctrl (Bit 11)                              */
#define CLOCKS_WAKE_EN1_clk_usb_usbctrl_Msk (0x800UL)               /*!< clk_usb_usbctrl (Bitfield-Mask: 0x01)                 */
#define CLOCKS_WAKE_EN1_clk_sys_usbctrl_Pos (10UL)                  /*!< clk_sys_usbctrl (Bit 10)                              */
#define CLOCKS_WAKE_EN1_clk_sys_usbctrl_Msk (0x400UL)               /*!< clk_sys_usbctrl (Bitfield-Mask: 0x01)                 */
#define CLOCKS_WAKE_EN1_clk_sys_uart1_Pos (9UL)                     /*!< clk_sys_uart1 (Bit 9)                                 */
#define CLOCKS_WAKE_EN1_clk_sys_uart1_Msk (0x200UL)                 /*!< clk_sys_uart1 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_WAKE_EN1_clk_peri_uart1_Pos (8UL)                    /*!< clk_peri_uart1 (Bit 8)                                */
#define CLOCKS_WAKE_EN1_clk_peri_uart1_Msk (0x100UL)                /*!< clk_peri_uart1 (Bitfield-Mask: 0x01)                  */
#define CLOCKS_WAKE_EN1_clk_sys_uart0_Pos (7UL)                     /*!< clk_sys_uart0 (Bit 7)                                 */
#define CLOCKS_WAKE_EN1_clk_sys_uart0_Msk (0x80UL)                  /*!< clk_sys_uart0 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_WAKE_EN1_clk_peri_uart0_Pos (6UL)                    /*!< clk_peri_uart0 (Bit 6)                                */
#define CLOCKS_WAKE_EN1_clk_peri_uart0_Msk (0x40UL)                 /*!< clk_peri_uart0 (Bitfield-Mask: 0x01)                  */
#define CLOCKS_WAKE_EN1_clk_sys_timer_Pos (5UL)                     /*!< clk_sys_timer (Bit 5)                                 */
#define CLOCKS_WAKE_EN1_clk_sys_timer_Msk (0x20UL)                  /*!< clk_sys_timer (Bitfield-Mask: 0x01)                   */
#define CLOCKS_WAKE_EN1_clk_sys_tbman_Pos (4UL)                     /*!< clk_sys_tbman (Bit 4)                                 */
#define CLOCKS_WAKE_EN1_clk_sys_tbman_Msk (0x10UL)                  /*!< clk_sys_tbman (Bitfield-Mask: 0x01)                   */
#define CLOCKS_WAKE_EN1_clk_sys_sysinfo_Pos (3UL)                   /*!< clk_sys_sysinfo (Bit 3)                               */
#define CLOCKS_WAKE_EN1_clk_sys_sysinfo_Msk (0x8UL)                 /*!< clk_sys_sysinfo (Bitfield-Mask: 0x01)                 */
#define CLOCKS_WAKE_EN1_clk_sys_syscfg_Pos (2UL)                    /*!< clk_sys_syscfg (Bit 2)                                */
#define CLOCKS_WAKE_EN1_clk_sys_syscfg_Msk (0x4UL)                  /*!< clk_sys_syscfg (Bitfield-Mask: 0x01)                  */
#define CLOCKS_WAKE_EN1_clk_sys_sram5_Pos (1UL)                     /*!< clk_sys_sram5 (Bit 1)                                 */
#define CLOCKS_WAKE_EN1_clk_sys_sram5_Msk (0x2UL)                   /*!< clk_sys_sram5 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_WAKE_EN1_clk_sys_sram4_Pos (0UL)                     /*!< clk_sys_sram4 (Bit 0)                                 */
#define CLOCKS_WAKE_EN1_clk_sys_sram4_Msk (0x1UL)                   /*!< clk_sys_sram4 (Bitfield-Mask: 0x01)                   */
/* =======================================================  SLEEP_EN0  ======================================================= */
#define CLOCKS_SLEEP_EN0_clk_sys_sram3_Pos (31UL)                   /*!< clk_sys_sram3 (Bit 31)                                */
#define CLOCKS_SLEEP_EN0_clk_sys_sram3_Msk (0x80000000UL)           /*!< clk_sys_sram3 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_SLEEP_EN0_clk_sys_sram2_Pos (30UL)                   /*!< clk_sys_sram2 (Bit 30)                                */
#define CLOCKS_SLEEP_EN0_clk_sys_sram2_Msk (0x40000000UL)           /*!< clk_sys_sram2 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_SLEEP_EN0_clk_sys_sram1_Pos (29UL)                   /*!< clk_sys_sram1 (Bit 29)                                */
#define CLOCKS_SLEEP_EN0_clk_sys_sram1_Msk (0x20000000UL)           /*!< clk_sys_sram1 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_SLEEP_EN0_clk_sys_sram0_Pos (28UL)                   /*!< clk_sys_sram0 (Bit 28)                                */
#define CLOCKS_SLEEP_EN0_clk_sys_sram0_Msk (0x10000000UL)           /*!< clk_sys_sram0 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_SLEEP_EN0_clk_sys_spi1_Pos (27UL)                    /*!< clk_sys_spi1 (Bit 27)                                 */
#define CLOCKS_SLEEP_EN0_clk_sys_spi1_Msk (0x8000000UL)             /*!< clk_sys_spi1 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_SLEEP_EN0_clk_peri_spi1_Pos (26UL)                   /*!< clk_peri_spi1 (Bit 26)                                */
#define CLOCKS_SLEEP_EN0_clk_peri_spi1_Msk (0x4000000UL)            /*!< clk_peri_spi1 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_SLEEP_EN0_clk_sys_spi0_Pos (25UL)                    /*!< clk_sys_spi0 (Bit 25)                                 */
#define CLOCKS_SLEEP_EN0_clk_sys_spi0_Msk (0x2000000UL)             /*!< clk_sys_spi0 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_SLEEP_EN0_clk_peri_spi0_Pos (24UL)                   /*!< clk_peri_spi0 (Bit 24)                                */
#define CLOCKS_SLEEP_EN0_clk_peri_spi0_Msk (0x1000000UL)            /*!< clk_peri_spi0 (Bitfield-Mask: 0x01)                   */
#define CLOCKS_SLEEP_EN0_clk_sys_sio_Pos  (23UL)                    /*!< clk_sys_sio (Bit 23)                                  */
#define CLOCKS_SLEEP_EN0_clk_sys_sio_Msk  (0x800000UL)              /*!< clk_sys_sio (Bitfield-Mask: 0x01)                     */
#define CLOCKS_SLEEP_EN0_clk_sys_rtc_Pos  (22UL)                    /*!< clk_sys_rtc (Bit 22)                                  */
#define CLOCKS_SLEEP_EN0_clk_sys_rtc_Msk  (0x400000UL)              /*!< clk_sys_rtc (Bitfield-Mask: 0x01)                     */
#define CLOCKS_SLEEP_EN0_clk_rtc_rtc_Pos  (21UL)                    /*!< clk_rtc_rtc (Bit 21)                                  */
#define CLOCKS_SLEEP_EN0_clk_rtc_rtc_Msk  (0x200000UL)              /*!< clk_rtc_rtc (Bitfield-Mask: 0x01)                     */
#define CLOCKS_SLEEP_EN0_clk_sys_rosc_Pos (20UL)                    /*!< clk_sys_rosc (Bit 20)                                 */
#define CLOCKS_SLEEP_EN0_clk_sys_rosc_Msk (0x100000UL)              /*!< clk_sys_rosc (Bitfield-Mask: 0x01)                    */
#define CLOCKS_SLEEP_EN0_clk_sys_rom_Pos  (19UL)                    /*!< clk_sys_rom (Bit 19)                                  */
#define CLOCKS_SLEEP_EN0_clk_sys_rom_Msk  (0x80000UL)               /*!< clk_sys_rom (Bitfield-Mask: 0x01)                     */
#define CLOCKS_SLEEP_EN0_clk_sys_resets_Pos (18UL)                  /*!< clk_sys_resets (Bit 18)                               */
#define CLOCKS_SLEEP_EN0_clk_sys_resets_Msk (0x40000UL)             /*!< clk_sys_resets (Bitfield-Mask: 0x01)                  */
#define CLOCKS_SLEEP_EN0_clk_sys_pwm_Pos  (17UL)                    /*!< clk_sys_pwm (Bit 17)                                  */
#define CLOCKS_SLEEP_EN0_clk_sys_pwm_Msk  (0x20000UL)               /*!< clk_sys_pwm (Bitfield-Mask: 0x01)                     */
#define CLOCKS_SLEEP_EN0_clk_sys_psm_Pos  (16UL)                    /*!< clk_sys_psm (Bit 16)                                  */
#define CLOCKS_SLEEP_EN0_clk_sys_psm_Msk  (0x10000UL)               /*!< clk_sys_psm (Bitfield-Mask: 0x01)                     */
#define CLOCKS_SLEEP_EN0_clk_sys_pll_usb_Pos (15UL)                 /*!< clk_sys_pll_usb (Bit 15)                              */
#define CLOCKS_SLEEP_EN0_clk_sys_pll_usb_Msk (0x8000UL)             /*!< clk_sys_pll_usb (Bitfield-Mask: 0x01)                 */
#define CLOCKS_SLEEP_EN0_clk_sys_pll_sys_Pos (14UL)                 /*!< clk_sys_pll_sys (Bit 14)                              */
#define CLOCKS_SLEEP_EN0_clk_sys_pll_sys_Msk (0x4000UL)             /*!< clk_sys_pll_sys (Bitfield-Mask: 0x01)                 */
#define CLOCKS_SLEEP_EN0_clk_sys_pio1_Pos (13UL)                    /*!< clk_sys_pio1 (Bit 13)                                 */
#define CLOCKS_SLEEP_EN0_clk_sys_pio1_Msk (0x2000UL)                /*!< clk_sys_pio1 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_SLEEP_EN0_clk_sys_pio0_Pos (12UL)                    /*!< clk_sys_pio0 (Bit 12)                                 */
#define CLOCKS_SLEEP_EN0_clk_sys_pio0_Msk (0x1000UL)                /*!< clk_sys_pio0 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_SLEEP_EN0_clk_sys_pads_Pos (11UL)                    /*!< clk_sys_pads (Bit 11)                                 */
#define CLOCKS_SLEEP_EN0_clk_sys_pads_Msk (0x800UL)                 /*!< clk_sys_pads (Bitfield-Mask: 0x01)                    */
#define CLOCKS_SLEEP_EN0_clk_sys_vreg_and_chip_reset_Pos (10UL)     /*!< clk_sys_vreg_and_chip_reset (Bit 10)                  */
#define CLOCKS_SLEEP_EN0_clk_sys_vreg_and_chip_reset_Msk (0x400UL)  /*!< clk_sys_vreg_and_chip_reset (Bitfield-Mask: 0x01)     */
#define CLOCKS_SLEEP_EN0_clk_sys_jtag_Pos (9UL)                     /*!< clk_sys_jtag (Bit 9)                                  */
#define CLOCKS_SLEEP_EN0_clk_sys_jtag_Msk (0x200UL)                 /*!< clk_sys_jtag (Bitfield-Mask: 0x01)                    */
#define CLOCKS_SLEEP_EN0_clk_sys_io_Pos   (8UL)                     /*!< clk_sys_io (Bit 8)                                    */
#define CLOCKS_SLEEP_EN0_clk_sys_io_Msk   (0x100UL)                 /*!< clk_sys_io (Bitfield-Mask: 0x01)                      */
#define CLOCKS_SLEEP_EN0_clk_sys_i2c1_Pos (7UL)                     /*!< clk_sys_i2c1 (Bit 7)                                  */
#define CLOCKS_SLEEP_EN0_clk_sys_i2c1_Msk (0x80UL)                  /*!< clk_sys_i2c1 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_SLEEP_EN0_clk_sys_i2c0_Pos (6UL)                     /*!< clk_sys_i2c0 (Bit 6)                                  */
#define CLOCKS_SLEEP_EN0_clk_sys_i2c0_Msk (0x40UL)                  /*!< clk_sys_i2c0 (Bitfield-Mask: 0x01)                    */
#define CLOCKS_SLEEP_EN0_clk_sys_dma_Pos  (5UL)                     /*!< clk_sys_dma (Bit 5)                                   */
#define CLOCKS_SLEEP_EN0_clk_sys_dma_Msk  (0x20UL)                  /*!< clk_sys_dma (Bitfield-Mask: 0x01)                     */
#define CLOCKS_SLEEP_EN0_clk_sys_busfabric_Pos (4UL)                /*!< clk_sys_busfabric (Bit 4)                             */
#define CLOCKS_SLEEP_EN0_clk_sys_busfabric_Msk (0x10UL)             /*!< clk_sys_busfabric (Bitfield-Mask: 0x01)               */
#define CLOCKS_SLEEP_EN0_clk_sys_busctrl_Pos (3UL)                  /*!< clk_sys_busctrl (Bit 3)                               */
#define CLOCKS_SLEEP_EN0_clk_sys_busctrl_Msk (0x8UL)                /*!< clk_sys_busctrl (Bitfield-Mask: 0x01)                 */
#define CLOCKS_SLEEP_EN0_clk_sys_adc_Pos  (2UL)                     /*!< clk_sys_adc (Bit 2)                                   */
#define CLOCKS_SLEEP_EN0_clk_sys_adc_Msk  (0x4UL)                   /*!< clk_sys_adc (Bitfield-Mask: 0x01)                     */
#define CLOCKS_SLEEP_EN0_clk_adc_adc_Pos  (1UL)                     /*!< clk_adc_adc (Bit 1)                                   */
#define CLOCKS_SLEEP_EN0_clk_adc_adc_Msk  (0x2UL)                   /*!< clk_adc_adc (Bitfield-Mask: 0x01)                     */
#define CLOCKS_SLEEP_EN0_clk_sys_clocks_Pos (0UL)                   /*!< clk_sys_clocks (Bit 0)                                */
#define CLOCKS_SLEEP_EN0_clk_sys_clocks_Msk (0x1UL)                 /*!< clk_sys_clocks (Bitfield-Mask: 0x01)                  */
/* =======================================================  SLEEP_EN1  ======================================================= */
#define CLOCKS_SLEEP_EN1_clk_sys_xosc_Pos (14UL)                    /*!< clk_sys_xosc (Bit 14)                                 */
#define CLOCKS_SLEEP_EN1_clk_sys_xosc_Msk (0x4000UL)                /*!< clk_sys_xosc (Bitfield-Mask: 0x01)                    */
#define CLOCKS_SLEEP_EN1_clk_sys_xip_Pos  (13UL)                    /*!< clk_sys_xip (Bit 13)                                  */
