mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =========================================================  RESET  ========================================================= */
#define RESETS_RESET_usbctrl_Pos          (24UL)                    /*!< usbctrl (Bit 24)                                      */
#define RESETS_RESET_usbctrl_Msk          (0x1000000UL)             /*!< usbctrl (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_uart1_Pos            (23UL)                    /*!< uart1 (Bit 23)                                        */
#define RESETS_RESET_uart1_Msk            (0x800000UL)              /*!< uart1 (Bitfield-Mask: 0x01)                           */
#define RESETS_RESET_uart0_Pos            (22UL)                    /*!< uart0 (Bit 22)                                        */
#define RESETS_RESET_uart0_Msk            (0x400000UL)              /*!< uart0 (Bitfield-Mask: 0x01)                           */
#define RESETS_RESET_timer_Pos            (21UL)                    /*!< timer (Bit 21)                                        */
#define RESETS_RESET_timer_Msk            (0x200000UL)              /*!< timer (Bitfield-Mask: 0x01)                           */
#define RESETS_RESET_tbman_Pos            (20UL)                    /*!< tbman (Bit 20)                                        */
#define RESETS_RESET_tbman_Msk            (0x100000UL)              /*!< tbman (Bitfield-Mask: 0x01)                           */
#define RESETS_RESET_sysinfo_Pos          (19UL)                    /*!< sysinfo (Bit 19)                                      */
#define RESETS_RESET_sysinfo_Msk          (0x80000UL)               /*!< sysinfo (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_syscfg_Pos           (18UL)                    /*!< syscfg (Bit 18)                                       */
#define RESETS_RESET_syscfg_Msk           (0x40000UL)               /*!< syscfg (Bitfield-Mask: 0x01)                          */
#define RESETS_RESET_spi1_Pos             (17UL)                    /*!< spi1 (Bit 17)                                         */
#define RESETS_RESET_spi1_Msk             (0x20000UL)               /*!< spi1 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_spi0_Pos             (16UL)                    /*!< spi0 (Bit 16)                                         */
#define RESETS_RESET_spi0_Msk             (0x10000UL)               /*!< spi0 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_rtc_Pos              (15UL)                    /*!< rtc (Bit 15)                                          */
#define RESETS_RESET_rtc_Msk              (0x8000UL)                /*!< rtc (Bitfield-Mask: 0x01)                             */
#define RESETS_RESET_pwm_Pos              (14UL)                    /*!< pwm (Bit 14)                                          */
#define RESETS_RESET_pwm_Msk              (0x4000UL)                /*!< pwm (Bitfield-Mask: 0x01)                             */
#define RESETS_RESET_pll_usb_Pos          (13UL)                    /*!< pll_usb (Bit 13)                                      */
#define RESETS_RESET_pll_usb_Msk          (0x2000UL)                /*!< pll_usb (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_pll_sys_Pos          (12UL)                    /*!< pll_sys (Bit 12)                                      */
#define RESETS_RESET_pll_sys_Msk          (0x1000UL)                /*!< pll_sys (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_pio1_Pos             (11UL)                    /*!< pio1 (Bit 11)                                         */
#define RESETS_RESET_pio1_Msk             (0x800UL)                 /*!< pio1 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_pio0_Pos             (10UL)                    /*!< pio0 (Bit 10)                                         */
#define RESETS_RESET_pio0_Msk             (0x400UL)                 /*!< pio0 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_pads_qspi_Pos        (9UL)                     /*!< pads_qspi (Bit 9)                                     */
#define RESETS_RESET_pads_qspi_Msk        (0x200UL)                 /*!< pads_qspi (Bitfield-Mask: 0x01)                       */
#define RESETS_RESET_pads_bank0_Pos       (8UL)                     /*!< pads_bank0 (Bit 8)                                    */
#define RESETS_RESET_pads_bank0_Msk       (0x100UL)                 /*!< pads_bank0 (Bitfield-Mask: 0x01)                      */
#define RESETS_RESET_jtag_Pos             (7UL)                     /*!< jtag (Bit 7)                                          */
#define RESETS_RESET_jtag_Msk             (0x80UL)                  /*!< jtag (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_io_qspi_Pos          (6UL)                     /*!< io_qspi (Bit 6)                                       */
#define RESETS_RESET_io_qspi_Msk          (0x40UL)                  /*!< io_qspi (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_io_bank0_Pos         (5UL)                     /*!< io_bank0 (Bit 5)                                      */
#define RESETS_RESET_io_bank0_Msk         (0x20UL)                  /*!< io_bank0 (Bitfield-Mask: 0x01)                        */
#define RESETS_RESET_i2c1_Pos             (4UL)                     /*!< i2c1 (Bit 4)                                          */
#define RESETS_RESET_i2c1_Msk             (0x10UL)                  /*!< i2c1 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_i2c0_Pos             (3UL)                     /*!< i2c0 (Bit 3)                                          */
#define RESETS_RESET_i2c0_Msk             (0x8UL)                   /*!< i2c0 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_dma_Pos              (2UL)                     /*!< dma (Bit 2)                                           */
#define RESETS_RESET_dma_Msk              (0x4UL)                   /*!< dma (Bitfield-Mask: 0x01)                             */
#define RESETS_RESET_busctrl_Pos          (1UL)                     /*!< busctrl (Bit 1)                                       */
#define RESETS_RESET_busctrl_Msk          (0x2UL)                   /*!< busctrl (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_adc_Pos              (0UL)                     /*!< adc (Bit 0)                                           */
#define RESETS_RESET_adc_Msk              (0x1UL)                   /*!< adc (Bitfield-Mask: 0x01)                             */
/* =========================================================  WDSEL  ========================================================= */
#define RESETS_WDSEL_usbctrl_Pos          (24UL)                    /*!< usbctrl (Bit 24)                                      */
#define RESETS_WDSEL_usbctrl_Msk          (0x1000000UL)             /*!< usbctrl (Bitfield-Mask: 0x01)                         */
#define RESETS_WDSEL_uart1_Pos            (23UL)                    /*!< uart1 (Bit 23)                                        */
#define RESETS_WDSEL_uart1_Msk            (0x800000UL)              /*!< uart1 (Bitfield-Mask: 0x01)                           */
#define RESETS_WDSEL_uart0_Pos            (22UL)                    /*!< uart0 (Bit 22)                                        */
#define RESETS_WDSEL_uart0_Msk            (0x400000UL)              /*!< uart0 (Bitfield-Mask: 0x01)                           */
#define RESETS_WDSEL_timer_Pos            (21UL)                    /*!< timer (Bit 21)                                        */
#define RESETS_WDSEL_timer_Msk            (0x200000UL)              /*!< timer (Bitfield-Mask: 0x01)                           */
#define RESETS_WDSEL_tbman_Pos            (20UL)                    /*!< tbman (Bit 20)                                        */
#define RESETS_WDSEL_tbman_Msk            (0x100000UL)              /*!< tbman (Bitfield-Mask: 0x01)                           */
#define RESETS_WDSEL_sysinfo_Pos          (19UL)                    /*!< sysinfo (Bit 19)                                      */
#define RESETS_WDSEL_sysinfo_Msk          (0x80000UL)               /*!< sysinfo (Bitfield-Mask: 0x01)                         */
#define RESETS_WDSEL_syscfg_Pos           (18UL)                    /*!< syscfg (Bit 18)                                       */
#define RESETS_WDSEL_syscfg_Msk           (0x40000UL)               /*!< syscfg (Bitfield-Mask: 0x01)                          */
#define RESETS_WDSEL_spi1_Pos             (17UL)                    /*!< spi1 (Bit 17)                                         */
#define RESETS_WDSEL_spi1_Msk             (0x20000UL)               /*!< spi1 (Bitfield-Mask: 0x01)                            */
#define RESETS_WDSEL_spi0_Pos             (16UL)                    /*!< spi0 (Bit 16)                                         */
#define RESETS_WDSEL_spi0_Msk             (0x10000UL)               /*!< spi0 (Bitfield-Mask: 0x01)                            */
#define RESETS_WDSEL_rtc_Pos              (15UL)                    /*!< rtc (Bit 15)                                          */
#define RESETS_WDSEL_rtc_Msk              (0x8000UL)                /*!< rtc (Bitfield-Mask: 0x01)                             */
#define RESETS_WDSEL_pwm_Pos              (14UL)                    /*!< pwm (Bit 14)                                          */
#define RESETS_WDSEL_pwm_Msk              (0x4000UL)                /*!< pwm (Bitfield-Mask: 0x01)                             */
#define RESETS_WDSEL_pll_usb_Pos          (13UL)                    /*!< pll_usb (Bit 13)                                      */
#define RESETS_WDSEL_pll_usb_Msk          (0x2000UL)                /*!< pll_usb (Bitfield-Mask: 0x01)                         */
#define RESETS_WDSEL_pll_sys_Pos          (12UL)                    /*!< pll_sys (Bit 12)                                      */
#define RESETS_WDSEL_pll_sys_Msk          (0x1000UL)                /*!< pll_sys (Bitfield-Mask: 0x01)                         */
#define RESETS_WDSEL_pio1_Pos             (11UL)                    /*!< pio1 (Bit 11)                                         */
#define RESETS_WDSEL_pio1_Msk             (0x800UL)                 /*!< pio1 (Bitfield-Mask: 0x01)                            */
#define RESETS_WDSEL_pio0_Pos             (10UL)                    /*!< pio0 (Bit 10)                                         */
#define RESETS_WDSEL_pio0_Msk             (0x400UL)                 /*!< pio0 (Bitfield-Mask: 0x01)                            */
#define RESETS_WDSEL_pads_qspi_Pos        (9UL)                     /*!< pads_qspi (Bit 9)                                     */
#define RESETS_WDSEL_pads_qspi_Msk        (0x200UL)                 /*!< pads_qspi (Bitfield-Mask: 0x01)                       */
#define RESETS_WDSEL_pads_bank0_Pos       (8UL)                     /*!< pads_bank0 (Bit 8)                                    */
#define RESETS_WDSEL_pads_bank0_Msk       (0x100UL)                 /*!< pads_bank0 (Bitfield-Mask: 0x01)                      */
#define RESETS_WDSEL_jtag_Pos             (7UL)                     /*!< jtag (Bit 7)                                          */
#define RESETS_WDSEL_jtag_Msk             (0x80UL)                  /*!< jtag (Bitfield-Mask: 0x01)                            */
#define RESETS_WDSEL_io_qspi_Pos          (6UL)                     /*!< io_qspi (Bit 6)                                       */
#define RESETS_WDSEL_io_qspi_Msk          (0x40UL)                  /*!< io_qspi (Bitfield-Mask: 0x01)                         */
#define RESETS_WDSEL_io_bank0_Pos         (5UL)                     /*!< io_bank0 (Bit 5)                                      */
#define RESETS_WDSEL_io_bank0_Msk         (0x20UL)                  /*!< io_bank0 (Bitfield-Mask: 0x01)                        */
#define RESETS_WDSEL_i2c1_Pos             (4UL)                     /*!< i2c1 (Bit 4)                                          */
#define RESETS_WDSEL_i2c1_Msk             (0x10UL)                  /*!< i2c1 (Bitfield-Mask: 0x01)                            */
#define RESETS_WDSEL_i2c0_Pos             (3UL)                     /*!< i2c0 (Bit 3)                                          */
#define RESETS_WDSEL_i2c0_Msk             (0x8UL)                   /*!< i2c0 (Bitfield-Mask: 0x01)                            */
#define RESETS_WDSEL_dma_Pos              (2UL)                     /*!< dma (Bit 2)                                           */
#define RESETS_WDSEL_dma_Msk              (0x4UL)                   /*!< dma (Bitfield-Mask: 0x01)                             */
#define RESETS_WDSEL_busctrl_Pos          (1UL)                     /*!< busctrl (Bit 1)                                       */
#define RESETS_WDSEL_busctrl_Msk          (0x2UL)                   /*!< busctrl (Bitfield-Mask: 0x01)                         */
#define RESETS_WDSEL_adc_Pos              (0UL)                     /*!< adc (Bit 0)                                           */
#define RESETS_WDSEL_adc_Msk              (0x1UL)                   /*!< adc (Bitfield-Mask: 0x01)                             */
/* ======================================================  RESET_DONE  ======================================================= */
#define RESETS_RESET_DONE_usbctrl_Pos     (24UL)                    /*!< usbctrl (Bit 24)                                      */
#define RESETS_RESET_DONE_usbctrl_Msk     (0x1000000UL)             /*!< usbctrl (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_DONE_uart1_Pos       (23UL)                    /*!< uart1 (Bit 23)                                        */
#define RESETS_RESET_DONE_uart1_Msk       (0x800000UL)              /*!< uart1 (Bitfield-Mask: 0x01)                           */
#define RESETS_RESET_DONE_uart0_Pos       (22UL)                    /*!< uart0 (Bit 22)                                        */
#define RESETS_RESET_DONE_uart0_Msk       (0x400000UL)              /*!< uart0 (Bitfield-Mask: 0x01)                           */
#define RESETS_RESET_DONE_timer_Pos       (21UL)                    /*!< timer (Bit 21)                                        */
#define RESETS_RESET_DONE_timer_Msk       (0x200000UL)              /*!< timer (Bitfield-Mask: 0x01)                           */
#define RESETS_RESET_DONE_tbman_Pos       (20UL)                    /*!< tbman (Bit 20)                                        */
#define RESETS_RESET_DONE_tbman_Msk       (0x100000UL)              /*!< tbman (Bitfield-Mask: 0x01)                           */
#define RESETS_RESET_DONE_sysinfo_Pos     (19UL)                    /*!< sysinfo (Bit 19)                                      */
#define RESETS_RESET_DONE_sysinfo_Msk     (0x80000UL)               /*!< sysinfo (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_DONE_syscfg_Pos      (18UL)                    /*!< syscfg (Bit 18)                                       */
#define RESETS_RESET_DONE_syscfg_Msk      (0x40000UL)               /*!< syscfg (Bitfield-Mask: 0x01)                          */
#define RESETS_RESET_DONE_spi1_Pos        (17UL)                    /*!< spi1 (Bit 17)                                         */
#define RESETS_RESET_DONE_spi1_Msk        (0x20000UL)               /*!< spi1 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_DONE_spi0_Pos        (16UL)                    /*!< spi0 (Bit 16)                                         */
#define RESETS_RESET_DONE_spi0_Msk        (0x10000UL)               /*!< spi0 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_DONE_rtc_Pos         (15UL)                    /*!< rtc (Bit 15)                                          */
#define RESETS_RESET_DONE_rtc_Msk         (0x8000UL)                /*!< rtc (Bitfield-Mask: 0x01)                             */
#define RESETS_RESET_DONE_pwm_Pos         (14UL)                    /*!< pwm (Bit 14)                                          */
#define RESETS_RESET_DONE_pwm_Msk         (0x4000UL)                /*!< pwm (Bitfield-Mask: 0x01)                             */
#define RESETS_RESET_DONE_pll_usb_Pos     (13UL)                    /*!< pll_usb (Bit 13)                                      */
#define RESETS_RESET_DONE_pll_usb_Msk     (0x2000UL)                /*!< pll_usb (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_DONE_pll_sys_Pos     (12UL)                    /*!< pll_sys (Bit 12)                                      */
#define RESETS_RESET_DONE_pll_sys_Msk     (0x1000UL)                /*!< pll_sys (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_DONE_pio1_Pos        (11UL)                    /*!< pio1 (Bit 11)                                         */
#define RESETS_RESET_DONE_pio1_Msk        (0x800UL)                 /*!< pio1 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_DONE_pio0_Pos        (10UL)                    /*!< pio0 (Bit 10)                                         */
#define RESETS_RESET_DONE_pio0_Msk        (0x400UL)                 /*!< pio0 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_DONE_pads_qspi_Pos   (9UL)                     /*!< pads_qspi (Bit 9)                                     */
#define RESETS_RESET_DONE_pads_qspi_Msk   (0x200UL)                 /*!< pads_qspi (Bitfield-Mask: 0x01)                       */
#define RESETS_RESET_DONE_pads_bank0_Pos  (8UL)                     /*!< pads_bank0 (Bit 8)                                    */
#define RESETS_RESET_DONE_pads_bank0_Msk  (0x100UL)                 /*!< pads_bank0 (Bitfield-Mask: 0x01)                      */
#define RESETS_RESET_DONE_jtag_Pos        (7UL)                     /*!< jtag (Bit 7)                                          */
#define RESETS_RESET_DONE_jtag_Msk        (0x80UL)                  /*!< jtag (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_DONE_io_qspi_Pos     (6UL)                     /*!< io_qspi (Bit 6)                                       */
#define RESETS_RESET_DONE_io_qspi_Msk     (0x40UL)                  /*!< io_qspi (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_DONE_io_bank0_Pos    (5UL)                     /*!< io_bank0 (Bit 5)                                      */
#define RESETS_RESET_DONE_io_bank0_Msk    (0x20UL)                  /*!< io_bank0 (Bitfield-Mask: 0x01)                        */
#define RESETS_RESET_DONE_i2c1_Pos        (4UL)                     /*!< i2c1 (Bit 4)                                          */
#define RESETS_RESET_DONE_i2c1_Msk        (0x10UL)                  /*!< i2c1 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_DONE_i2c0_Pos        (3UL)                     /*!< i2c0 (Bit 3)                                          */
#define RESETS_RESET_DONE_i2c0_Msk        (0x8UL)                   /*!< i2c0 (Bitfield-Mask: 0x01)                            */
#define RESETS_RESET_DONE_dma_Pos         (2UL)                     /*!< dma (Bit 2)                                           */
#define RESETS_RESET_DONE_dma_Msk         (0x4UL)                   /*!< dma (Bitfield-Mask: 0x01)                             */
#define RESETS_RESET_DONE_busctrl_Pos     (1UL)                     /*!< busctrl (Bit 1)                                       */
#define RESETS_RESET_DONE_busctrl_Msk     (0x2UL)                   /*!< busctrl (Bitfield-Mask: 0x01)                         */
#define RESETS_RESET_DONE_adc_Pos         (0UL)                     /*!< adc (Bit 0)                                           */
#define RESETS_RESET_DONE_adc_Msk         (0x1UL)                   /*!< adc (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                            PSM                                            ================ */
/* =========================================================================================================================== */

