mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ========================================================  FRCE_ON  ======================================================== */
#define PSM_FRCE_ON_proc1_Pos             (16UL)                    /*!< proc1 (Bit 16)                                        */
#define PSM_FRCE_ON_proc1_Msk             (0x10000UL)               /*!< proc1 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_ON_proc0_Pos             (15UL)                    /*!< proc0 (Bit 15)                                        */
#define PSM_FRCE_ON_proc0_Msk             (0x8000UL)                /*!< proc0 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_ON_sio_Pos               (14UL)                    /*!< sio (Bit 14)                                          */
#define PSM_FRCE_ON_sio_Msk               (0x4000UL)                /*!< sio (Bitfield-Mask: 0x01)                             */
#define PSM_FRCE_ON_vreg_and_chip_reset_Pos (13UL)                  /*!< vreg_and_chip_reset (Bit 13)                          */
#define PSM_FRCE_ON_vreg_and_chip_reset_Msk (0x2000UL)              /*!< vreg_and_chip_reset (Bitfield-Mask: 0x01)             */
#define PSM_FRCE_ON_xip_Pos               (12UL)                    /*!< xip (Bit 12)                                          */
#define PSM_FRCE_ON_xip_Msk               (0x1000UL)                /*!< xip (Bitfield-Mask: 0x01)                             */
#define PSM_FRCE_ON_sram5_Pos             (11UL)                    /*!< sram5 (Bit 11)                                        */
#define PSM_FRCE_ON_sram5_Msk             (0x800UL)                 /*!< sram5 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_ON_sram4_Pos             (10UL)                    /*!< sram4 (Bit 10)                                        */
#define PSM_FRCE_ON_sram4_Msk             (0x400UL)                 /*!< sram4 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_ON_sram3_Pos             (9UL)                     /*!< sram3 (Bit 9)                                         */
#define PSM_FRCE_ON_sram3_Msk             (0x200UL)                 /*!< sram3 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_ON_sram2_Pos             (8UL)                     /*!< sram2 (Bit 8)                                         */
#define PSM_FRCE_ON_sram2_Msk             (0x100UL)                 /*!< sram2 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_ON_sram1_Pos             (7UL)                     /*!< sram1 (Bit 7)                                         */
#define PSM_FRCE_ON_sram1_Msk             (0x80UL)                  /*!< sram1 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_ON_sram0_Pos             (6UL)                     /*!< sram0 (Bit 6)                                         */
#define PSM_FRCE_ON_sram0_Msk             (0x40UL)                  /*!< sram0 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_ON_rom_Pos               (5UL)                     /*!< rom (Bit 5)                                           */
#define PSM_FRCE_ON_rom_Msk               (0x20UL)                  /*!< rom (Bitfield-Mask: 0x01)                             */
#define PSM_FRCE_ON_busfabric_Pos         (4UL)                     /*!< busfabric (Bit 4)                                     */
#define PSM_FRCE_ON_busfabric_Msk         (0x10UL)                  /*!< busfabric (Bitfield-Mask: 0x01)                       */
#define PSM_FRCE_ON_resets_Pos            (3UL)                     /*!< resets (Bit 3)                                        */
#define PSM_FRCE_ON_resets_Msk            (0x8UL)                   /*!< resets (Bitfield-Mask: 0x01)                          */
#define PSM_FRCE_ON_clocks_Pos            (2UL)                     /*!< clocks (Bit 2)                                        */
#define PSM_FRCE_ON_clocks_Msk            (0x4UL)                   /*!< clocks (Bitfield-Mask: 0x01)                          */
#define PSM_FRCE_ON_xosc_Pos              (1UL)                     /*!< xosc (Bit 1)                                          */
#define PSM_FRCE_ON_xosc_Msk              (0x2UL)                   /*!< xosc (Bitfield-Mask: 0x01)                            */
#define PSM_FRCE_ON_rosc_Pos              (0UL)                     /*!< rosc (Bit 0)                                          */
#define PSM_FRCE_ON_rosc_Msk              (0x1UL)                   /*!< rosc (Bitfield-Mask: 0x01)                            */
/* =======================================================  FRCE_OFF  ======================================================== */
#define PSM_FRCE_OFF_proc1_Pos            (16UL)                    /*!< proc1 (Bit 16)                                        */
#define PSM_FRCE_OFF_proc1_Msk            (0x10000UL)               /*!< proc1 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_OFF_proc0_Pos            (15UL)                    /*!< proc0 (Bit 15)                                        */
#define PSM_FRCE_OFF_proc0_Msk            (0x8000UL)                /*!< proc0 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_OFF_sio_Pos              (14UL)                    /*!< sio (Bit 14)                                          */
#define PSM_FRCE_OFF_sio_Msk              (0x4000UL)                /*!< sio (Bitfield-Mask: 0x01)                             */
#define PSM_FRCE_OFF_vreg_and_chip_reset_Pos (13UL)                 /*!< vreg_and_chip_reset (Bit 13)                          */
#define PSM_FRCE_OFF_vreg_and_chip_reset_Msk (0x2000UL)             /*!< vreg_and_chip_reset (Bitfield-Mask: 0x01)             */
#define PSM_FRCE_OFF_xip_Pos              (12UL)                    /*!< xip (Bit 12)                                          */
#define PSM_FRCE_OFF_xip_Msk              (0x1000UL)                /*!< xip (Bitfield-Mask: 0x01)                             */
#define PSM_FRCE_OFF_sram5_Pos            (11UL)                    /*!< sram5 (Bit 11)                                        */
#define PSM_FRCE_OFF_sram5_Msk            (0x800UL)                 /*!< sram5 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_OFF_sram4_Pos            (10UL)                    /*!< sram4 (Bit 10)                                        */
#define PSM_FRCE_OFF_sram4_Msk            (0x400UL)                 /*!< sram4 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_OFF_sram3_Pos            (9UL)                     /*!< sram3 (Bit 9)                                         */
#define PSM_FRCE_OFF_sram3_Msk            (0x200UL)                 /*!< sram3 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_OFF_sram2_Pos            (8UL)                     /*!< sram2 (Bit 8)                                         */
#define PSM_FRCE_OFF_sram2_Msk            (0x100UL)                 /*!< sram2 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_OFF_sram1_Pos            (7UL)                     /*!< sram1 (Bit 7)                                         */
#define PSM_FRCE_OFF_sram1_Msk            (0x80UL)                  /*!< sram1 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_OFF_sram0_Pos            (6UL)                     /*!< sram0 (Bit 6)                                         */
#define PSM_FRCE_OFF_sram0_Msk            (0x40UL)                  /*!< sram0 (Bitfield-Mask: 0x01)                           */
#define PSM_FRCE_OFF_rom_Pos              (5UL)                     /*!< rom (Bit 5)                                           */
#define PSM_FRCE_OFF_rom_Msk              (0x20UL)                  /*!< rom (Bitfield-Mask: 0x01)                             */
#define PSM_FRCE_OFF_busfabric_Pos        (4UL)                     /*!< busfabric (Bit 4)                                     */
#define PSM_FRCE_OFF_busfabric_Msk        (0x10UL)                  /*!< busfabric (Bitfield-Mask: 0x01)                       */
#define PSM_FRCE_OFF_resets_Pos           (3UL)                     /*!< resets (Bit 3)                                        */
#define PSM_FRCE_OFF_resets_Msk           (0x8UL)                   /*!< resets (Bitfield-Mask: 0x01)                          */
#define PSM_FRCE_OFF_clocks_Pos           (2UL)                     /*!< clocks (Bit 2)                                        */
#define PSM_FRCE_OFF_clocks_Msk           (0x4UL)                   /*!< clocks (Bitfield-Mask: 0x01)                          */
#define PSM_FRCE_OFF_xosc_Pos             (1UL)                     /*!< xosc (Bit 1)                                          */
#define PSM_FRCE_OFF_xosc_Msk             (0x2UL)                   /*!< xosc (Bitfield-Mask: 0x01)                            */
#define PSM_FRCE_OFF_rosc_Pos             (0UL)                     /*!< rosc (Bit 0)                                          */
#define PSM_FRCE_OFF_rosc_Msk             (0x1UL)                   /*!< rosc (Bitfield-Mask: 0x01)                            */
/* =========================================================  WDSEL  ========================================================= */
#define PSM_WDSEL_proc1_Pos               (16UL)                    /*!< proc1 (Bit 16)                                        */
#define PSM_WDSEL_proc1_Msk               (0x10000UL)               /*!< proc1 (Bitfield-Mask: 0x01)                           */
#define PSM_WDSEL_proc0_Pos               (15UL)                    /*!< proc0 (Bit 15)                                        */
#define PSM_WDSEL_proc0_Msk               (0x8000UL)                /*!< proc0 (Bitfield-Mask: 0x01)                           */
#define PSM_WDSEL_sio_Pos                 (14UL)                    /*!< sio (Bit 14)                                          */
#define PSM_WDSEL_sio_Msk                 (0x4000UL)                /*!< sio (Bitfield-Mask: 0x01)                             */
#define PSM_WDSEL_vreg_and_chip_reset_Pos (13UL)                    /*!< vreg_and_chip_reset (Bit 13)                          */
#define PSM_WDSEL_vreg_and_chip_reset_Msk (0x2000UL)                /*!< vreg_and_chip_reset (Bitfield-Mask: 0x01)             */
#define PSM_WDSEL_xip_Pos                 (12UL)                    /*!< xip (Bit 12)                                          */
#define PSM_WDSEL_xip_Msk                 (0x1000UL)                /*!< xip (Bitfield-Mask: 0x01)                             */
#define PSM_WDSEL_sram5_Pos               (11UL)                    /*!< sram5 (Bit 11)                                        */
#define PSM_WDSEL_sram5_Msk               (0x800UL)                 /*!< sram5 (Bitfield-Mask: 0x01)                           */
#define PSM_WDSEL_sram4_Pos               (10UL)                    /*!< sram4 (Bit 10)                                        */
#define PSM_WDSEL_sram4_Msk               (0x400UL)                 /*!< sram4 (Bitfield-Mask: 0x01)                           */
#define PSM_WDSEL_sram3_Pos               (9UL)                     /*!< sram3 (Bit 9)                                         */
#define PSM_WDSEL_sram3_Msk               (0x200UL)                 /*!< sram3 (Bitfield-Mask: 0x01)                           */
#define PSM_WDSEL_sram2_Pos               (8UL)                     /*!< sram2 (Bit 8)                                         */
#define PSM_WDSEL_sram2_Msk               (0x100UL)                 /*!< sram2 (Bitfield-Mask: 0x01)                           */
#define PSM_WDSEL_sram1_Pos               (7UL)                     /*!< sram1 (Bit 7)                                         */
#define PSM_WDSEL_sram1_Msk               (0x80UL)                  /*!< sram1 (Bitfield-Mask: 0x01)                           */
#define PSM_WDSEL_sram0_Pos               (6UL)                     /*!< sram0 (Bit 6)                                         */
#define PSM_WDSEL_sram0_Msk               (0x40UL)                  /*!< sram0 (Bitfield-Mask: 0x01)                           */
#define PSM_WDSEL_rom_Pos                 (5UL)                     /*!< rom (Bit 5)                                           */
#define PSM_WDSEL_rom_Msk                 (0x20UL)                  /*!< rom (Bitfield-Mask: 0x01)                             */
#define PSM_WDSEL_busfabric_Pos           (4UL)                     /*!< busfabric (Bit 4)                                     */
#define PSM_WDSEL_busfabric_Msk           (0x10UL)                  /*!< busfabric (Bitfield-Mask: 0x01)                       */
#define PSM_WDSEL_resets_Pos              (3UL)                     /*!< resets (Bit 3)                                        */
#define PSM_WDSEL_resets_Msk              (0x8UL)                   /*!< resets (Bitfield-Mask: 0x01)                          */
#define PSM_WDSEL_clocks_Pos              (2UL)                     /*!< clocks (Bit 2)                                        */
#define PSM_WDSEL_clocks_Msk              (0x4UL)                   /*!< clocks (Bitfield-Mask: 0x01)                          */
#define PSM_WDSEL_xosc_Pos                (1UL)                     /*!< xosc (Bit 1)                                          */
#define PSM_WDSEL_xosc_Msk                (0x2UL)                   /*!< xosc (Bitfield-Mask: 0x01)                            */
#define PSM_WDSEL_rosc_Pos                (0UL)                     /*!< rosc (Bit 0)                                          */
#define PSM_WDSEL_rosc_Msk                (0x1UL)                   /*!< rosc (Bitfield-Mask: 0x01)                            */
/* =========================================================  DONE  ========================================================== */
#define PSM_DONE_proc1_Pos                (16UL)                    /*!< proc1 (Bit 16)                                        */
#define PSM_DONE_proc1_Msk                (0x10000UL)               /*!< proc1 (Bitfield-Mask: 0x01)                           */
#define PSM_DONE_proc0_Pos                (15UL)                    /*!< proc0 (Bit 15)                                        */
#define PSM_DONE_proc0_Msk                (0x8000UL)                /*!< proc0 (Bitfield-Mask: 0x01)                           */
#define PSM_DONE_sio_Pos                  (14UL)                    /*!< sio (Bit 14)                                          */
#define PSM_DONE_sio_Msk                  (0x4000UL)                /*!< sio (Bitfield-Mask: 0x01)                             */
#define PSM_DONE_vreg_and_chip_reset_Pos  (13UL)                    /*!< vreg_and_chip_reset (Bit 13)                          */
#define PSM_DONE_vreg_and_chip_reset_Msk  (0x2000UL)                /*!< vreg_and_chip_reset (Bitfield-Mask: 0x01)             */
#define PSM_DONE_xip_Pos                  (12UL)                    /*!< xip (Bit 12)                                          */
#define PSM_DONE_xip_Msk                  (0x1000UL)                /*!< xip (Bitfield-Mask: 0x01)                             */
#define PSM_DONE_sram5_Pos                (11UL)                    /*!< sram5 (Bit 11)                                        */
#define PSM_DONE_sram5_Msk                (0x800UL)                 /*!< sram5 (Bitfield-Mask: 0x01)                           */
#define PSM_DONE_sram4_Pos                (10UL)                    /*!< sram4 (Bit 10)                                        */
#define PSM_DONE_sram4_Msk                (0x400UL)                 /*!< sram4 (Bitfield-Mask: 0x01)                           */
#define PSM_DONE_sram3_Pos                (9UL)                     /*!< sram3 (Bit 9)                                         */
#define PSM_DONE_sram3_Msk                (0x200UL)                 /*!< sram3 (Bitfield-Mask: 0x01)                           */
#define PSM_DONE_sram2_Pos                (8UL)                     /*!< sram2 (Bit 8)                                         */
#define PSM_DONE_sram2_Msk                (0x100UL)                 /*!< sram2 (Bitfield-Mask: 0x01)                           */
#define PSM_DONE_sram1_Pos                (7UL)                     /*!< sram1 (Bit 7)                                         */
#define PSM_DONE_sram1_Msk                (0x80UL)                  /*!< sram1 (Bitfield-Mask: 0x01)                           */
#define PSM_DONE_sram0_Pos                (6UL)                     /*!< sram0 (Bit 6)                                         */
#define PSM_DONE_sram0_Msk                (0x40UL)                  /*!< sram0 (Bitfield-Mask: 0x01)                           */
#define PSM_DONE_rom_Pos                  (5UL)                     /*!< rom (Bit 5)                                           */
#define PSM_DONE_rom_Msk                  (0x20UL)                  /*!< rom (Bitfield-Mask: 0x01)                             */
#define PSM_DONE_busfabric_Pos            (4UL)                     /*!< busfabric (Bit 4)                                     */
#define PSM_DONE_busfabric_Msk            (0x10UL)                  /*!< busfabric (Bitfield-Mask: 0x01)                       */
#define PSM_DONE_resets_Pos               (3UL)                     /*!< resets (Bit 3)                                        */
#define PSM_DONE_resets_Msk               (0x8UL)                   /*!< resets (Bitfield-Mask: 0x01)                          */
#define PSM_DONE_clocks_Pos               (2UL)                     /*!< clocks (Bit 2)                                        */
#define PSM_DONE_clocks_Msk               (0x4UL)                   /*!< clocks (Bitfield-Mask: 0x01)                          */
#define PSM_DONE_xosc_Pos                 (1UL)                     /*!< xosc (Bit 1)                                          */
#define PSM_DONE_xosc_Msk                 (0x2UL)                   /*!< xosc (Bitfield-Mask: 0x01)                            */
#define PSM_DONE_rosc_Pos                 (0UL)                     /*!< rosc (Bit 0)                                          */
#define PSM_DONE_rosc_Msk                 (0x1UL)                   /*!< rosc (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                         IO_BANK0                                          ================ */
/* =========================================================================================================================== */

