mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =================================================  GPIO_QSPI_SCLK_STATUS  ================================================= */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_Pos (26UL)          /*!< IRQTOPROC (Bit 26)                                    */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC_Msk (0x4000000UL)   /*!< IRQTOPROC (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQFROMPAD_Pos (24UL)         /*!< IRQFROMPAD (Bit 24)                                   */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQFROMPAD_Msk (0x1000000UL)  /*!< IRQFROMPAD (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INTOPERI_Pos (19UL)           /*!< INTOPERI (Bit 19)                                     */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INTOPERI_Msk (0x80000UL)      /*!< INTOPERI (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_Pos (17UL)          /*!< INFROMPAD (Bit 17)                                    */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD_Msk (0x20000UL)     /*!< INFROMPAD (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_Pos (13UL)            /*!< OETOPAD (Bit 13)                                      */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD_Msk (0x2000UL)        /*!< OETOPAD (Bitfield-Mask: 0x01)                         */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OEFROMPERI_Pos (12UL)         /*!< OEFROMPERI (Bit 12)                                   */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OEFROMPERI_Msk (0x1000UL)     /*!< OEFROMPERI (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_Pos (9UL)            /*!< OUTTOPAD (Bit 9)                                      */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD_Msk (0x200UL)        /*!< OUTTOPAD (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTFROMPERI_Pos (8UL)         /*!< OUTFROMPERI (Bit 8)                                   */
#define IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTFROMPERI_Msk (0x100UL)     /*!< OUTFROMPERI (Bitfield-Mask: 0x01)                     */
/* ==================================================  GPIO_QSPI_SCLK_CTRL  ================================================== */
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_Pos (28UL)              /*!< IRQOVER (Bit 28)                                      */
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_Msk (0x30000000UL)      /*!< IRQOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_Pos (16UL)               /*!< INOVER (Bit 16)                                       */
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_INOVER_Msk (0x30000UL)          /*!< INOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_Pos (12UL)               /*!< OEOVER (Bit 12)                                       */
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OEOVER_Msk (0x3000UL)           /*!< OEOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_Pos (8UL)               /*!< OUTOVER (Bit 8)                                       */
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_OUTOVER_Msk (0x300UL)           /*!< OUTOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_Pos (0UL)               /*!< FUNCSEL (Bit 0)                                       */
#define IO_QSPI_GPIO_QSPI_SCLK_CTRL_FUNCSEL_Msk (0x1fUL)            /*!< FUNCSEL (Bitfield-Mask: 0x1f)                         */
/* ==================================================  GPIO_QSPI_SS_STATUS  ================================================== */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_Pos (26UL)            /*!< IRQTOPROC (Bit 26)                                    */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQTOPROC_Msk (0x4000000UL)     /*!< IRQTOPROC (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQFROMPAD_Pos (24UL)           /*!< IRQFROMPAD (Bit 24)                                   */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_IRQFROMPAD_Msk (0x1000000UL)    /*!< IRQFROMPAD (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INTOPERI_Pos (19UL)             /*!< INTOPERI (Bit 19)                                     */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INTOPERI_Msk (0x80000UL)        /*!< INTOPERI (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_Pos (17UL)            /*!< INFROMPAD (Bit 17)                                    */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_INFROMPAD_Msk (0x20000UL)       /*!< INFROMPAD (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_Pos (13UL)              /*!< OETOPAD (Bit 13)                                      */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OETOPAD_Msk (0x2000UL)          /*!< OETOPAD (Bitfield-Mask: 0x01)                         */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OEFROMPERI_Pos (12UL)           /*!< OEFROMPERI (Bit 12)                                   */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OEFROMPERI_Msk (0x1000UL)       /*!< OEFROMPERI (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD_Pos (9UL)              /*!< OUTTOPAD (Bit 9)                                      */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTTOPAD_Msk (0x200UL)          /*!< OUTTOPAD (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTFROMPERI_Pos (8UL)           /*!< OUTFROMPERI (Bit 8)                                   */
#define IO_QSPI_GPIO_QSPI_SS_STATUS_OUTFROMPERI_Msk (0x100UL)       /*!< OUTFROMPERI (Bitfield-Mask: 0x01)                     */
/* ===================================================  GPIO_QSPI_SS_CTRL  =================================================== */
#define IO_QSPI_GPIO_QSPI_SS_CTRL_IRQOVER_Pos (28UL)                /*!< IRQOVER (Bit 28)                                      */
#define IO_QSPI_GPIO_QSPI_SS_CTRL_IRQOVER_Msk (0x30000000UL)        /*!< IRQOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SS_CTRL_INOVER_Pos (16UL)                 /*!< INOVER (Bit 16)                                       */
#define IO_QSPI_GPIO_QSPI_SS_CTRL_INOVER_Msk (0x30000UL)            /*!< INOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OEOVER_Pos (12UL)                 /*!< OEOVER (Bit 12)                                       */
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OEOVER_Msk (0x3000UL)             /*!< OEOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_Pos (8UL)                 /*!< OUTOVER (Bit 8)                                       */
#define IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_Msk (0x300UL)             /*!< OUTOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_Pos (0UL)                 /*!< FUNCSEL (Bit 0)                                       */
#define IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_Msk (0x1fUL)              /*!< FUNCSEL (Bitfield-Mask: 0x1f)                         */
/* =================================================  GPIO_QSPI_SD0_STATUS  ================================================== */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC_Pos (26UL)           /*!< IRQTOPROC (Bit 26)                                    */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC_Msk (0x4000000UL)    /*!< IRQTOPROC (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQFROMPAD_Pos (24UL)          /*!< IRQFROMPAD (Bit 24)                                   */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQFROMPAD_Msk (0x1000000UL)   /*!< IRQFROMPAD (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_INTOPERI_Pos (19UL)            /*!< INTOPERI (Bit 19)                                     */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_INTOPERI_Msk (0x80000UL)       /*!< INTOPERI (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD_Pos (17UL)           /*!< INFROMPAD (Bit 17)                                    */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD_Msk (0x20000UL)      /*!< INFROMPAD (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD_Pos (13UL)             /*!< OETOPAD (Bit 13)                                      */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD_Msk (0x2000UL)         /*!< OETOPAD (Bitfield-Mask: 0x01)                         */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OEFROMPERI_Pos (12UL)          /*!< OEFROMPERI (Bit 12)                                   */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OEFROMPERI_Msk (0x1000UL)      /*!< OEFROMPERI (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD_Pos (9UL)             /*!< OUTTOPAD (Bit 9)                                      */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD_Msk (0x200UL)         /*!< OUTTOPAD (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTFROMPERI_Pos (8UL)          /*!< OUTFROMPERI (Bit 8)                                   */
#define IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTFROMPERI_Msk (0x100UL)      /*!< OUTFROMPERI (Bitfield-Mask: 0x01)                     */
/* ==================================================  GPIO_QSPI_SD0_CTRL  =================================================== */
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_Pos (28UL)               /*!< IRQOVER (Bit 28)                                      */
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_Msk (0x30000000UL)       /*!< IRQOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_Pos (16UL)                /*!< INOVER (Bit 16)                                       */
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_Msk (0x30000UL)           /*!< INOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_Pos (12UL)                /*!< OEOVER (Bit 12)                                       */
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_Msk (0x3000UL)            /*!< OEOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_Pos (8UL)                /*!< OUTOVER (Bit 8)                                       */
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_Msk (0x300UL)            /*!< OUTOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_Pos (0UL)                /*!< FUNCSEL (Bit 0)                                       */
#define IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_Msk (0x1fUL)             /*!< FUNCSEL (Bitfield-Mask: 0x1f)                         */
/* =================================================  GPIO_QSPI_SD1_STATUS  ================================================== */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC_Pos (26UL)           /*!< IRQTOPROC (Bit 26)                                    */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC_Msk (0x4000000UL)    /*!< IRQTOPROC (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQFROMPAD_Pos (24UL)          /*!< IRQFROMPAD (Bit 24)                                   */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQFROMPAD_Msk (0x1000000UL)   /*!< IRQFROMPAD (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_INTOPERI_Pos (19UL)            /*!< INTOPERI (Bit 19)                                     */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_INTOPERI_Msk (0x80000UL)       /*!< INTOPERI (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD_Pos (17UL)           /*!< INFROMPAD (Bit 17)                                    */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD_Msk (0x20000UL)      /*!< INFROMPAD (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD_Pos (13UL)             /*!< OETOPAD (Bit 13)                                      */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD_Msk (0x2000UL)         /*!< OETOPAD (Bitfield-Mask: 0x01)                         */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OEFROMPERI_Pos (12UL)          /*!< OEFROMPERI (Bit 12)                                   */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OEFROMPERI_Msk (0x1000UL)      /*!< OEFROMPERI (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD_Pos (9UL)             /*!< OUTTOPAD (Bit 9)                                      */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD_Msk (0x200UL)         /*!< OUTTOPAD (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTFROMPERI_Pos (8UL)          /*!< OUTFROMPERI (Bit 8)                                   */
#define IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTFROMPERI_Msk (0x100UL)      /*!< OUTFROMPERI (Bitfield-Mask: 0x01)                     */
/* ==================================================  GPIO_QSPI_SD1_CTRL  =================================================== */
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_Pos (28UL)               /*!< IRQOVER (Bit 28)                                      */
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_Msk (0x30000000UL)       /*!< IRQOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_Pos (16UL)                /*!< INOVER (Bit 16)                                       */
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_Msk (0x30000UL)           /*!< INOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_Pos (12UL)                /*!< OEOVER (Bit 12)                                       */
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_Msk (0x3000UL)            /*!< OEOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_Pos (8UL)                /*!< OUTOVER (Bit 8)                                       */
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_Msk (0x300UL)            /*!< OUTOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_Pos (0UL)                /*!< FUNCSEL (Bit 0)                                       */
#define IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_Msk (0x1fUL)             /*!< FUNCSEL (Bitfield-Mask: 0x1f)                         */
/* =================================================  GPIO_QSPI_SD2_STATUS  ================================================== */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC_Pos (26UL)           /*!< IRQTOPROC (Bit 26)                                    */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC_Msk (0x4000000UL)    /*!< IRQTOPROC (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQFROMPAD_Pos (24UL)          /*!< IRQFROMPAD (Bit 24)                                   */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQFROMPAD_Msk (0x1000000UL)   /*!< IRQFROMPAD (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_INTOPERI_Pos (19UL)            /*!< INTOPERI (Bit 19)                                     */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_INTOPERI_Msk (0x80000UL)       /*!< INTOPERI (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD_Pos (17UL)           /*!< INFROMPAD (Bit 17)                                    */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD_Msk (0x20000UL)      /*!< INFROMPAD (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD_Pos (13UL)             /*!< OETOPAD (Bit 13)                                      */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD_Msk (0x2000UL)         /*!< OETOPAD (Bitfield-Mask: 0x01)                         */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OEFROMPERI_Pos (12UL)          /*!< OEFROMPERI (Bit 12)                                   */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OEFROMPERI_Msk (0x1000UL)      /*!< OEFROMPERI (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD_Pos (9UL)             /*!< OUTTOPAD (Bit 9)                                      */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD_Msk (0x200UL)         /*!< OUTTOPAD (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTFROMPERI_Pos (8UL)          /*!< OUTFROMPERI (Bit 8)                                   */
#define IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTFROMPERI_Msk (0x100UL)      /*!< OUTFROMPERI (Bitfield-Mask: 0x01)                     */
/* ==================================================  GPIO_QSPI_SD2_CTRL  =================================================== */
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_Pos (28UL)               /*!< IRQOVER (Bit 28)                                      */
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_Msk (0x30000000UL)       /*!< IRQOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_Pos (16UL)                /*!< INOVER (Bit 16)                                       */
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_Msk (0x30000UL)           /*!< INOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_Pos (12UL)                /*!< OEOVER (Bit 12)                                       */
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_Msk (0x3000UL)            /*!< OEOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_Pos (8UL)                /*!< OUTOVER (Bit 8)                                       */
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_Msk (0x300UL)            /*!< OUTOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_Pos (0UL)                /*!< FUNCSEL (Bit 0)                                       */
#define IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_Msk (0x1fUL)             /*!< FUNCSEL (Bitfield-Mask: 0x1f)                         */
/* =================================================  GPIO_QSPI_SD3_STATUS  ================================================== */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC_Pos (26UL)           /*!< IRQTOPROC (Bit 26)                                    */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC_Msk (0x4000000UL)    /*!< IRQTOPROC (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQFROMPAD_Pos (24UL)          /*!< IRQFROMPAD (Bit 24)                                   */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQFROMPAD_Msk (0x1000000UL)   /*!< IRQFROMPAD (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_INTOPERI_Pos (19UL)            /*!< INTOPERI (Bit 19)                                     */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_INTOPERI_Msk (0x80000UL)       /*!< INTOPERI (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD_Pos (17UL)           /*!< INFROMPAD (Bit 17)                                    */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD_Msk (0x20000UL)      /*!< INFROMPAD (Bitfield-Mask: 0x01)                       */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD_Pos (13UL)             /*!< OETOPAD (Bit 13)                                      */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD_Msk (0x2000UL)         /*!< OETOPAD (Bitfield-Mask: 0x01)                         */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OEFROMPERI_Pos (12UL)          /*!< OEFROMPERI (Bit 12)                                   */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OEFROMPERI_Msk (0x1000UL)      /*!< OEFROMPERI (Bitfield-Mask: 0x01)                      */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD_Pos (9UL)             /*!< OUTTOPAD (Bit 9)                                      */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD_Msk (0x200UL)         /*!< OUTTOPAD (Bitfield-Mask: 0x01)                        */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTFROMPERI_Pos (8UL)          /*!< OUTFROMPERI (Bit 8)                                   */
#define IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTFROMPERI_Msk (0x100UL)      /*!< OUTFROMPERI (Bitfield-Mask: 0x01)                     */
/* ==================================================  GPIO_QSPI_SD3_CTRL  =================================================== */
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_Pos (28UL)               /*!< IRQOVER (Bit 28)                                      */
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_Msk (0x30000000UL)       /*!< IRQOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_Pos (16UL)                /*!< INOVER (Bit 16)                                       */
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_Msk (0x30000UL)           /*!< INOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_Pos (12UL)                /*!< OEOVER (Bit 12)                                       */
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_Msk (0x3000UL)            /*!< OEOVER (Bitfield-Mask: 0x03)                          */
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_Pos (8UL)                /*!< OUTOVER (Bit 8)                                       */
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_Msk (0x300UL)            /*!< OUTOVER (Bitfield-Mask: 0x03)                         */
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_Pos (0UL)                /*!< FUNCSEL (Bit 0)                                       */
#define IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_Msk (0x1fUL)             /*!< FUNCSEL (Bitfield-Mask: 0x1f)                         */
/* =========================================================  INTR  ========================================================== */
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_HIGH_Pos (23UL)             /*!< GPIO_QSPI_SD3_EDGE_HIGH (Bit 23)                      */
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_HIGH_Msk (0x800000UL)       /*!< GPIO_QSPI_SD3_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_LOW_Pos (22UL)              /*!< GPIO_QSPI_SD3_EDGE_LOW (Bit 22)                       */
#define IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_LOW_Msk (0x400000UL)        /*!< GPIO_QSPI_SD3_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_HIGH_Pos (21UL)            /*!< GPIO_QSPI_SD3_LEVEL_HIGH (Bit 21)                     */
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_HIGH_Msk (0x200000UL)      /*!< GPIO_QSPI_SD3_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_LOW_Pos (20UL)             /*!< GPIO_QSPI_SD3_LEVEL_LOW (Bit 20)                      */
#define IO_QSPI_INTR_GPIO_QSPI_SD3_LEVEL_LOW_Msk (0x100000UL)       /*!< GPIO_QSPI_SD3_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_HIGH_Pos (19UL)             /*!< GPIO_QSPI_SD2_EDGE_HIGH (Bit 19)                      */
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_HIGH_Msk (0x80000UL)        /*!< GPIO_QSPI_SD2_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_LOW_Pos (18UL)              /*!< GPIO_QSPI_SD2_EDGE_LOW (Bit 18)                       */
#define IO_QSPI_INTR_GPIO_QSPI_SD2_EDGE_LOW_Msk (0x40000UL)         /*!< GPIO_QSPI_SD2_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_HIGH_Pos (17UL)            /*!< GPIO_QSPI_SD2_LEVEL_HIGH (Bit 17)                     */
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_HIGH_Msk (0x20000UL)       /*!< GPIO_QSPI_SD2_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_LOW_Pos (16UL)             /*!< GPIO_QSPI_SD2_LEVEL_LOW (Bit 16)                      */
