mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define IO_QSPI_INTR_GPIO_QSPI_SD2_LEVEL_LOW_Msk (0x10000UL)        /*!< GPIO_QSPI_SD2_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_HIGH_Pos (15UL)             /*!< GPIO_QSPI_SD1_EDGE_HIGH (Bit 15)                      */
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_HIGH_Msk (0x8000UL)         /*!< GPIO_QSPI_SD1_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_LOW_Pos (14UL)              /*!< GPIO_QSPI_SD1_EDGE_LOW (Bit 14)                       */
#define IO_QSPI_INTR_GPIO_QSPI_SD1_EDGE_LOW_Msk (0x4000UL)          /*!< GPIO_QSPI_SD1_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_HIGH_Pos (13UL)            /*!< GPIO_QSPI_SD1_LEVEL_HIGH (Bit 13)                     */
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_HIGH_Msk (0x2000UL)        /*!< GPIO_QSPI_SD1_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_LOW_Pos (12UL)             /*!< GPIO_QSPI_SD1_LEVEL_LOW (Bit 12)                      */
#define IO_QSPI_INTR_GPIO_QSPI_SD1_LEVEL_LOW_Msk (0x1000UL)         /*!< GPIO_QSPI_SD1_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_HIGH_Pos (11UL)             /*!< GPIO_QSPI_SD0_EDGE_HIGH (Bit 11)                      */
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_HIGH_Msk (0x800UL)          /*!< GPIO_QSPI_SD0_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_LOW_Pos (10UL)              /*!< GPIO_QSPI_SD0_EDGE_LOW (Bit 10)                       */
#define IO_QSPI_INTR_GPIO_QSPI_SD0_EDGE_LOW_Msk (0x400UL)           /*!< GPIO_QSPI_SD0_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_HIGH_Pos (9UL)             /*!< GPIO_QSPI_SD0_LEVEL_HIGH (Bit 9)                      */
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_HIGH_Msk (0x200UL)         /*!< GPIO_QSPI_SD0_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_LOW_Pos (8UL)              /*!< GPIO_QSPI_SD0_LEVEL_LOW (Bit 8)                       */
#define IO_QSPI_INTR_GPIO_QSPI_SD0_LEVEL_LOW_Msk (0x100UL)          /*!< GPIO_QSPI_SD0_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_HIGH_Pos (7UL)               /*!< GPIO_QSPI_SS_EDGE_HIGH (Bit 7)                        */
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_HIGH_Msk (0x80UL)            /*!< GPIO_QSPI_SS_EDGE_HIGH (Bitfield-Mask: 0x01)          */
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_LOW_Pos (6UL)                /*!< GPIO_QSPI_SS_EDGE_LOW (Bit 6)                         */
#define IO_QSPI_INTR_GPIO_QSPI_SS_EDGE_LOW_Msk (0x40UL)             /*!< GPIO_QSPI_SS_EDGE_LOW (Bitfield-Mask: 0x01)           */
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_HIGH_Pos (5UL)              /*!< GPIO_QSPI_SS_LEVEL_HIGH (Bit 5)                       */
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_HIGH_Msk (0x20UL)           /*!< GPIO_QSPI_SS_LEVEL_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_LOW_Pos (4UL)               /*!< GPIO_QSPI_SS_LEVEL_LOW (Bit 4)                        */
#define IO_QSPI_INTR_GPIO_QSPI_SS_LEVEL_LOW_Msk (0x10UL)            /*!< GPIO_QSPI_SS_LEVEL_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_HIGH_Pos (3UL)             /*!< GPIO_QSPI_SCLK_EDGE_HIGH (Bit 3)                      */
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_HIGH_Msk (0x8UL)           /*!< GPIO_QSPI_SCLK_EDGE_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_LOW_Pos (2UL)              /*!< GPIO_QSPI_SCLK_EDGE_LOW (Bit 2)                       */
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_EDGE_LOW_Msk (0x4UL)            /*!< GPIO_QSPI_SCLK_EDGE_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_HIGH_Pos (1UL)            /*!< GPIO_QSPI_SCLK_LEVEL_HIGH (Bit 1)                     */
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_HIGH_Msk (0x2UL)          /*!< GPIO_QSPI_SCLK_LEVEL_HIGH (Bitfield-Mask: 0x01)       */
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_LOW_Pos (0UL)             /*!< GPIO_QSPI_SCLK_LEVEL_LOW (Bit 0)                      */
#define IO_QSPI_INTR_GPIO_QSPI_SCLK_LEVEL_LOW_Msk (0x1UL)           /*!< GPIO_QSPI_SCLK_LEVEL_LOW (Bitfield-Mask: 0x01)        */
/* ======================================================  PROC0_INTE  ======================================================= */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_HIGH_Pos (23UL)       /*!< GPIO_QSPI_SD3_EDGE_HIGH (Bit 23)                      */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_HIGH_Msk (0x800000UL) /*!< GPIO_QSPI_SD3_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_LOW_Pos (22UL)        /*!< GPIO_QSPI_SD3_EDGE_LOW (Bit 22)                       */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_EDGE_LOW_Msk (0x400000UL)  /*!< GPIO_QSPI_SD3_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_HIGH_Pos (21UL)      /*!< GPIO_QSPI_SD3_LEVEL_HIGH (Bit 21)                     */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_HIGH_Msk (0x200000UL) /*!< GPIO_QSPI_SD3_LEVEL_HIGH (Bitfield-Mask: 0x01)       */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_LOW_Pos (20UL)       /*!< GPIO_QSPI_SD3_LEVEL_LOW (Bit 20)                      */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD3_LEVEL_LOW_Msk (0x100000UL) /*!< GPIO_QSPI_SD3_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_HIGH_Pos (19UL)       /*!< GPIO_QSPI_SD2_EDGE_HIGH (Bit 19)                      */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_HIGH_Msk (0x80000UL)  /*!< GPIO_QSPI_SD2_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_LOW_Pos (18UL)        /*!< GPIO_QSPI_SD2_EDGE_LOW (Bit 18)                       */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_EDGE_LOW_Msk (0x40000UL)   /*!< GPIO_QSPI_SD2_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_HIGH_Pos (17UL)      /*!< GPIO_QSPI_SD2_LEVEL_HIGH (Bit 17)                     */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_HIGH_Msk (0x20000UL) /*!< GPIO_QSPI_SD2_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_LOW_Pos (16UL)       /*!< GPIO_QSPI_SD2_LEVEL_LOW (Bit 16)                      */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD2_LEVEL_LOW_Msk (0x10000UL)  /*!< GPIO_QSPI_SD2_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_HIGH_Pos (15UL)       /*!< GPIO_QSPI_SD1_EDGE_HIGH (Bit 15)                      */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_HIGH_Msk (0x8000UL)   /*!< GPIO_QSPI_SD1_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_LOW_Pos (14UL)        /*!< GPIO_QSPI_SD1_EDGE_LOW (Bit 14)                       */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_EDGE_LOW_Msk (0x4000UL)    /*!< GPIO_QSPI_SD1_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_HIGH_Pos (13UL)      /*!< GPIO_QSPI_SD1_LEVEL_HIGH (Bit 13)                     */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_HIGH_Msk (0x2000UL)  /*!< GPIO_QSPI_SD1_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_LOW_Pos (12UL)       /*!< GPIO_QSPI_SD1_LEVEL_LOW (Bit 12)                      */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD1_LEVEL_LOW_Msk (0x1000UL)   /*!< GPIO_QSPI_SD1_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_HIGH_Pos (11UL)       /*!< GPIO_QSPI_SD0_EDGE_HIGH (Bit 11)                      */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_HIGH_Msk (0x800UL)    /*!< GPIO_QSPI_SD0_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_LOW_Pos (10UL)        /*!< GPIO_QSPI_SD0_EDGE_LOW (Bit 10)                       */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_EDGE_LOW_Msk (0x400UL)     /*!< GPIO_QSPI_SD0_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_HIGH_Pos (9UL)       /*!< GPIO_QSPI_SD0_LEVEL_HIGH (Bit 9)                      */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_HIGH_Msk (0x200UL)   /*!< GPIO_QSPI_SD0_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_LOW_Pos (8UL)        /*!< GPIO_QSPI_SD0_LEVEL_LOW (Bit 8)                       */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SD0_LEVEL_LOW_Msk (0x100UL)    /*!< GPIO_QSPI_SD0_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_HIGH_Pos (7UL)         /*!< GPIO_QSPI_SS_EDGE_HIGH (Bit 7)                        */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_HIGH_Msk (0x80UL)      /*!< GPIO_QSPI_SS_EDGE_HIGH (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_LOW_Pos (6UL)          /*!< GPIO_QSPI_SS_EDGE_LOW (Bit 6)                         */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_EDGE_LOW_Msk (0x40UL)       /*!< GPIO_QSPI_SS_EDGE_LOW (Bitfield-Mask: 0x01)           */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_HIGH_Pos (5UL)        /*!< GPIO_QSPI_SS_LEVEL_HIGH (Bit 5)                       */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_HIGH_Msk (0x20UL)     /*!< GPIO_QSPI_SS_LEVEL_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_LOW_Pos (4UL)         /*!< GPIO_QSPI_SS_LEVEL_LOW (Bit 4)                        */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SS_LEVEL_LOW_Msk (0x10UL)      /*!< GPIO_QSPI_SS_LEVEL_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_HIGH_Pos (3UL)       /*!< GPIO_QSPI_SCLK_EDGE_HIGH (Bit 3)                      */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_HIGH_Msk (0x8UL)     /*!< GPIO_QSPI_SCLK_EDGE_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_LOW_Pos (2UL)        /*!< GPIO_QSPI_SCLK_EDGE_LOW (Bit 2)                       */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_EDGE_LOW_Msk (0x4UL)      /*!< GPIO_QSPI_SCLK_EDGE_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_LEVEL_HIGH_Pos (1UL)      /*!< GPIO_QSPI_SCLK_LEVEL_HIGH (Bit 1)                     */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_LEVEL_HIGH_Msk (0x2UL)    /*!< GPIO_QSPI_SCLK_LEVEL_HIGH (Bitfield-Mask: 0x01)       */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_LEVEL_LOW_Pos (0UL)       /*!< GPIO_QSPI_SCLK_LEVEL_LOW (Bit 0)                      */
#define IO_QSPI_PROC0_INTE_GPIO_QSPI_SCLK_LEVEL_LOW_Msk (0x1UL)     /*!< GPIO_QSPI_SCLK_LEVEL_LOW (Bitfield-Mask: 0x01)        */
/* ======================================================  PROC0_INTF  ======================================================= */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_EDGE_HIGH_Pos (23UL)       /*!< GPIO_QSPI_SD3_EDGE_HIGH (Bit 23)                      */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_EDGE_HIGH_Msk (0x800000UL) /*!< GPIO_QSPI_SD3_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_EDGE_LOW_Pos (22UL)        /*!< GPIO_QSPI_SD3_EDGE_LOW (Bit 22)                       */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_EDGE_LOW_Msk (0x400000UL)  /*!< GPIO_QSPI_SD3_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_HIGH_Pos (21UL)      /*!< GPIO_QSPI_SD3_LEVEL_HIGH (Bit 21)                     */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_HIGH_Msk (0x200000UL) /*!< GPIO_QSPI_SD3_LEVEL_HIGH (Bitfield-Mask: 0x01)       */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_LOW_Pos (20UL)       /*!< GPIO_QSPI_SD3_LEVEL_LOW (Bit 20)                      */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_LOW_Msk (0x100000UL) /*!< GPIO_QSPI_SD3_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_HIGH_Pos (19UL)       /*!< GPIO_QSPI_SD2_EDGE_HIGH (Bit 19)                      */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_HIGH_Msk (0x80000UL)  /*!< GPIO_QSPI_SD2_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_LOW_Pos (18UL)        /*!< GPIO_QSPI_SD2_EDGE_LOW (Bit 18)                       */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_LOW_Msk (0x40000UL)   /*!< GPIO_QSPI_SD2_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_HIGH_Pos (17UL)      /*!< GPIO_QSPI_SD2_LEVEL_HIGH (Bit 17)                     */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_HIGH_Msk (0x20000UL) /*!< GPIO_QSPI_SD2_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_LOW_Pos (16UL)       /*!< GPIO_QSPI_SD2_LEVEL_LOW (Bit 16)                      */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_LOW_Msk (0x10000UL)  /*!< GPIO_QSPI_SD2_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_HIGH_Pos (15UL)       /*!< GPIO_QSPI_SD1_EDGE_HIGH (Bit 15)                      */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_HIGH_Msk (0x8000UL)   /*!< GPIO_QSPI_SD1_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_LOW_Pos (14UL)        /*!< GPIO_QSPI_SD1_EDGE_LOW (Bit 14)                       */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_LOW_Msk (0x4000UL)    /*!< GPIO_QSPI_SD1_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_HIGH_Pos (13UL)      /*!< GPIO_QSPI_SD1_LEVEL_HIGH (Bit 13)                     */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_HIGH_Msk (0x2000UL)  /*!< GPIO_QSPI_SD1_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_LOW_Pos (12UL)       /*!< GPIO_QSPI_SD1_LEVEL_LOW (Bit 12)                      */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_LOW_Msk (0x1000UL)   /*!< GPIO_QSPI_SD1_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_HIGH_Pos (11UL)       /*!< GPIO_QSPI_SD0_EDGE_HIGH (Bit 11)                      */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_HIGH_Msk (0x800UL)    /*!< GPIO_QSPI_SD0_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_LOW_Pos (10UL)        /*!< GPIO_QSPI_SD0_EDGE_LOW (Bit 10)                       */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_LOW_Msk (0x400UL)     /*!< GPIO_QSPI_SD0_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_HIGH_Pos (9UL)       /*!< GPIO_QSPI_SD0_LEVEL_HIGH (Bit 9)                      */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_HIGH_Msk (0x200UL)   /*!< GPIO_QSPI_SD0_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_LOW_Pos (8UL)        /*!< GPIO_QSPI_SD0_LEVEL_LOW (Bit 8)                       */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_LOW_Msk (0x100UL)    /*!< GPIO_QSPI_SD0_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_HIGH_Pos (7UL)         /*!< GPIO_QSPI_SS_EDGE_HIGH (Bit 7)                        */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_HIGH_Msk (0x80UL)      /*!< GPIO_QSPI_SS_EDGE_HIGH (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_LOW_Pos (6UL)          /*!< GPIO_QSPI_SS_EDGE_LOW (Bit 6)                         */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_LOW_Msk (0x40UL)       /*!< GPIO_QSPI_SS_EDGE_LOW (Bitfield-Mask: 0x01)           */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_HIGH_Pos (5UL)        /*!< GPIO_QSPI_SS_LEVEL_HIGH (Bit 5)                       */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_HIGH_Msk (0x20UL)     /*!< GPIO_QSPI_SS_LEVEL_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_LOW_Pos (4UL)         /*!< GPIO_QSPI_SS_LEVEL_LOW (Bit 4)                        */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_LOW_Msk (0x10UL)      /*!< GPIO_QSPI_SS_LEVEL_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_HIGH_Pos (3UL)       /*!< GPIO_QSPI_SCLK_EDGE_HIGH (Bit 3)                      */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_HIGH_Msk (0x8UL)     /*!< GPIO_QSPI_SCLK_EDGE_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_LOW_Pos (2UL)        /*!< GPIO_QSPI_SCLK_EDGE_LOW (Bit 2)                       */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_LOW_Msk (0x4UL)      /*!< GPIO_QSPI_SCLK_EDGE_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_HIGH_Pos (1UL)      /*!< GPIO_QSPI_SCLK_LEVEL_HIGH (Bit 1)                     */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_HIGH_Msk (0x2UL)    /*!< GPIO_QSPI_SCLK_LEVEL_HIGH (Bitfield-Mask: 0x01)       */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_LOW_Pos (0UL)       /*!< GPIO_QSPI_SCLK_LEVEL_LOW (Bit 0)                      */
#define IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_LOW_Msk (0x1UL)     /*!< GPIO_QSPI_SCLK_LEVEL_LOW (Bitfield-Mask: 0x01)        */
/* ======================================================  PROC0_INTS  ======================================================= */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_HIGH_Pos (23UL)       /*!< GPIO_QSPI_SD3_EDGE_HIGH (Bit 23)                      */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_HIGH_Msk (0x800000UL) /*!< GPIO_QSPI_SD3_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_LOW_Pos (22UL)        /*!< GPIO_QSPI_SD3_EDGE_LOW (Bit 22)                       */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_LOW_Msk (0x400000UL)  /*!< GPIO_QSPI_SD3_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_HIGH_Pos (21UL)      /*!< GPIO_QSPI_SD3_LEVEL_HIGH (Bit 21)                     */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_HIGH_Msk (0x200000UL) /*!< GPIO_QSPI_SD3_LEVEL_HIGH (Bitfield-Mask: 0x01)       */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_LOW_Pos (20UL)       /*!< GPIO_QSPI_SD3_LEVEL_LOW (Bit 20)                      */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_LOW_Msk (0x100000UL) /*!< GPIO_QSPI_SD3_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_HIGH_Pos (19UL)       /*!< GPIO_QSPI_SD2_EDGE_HIGH (Bit 19)                      */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_HIGH_Msk (0x80000UL)  /*!< GPIO_QSPI_SD2_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_LOW_Pos (18UL)        /*!< GPIO_QSPI_SD2_EDGE_LOW (Bit 18)                       */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_LOW_Msk (0x40000UL)   /*!< GPIO_QSPI_SD2_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_HIGH_Pos (17UL)      /*!< GPIO_QSPI_SD2_LEVEL_HIGH (Bit 17)                     */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_HIGH_Msk (0x20000UL) /*!< GPIO_QSPI_SD2_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_LOW_Pos (16UL)       /*!< GPIO_QSPI_SD2_LEVEL_LOW (Bit 16)                      */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_LOW_Msk (0x10000UL)  /*!< GPIO_QSPI_SD2_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_HIGH_Pos (15UL)       /*!< GPIO_QSPI_SD1_EDGE_HIGH (Bit 15)                      */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_HIGH_Msk (0x8000UL)   /*!< GPIO_QSPI_SD1_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_LOW_Pos (14UL)        /*!< GPIO_QSPI_SD1_EDGE_LOW (Bit 14)                       */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_LOW_Msk (0x4000UL)    /*!< GPIO_QSPI_SD1_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_HIGH_Pos (13UL)      /*!< GPIO_QSPI_SD1_LEVEL_HIGH (Bit 13)                     */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_HIGH_Msk (0x2000UL)  /*!< GPIO_QSPI_SD1_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_LOW_Pos (12UL)       /*!< GPIO_QSPI_SD1_LEVEL_LOW (Bit 12)                      */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_LOW_Msk (0x1000UL)   /*!< GPIO_QSPI_SD1_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_HIGH_Pos (11UL)       /*!< GPIO_QSPI_SD0_EDGE_HIGH (Bit 11)                      */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_HIGH_Msk (0x800UL)    /*!< GPIO_QSPI_SD0_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_LOW_Pos (10UL)        /*!< GPIO_QSPI_SD0_EDGE_LOW (Bit 10)                       */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_LOW_Msk (0x400UL)     /*!< GPIO_QSPI_SD0_EDGE_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_HIGH_Pos (9UL)       /*!< GPIO_QSPI_SD0_LEVEL_HIGH (Bit 9)                      */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_HIGH_Msk (0x200UL)   /*!< GPIO_QSPI_SD0_LEVEL_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_LOW_Pos (8UL)        /*!< GPIO_QSPI_SD0_LEVEL_LOW (Bit 8)                       */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_LOW_Msk (0x100UL)    /*!< GPIO_QSPI_SD0_LEVEL_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_HIGH_Pos (7UL)         /*!< GPIO_QSPI_SS_EDGE_HIGH (Bit 7)                        */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_HIGH_Msk (0x80UL)      /*!< GPIO_QSPI_SS_EDGE_HIGH (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_LOW_Pos (6UL)          /*!< GPIO_QSPI_SS_EDGE_LOW (Bit 6)                         */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_LOW_Msk (0x40UL)       /*!< GPIO_QSPI_SS_EDGE_LOW (Bitfield-Mask: 0x01)           */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_HIGH_Pos (5UL)        /*!< GPIO_QSPI_SS_LEVEL_HIGH (Bit 5)                       */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_HIGH_Msk (0x20UL)     /*!< GPIO_QSPI_SS_LEVEL_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_LOW_Pos (4UL)         /*!< GPIO_QSPI_SS_LEVEL_LOW (Bit 4)                        */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_LOW_Msk (0x10UL)      /*!< GPIO_QSPI_SS_LEVEL_LOW (Bitfield-Mask: 0x01)          */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_HIGH_Pos (3UL)       /*!< GPIO_QSPI_SCLK_EDGE_HIGH (Bit 3)                      */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_HIGH_Msk (0x8UL)     /*!< GPIO_QSPI_SCLK_EDGE_HIGH (Bitfield-Mask: 0x01)        */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_LOW_Pos (2UL)        /*!< GPIO_QSPI_SCLK_EDGE_LOW (Bit 2)                       */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_LOW_Msk (0x4UL)      /*!< GPIO_QSPI_SCLK_EDGE_LOW (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_HIGH_Pos (1UL)      /*!< GPIO_QSPI_SCLK_LEVEL_HIGH (Bit 1)                     */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_HIGH_Msk (0x2UL)    /*!< GPIO_QSPI_SCLK_LEVEL_HIGH (Bitfield-Mask: 0x01)       */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_LOW_Pos (0UL)       /*!< GPIO_QSPI_SCLK_LEVEL_LOW (Bit 0)                      */
#define IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_LOW_Msk (0x1UL)     /*!< GPIO_QSPI_SCLK_LEVEL_LOW (Bitfield-Mask: 0x01)        */
/* ======================================================  PROC1_INTE  ======================================================= */
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_HIGH_Pos (23UL)       /*!< GPIO_QSPI_SD3_EDGE_HIGH (Bit 23)                      */
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_HIGH_Msk (0x800000UL) /*!< GPIO_QSPI_SD3_EDGE_HIGH (Bitfield-Mask: 0x01)         */
#define IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_LOW_Pos (22UL)        /*!< GPIO_QSPI_SD3_EDGE_LOW (Bit 22)                       */
