mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ====================================================  VOLTAGE_SELECT  ===================================================== */
#define PADS_QSPI_VOLTAGE_SELECT_VOLTAGE_SELECT_Pos (0UL)           /*!< VOLTAGE_SELECT (Bit 0)                                */
#define PADS_QSPI_VOLTAGE_SELECT_VOLTAGE_SELECT_Msk (0x1UL)         /*!< VOLTAGE_SELECT (Bitfield-Mask: 0x01)                  */
/* ====================================================  GPIO_QSPI_SCLK  ===================================================== */
#define PADS_QSPI_GPIO_QSPI_SCLK_OD_Pos   (7UL)                     /*!< OD (Bit 7)                                            */
#define PADS_QSPI_GPIO_QSPI_SCLK_OD_Msk   (0x80UL)                  /*!< OD (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SCLK_IE_Pos   (6UL)                     /*!< IE (Bit 6)                                            */
#define PADS_QSPI_GPIO_QSPI_SCLK_IE_Msk   (0x40UL)                  /*!< IE (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_Pos (4UL)                    /*!< DRIVE (Bit 4)                                         */
#define PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_Msk (0x30UL)                 /*!< DRIVE (Bitfield-Mask: 0x03)                           */
#define PADS_QSPI_GPIO_QSPI_SCLK_PUE_Pos  (3UL)                     /*!< PUE (Bit 3)                                           */
#define PADS_QSPI_GPIO_QSPI_SCLK_PUE_Msk  (0x8UL)                   /*!< PUE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SCLK_PDE_Pos  (2UL)                     /*!< PDE (Bit 2)                                           */
#define PADS_QSPI_GPIO_QSPI_SCLK_PDE_Msk  (0x4UL)                   /*!< PDE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SCLK_SCHMITT_Pos (1UL)                  /*!< SCHMITT (Bit 1)                                       */
#define PADS_QSPI_GPIO_QSPI_SCLK_SCHMITT_Msk (0x2UL)                /*!< SCHMITT (Bitfield-Mask: 0x01)                         */
#define PADS_QSPI_GPIO_QSPI_SCLK_SLEWFAST_Pos (0UL)                 /*!< SLEWFAST (Bit 0)                                      */
#define PADS_QSPI_GPIO_QSPI_SCLK_SLEWFAST_Msk (0x1UL)               /*!< SLEWFAST (Bitfield-Mask: 0x01)                        */
/* =====================================================  GPIO_QSPI_SD0  ===================================================== */
#define PADS_QSPI_GPIO_QSPI_SD0_OD_Pos    (7UL)                     /*!< OD (Bit 7)                                            */
#define PADS_QSPI_GPIO_QSPI_SD0_OD_Msk    (0x80UL)                  /*!< OD (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SD0_IE_Pos    (6UL)                     /*!< IE (Bit 6)                                            */
#define PADS_QSPI_GPIO_QSPI_SD0_IE_Msk    (0x40UL)                  /*!< IE (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SD0_DRIVE_Pos (4UL)                     /*!< DRIVE (Bit 4)                                         */
#define PADS_QSPI_GPIO_QSPI_SD0_DRIVE_Msk (0x30UL)                  /*!< DRIVE (Bitfield-Mask: 0x03)                           */
#define PADS_QSPI_GPIO_QSPI_SD0_PUE_Pos   (3UL)                     /*!< PUE (Bit 3)                                           */
#define PADS_QSPI_GPIO_QSPI_SD0_PUE_Msk   (0x8UL)                   /*!< PUE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SD0_PDE_Pos   (2UL)                     /*!< PDE (Bit 2)                                           */
#define PADS_QSPI_GPIO_QSPI_SD0_PDE_Msk   (0x4UL)                   /*!< PDE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SD0_SCHMITT_Pos (1UL)                   /*!< SCHMITT (Bit 1)                                       */
#define PADS_QSPI_GPIO_QSPI_SD0_SCHMITT_Msk (0x2UL)                 /*!< SCHMITT (Bitfield-Mask: 0x01)                         */
#define PADS_QSPI_GPIO_QSPI_SD0_SLEWFAST_Pos (0UL)                  /*!< SLEWFAST (Bit 0)                                      */
#define PADS_QSPI_GPIO_QSPI_SD0_SLEWFAST_Msk (0x1UL)                /*!< SLEWFAST (Bitfield-Mask: 0x01)                        */
/* =====================================================  GPIO_QSPI_SD1  ===================================================== */
#define PADS_QSPI_GPIO_QSPI_SD1_OD_Pos    (7UL)                     /*!< OD (Bit 7)                                            */
#define PADS_QSPI_GPIO_QSPI_SD1_OD_Msk    (0x80UL)                  /*!< OD (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SD1_IE_Pos    (6UL)                     /*!< IE (Bit 6)                                            */
#define PADS_QSPI_GPIO_QSPI_SD1_IE_Msk    (0x40UL)                  /*!< IE (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SD1_DRIVE_Pos (4UL)                     /*!< DRIVE (Bit 4)                                         */
#define PADS_QSPI_GPIO_QSPI_SD1_DRIVE_Msk (0x30UL)                  /*!< DRIVE (Bitfield-Mask: 0x03)                           */
#define PADS_QSPI_GPIO_QSPI_SD1_PUE_Pos   (3UL)                     /*!< PUE (Bit 3)                                           */
#define PADS_QSPI_GPIO_QSPI_SD1_PUE_Msk   (0x8UL)                   /*!< PUE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SD1_PDE_Pos   (2UL)                     /*!< PDE (Bit 2)                                           */
#define PADS_QSPI_GPIO_QSPI_SD1_PDE_Msk   (0x4UL)                   /*!< PDE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SD1_SCHMITT_Pos (1UL)                   /*!< SCHMITT (Bit 1)                                       */
#define PADS_QSPI_GPIO_QSPI_SD1_SCHMITT_Msk (0x2UL)                 /*!< SCHMITT (Bitfield-Mask: 0x01)                         */
#define PADS_QSPI_GPIO_QSPI_SD1_SLEWFAST_Pos (0UL)                  /*!< SLEWFAST (Bit 0)                                      */
#define PADS_QSPI_GPIO_QSPI_SD1_SLEWFAST_Msk (0x1UL)                /*!< SLEWFAST (Bitfield-Mask: 0x01)                        */
/* =====================================================  GPIO_QSPI_SD2  ===================================================== */
#define PADS_QSPI_GPIO_QSPI_SD2_OD_Pos    (7UL)                     /*!< OD (Bit 7)                                            */
#define PADS_QSPI_GPIO_QSPI_SD2_OD_Msk    (0x80UL)                  /*!< OD (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SD2_IE_Pos    (6UL)                     /*!< IE (Bit 6)                                            */
#define PADS_QSPI_GPIO_QSPI_SD2_IE_Msk    (0x40UL)                  /*!< IE (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SD2_DRIVE_Pos (4UL)                     /*!< DRIVE (Bit 4)                                         */
#define PADS_QSPI_GPIO_QSPI_SD2_DRIVE_Msk (0x30UL)                  /*!< DRIVE (Bitfield-Mask: 0x03)                           */
#define PADS_QSPI_GPIO_QSPI_SD2_PUE_Pos   (3UL)                     /*!< PUE (Bit 3)                                           */
#define PADS_QSPI_GPIO_QSPI_SD2_PUE_Msk   (0x8UL)                   /*!< PUE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SD2_PDE_Pos   (2UL)                     /*!< PDE (Bit 2)                                           */
#define PADS_QSPI_GPIO_QSPI_SD2_PDE_Msk   (0x4UL)                   /*!< PDE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SD2_SCHMITT_Pos (1UL)                   /*!< SCHMITT (Bit 1)                                       */
#define PADS_QSPI_GPIO_QSPI_SD2_SCHMITT_Msk (0x2UL)                 /*!< SCHMITT (Bitfield-Mask: 0x01)                         */
#define PADS_QSPI_GPIO_QSPI_SD2_SLEWFAST_Pos (0UL)                  /*!< SLEWFAST (Bit 0)                                      */
#define PADS_QSPI_GPIO_QSPI_SD2_SLEWFAST_Msk (0x1UL)                /*!< SLEWFAST (Bitfield-Mask: 0x01)                        */
/* =====================================================  GPIO_QSPI_SD3  ===================================================== */
#define PADS_QSPI_GPIO_QSPI_SD3_OD_Pos    (7UL)                     /*!< OD (Bit 7)                                            */
#define PADS_QSPI_GPIO_QSPI_SD3_OD_Msk    (0x80UL)                  /*!< OD (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SD3_IE_Pos    (6UL)                     /*!< IE (Bit 6)                                            */
#define PADS_QSPI_GPIO_QSPI_SD3_IE_Msk    (0x40UL)                  /*!< IE (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SD3_DRIVE_Pos (4UL)                     /*!< DRIVE (Bit 4)                                         */
#define PADS_QSPI_GPIO_QSPI_SD3_DRIVE_Msk (0x30UL)                  /*!< DRIVE (Bitfield-Mask: 0x03)                           */
#define PADS_QSPI_GPIO_QSPI_SD3_PUE_Pos   (3UL)                     /*!< PUE (Bit 3)                                           */
#define PADS_QSPI_GPIO_QSPI_SD3_PUE_Msk   (0x8UL)                   /*!< PUE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SD3_PDE_Pos   (2UL)                     /*!< PDE (Bit 2)                                           */
#define PADS_QSPI_GPIO_QSPI_SD3_PDE_Msk   (0x4UL)                   /*!< PDE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SD3_SCHMITT_Pos (1UL)                   /*!< SCHMITT (Bit 1)                                       */
#define PADS_QSPI_GPIO_QSPI_SD3_SCHMITT_Msk (0x2UL)                 /*!< SCHMITT (Bitfield-Mask: 0x01)                         */
#define PADS_QSPI_GPIO_QSPI_SD3_SLEWFAST_Pos (0UL)                  /*!< SLEWFAST (Bit 0)                                      */
#define PADS_QSPI_GPIO_QSPI_SD3_SLEWFAST_Msk (0x1UL)                /*!< SLEWFAST (Bitfield-Mask: 0x01)                        */
/* =====================================================  GPIO_QSPI_SS  ====================================================== */
#define PADS_QSPI_GPIO_QSPI_SS_OD_Pos     (7UL)                     /*!< OD (Bit 7)                                            */
#define PADS_QSPI_GPIO_QSPI_SS_OD_Msk     (0x80UL)                  /*!< OD (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SS_IE_Pos     (6UL)                     /*!< IE (Bit 6)                                            */
#define PADS_QSPI_GPIO_QSPI_SS_IE_Msk     (0x40UL)                  /*!< IE (Bitfield-Mask: 0x01)                              */
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_Pos  (4UL)                     /*!< DRIVE (Bit 4)                                         */
#define PADS_QSPI_GPIO_QSPI_SS_DRIVE_Msk  (0x30UL)                  /*!< DRIVE (Bitfield-Mask: 0x03)                           */
#define PADS_QSPI_GPIO_QSPI_SS_PUE_Pos    (3UL)                     /*!< PUE (Bit 3)                                           */
#define PADS_QSPI_GPIO_QSPI_SS_PUE_Msk    (0x8UL)                   /*!< PUE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SS_PDE_Pos    (2UL)                     /*!< PDE (Bit 2)                                           */
#define PADS_QSPI_GPIO_QSPI_SS_PDE_Msk    (0x4UL)                   /*!< PDE (Bitfield-Mask: 0x01)                             */
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_Pos (1UL)                    /*!< SCHMITT (Bit 1)                                       */
#define PADS_QSPI_GPIO_QSPI_SS_SCHMITT_Msk (0x2UL)                  /*!< SCHMITT (Bitfield-Mask: 0x01)                         */
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_Pos (0UL)                   /*!< SLEWFAST (Bit 0)                                      */
#define PADS_QSPI_GPIO_QSPI_SS_SLEWFAST_Msk (0x1UL)                 /*!< SLEWFAST (Bitfield-Mask: 0x01)                        */


/* =========================================================================================================================== */
/* ================                                           XOSC                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define XOSC_CTRL_ENABLE_Pos              (12UL)                    /*!< ENABLE (Bit 12)                                       */
#define XOSC_CTRL_ENABLE_Msk              (0xfff000UL)              /*!< ENABLE (Bitfield-Mask: 0xfff)                         */
#define XOSC_CTRL_FREQ_RANGE_Pos          (0UL)                     /*!< FREQ_RANGE (Bit 0)                                    */
#define XOSC_CTRL_FREQ_RANGE_Msk          (0xfffUL)                 /*!< FREQ_RANGE (Bitfield-Mask: 0xfff)                     */
/* ========================================================  STATUS  ========================================================= */
#define XOSC_STATUS_STABLE_Pos            (31UL)                    /*!< STABLE (Bit 31)                                       */
#define XOSC_STATUS_STABLE_Msk            (0x80000000UL)            /*!< STABLE (Bitfield-Mask: 0x01)                          */
#define XOSC_STATUS_BADWRITE_Pos          (24UL)                    /*!< BADWRITE (Bit 24)                                     */
#define XOSC_STATUS_BADWRITE_Msk          (0x1000000UL)             /*!< BADWRITE (Bitfield-Mask: 0x01)                        */
#define XOSC_STATUS_ENABLED_Pos           (12UL)                    /*!< ENABLED (Bit 12)                                      */
#define XOSC_STATUS_ENABLED_Msk           (0x1000UL)                /*!< ENABLED (Bitfield-Mask: 0x01)                         */
#define XOSC_STATUS_FREQ_RANGE_Pos        (0UL)                     /*!< FREQ_RANGE (Bit 0)                                    */
#define XOSC_STATUS_FREQ_RANGE_Msk        (0x3UL)                   /*!< FREQ_RANGE (Bitfield-Mask: 0x03)                      */
/* ========================================================  DORMANT  ======================================================== */
/* ========================================================  STARTUP  ======================================================== */
#define XOSC_STARTUP_X4_Pos               (20UL)                    /*!< X4 (Bit 20)                                           */
#define XOSC_STARTUP_X4_Msk               (0x100000UL)              /*!< X4 (Bitfield-Mask: 0x01)                              */
#define XOSC_STARTUP_DELAY_Pos            (0UL)                     /*!< DELAY (Bit 0)                                         */
#define XOSC_STARTUP_DELAY_Msk            (0x3fffUL)                /*!< DELAY (Bitfield-Mask: 0x3fff)                         */
/* =========================================================  COUNT  ========================================================= */
#define XOSC_COUNT_COUNT_Pos              (0UL)                     /*!< COUNT (Bit 0)                                         */
#define XOSC_COUNT_COUNT_Msk              (0xffUL)                  /*!< COUNT (Bitfield-Mask: 0xff)                           */


/* =========================================================================================================================== */
/* ================                                          PLL_SYS                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CS  =========================================================== */
#define PLL_SYS_CS_LOCK_Pos               (31UL)                    /*!< LOCK (Bit 31)                                         */
#define PLL_SYS_CS_LOCK_Msk               (0x80000000UL)            /*!< LOCK (Bitfield-Mask: 0x01)                            */
#define PLL_SYS_CS_BYPASS_Pos             (8UL)                     /*!< BYPASS (Bit 8)                                        */
#define PLL_SYS_CS_BYPASS_Msk             (0x100UL)                 /*!< BYPASS (Bitfield-Mask: 0x01)                          */
#define PLL_SYS_CS_REFDIV_Pos             (0UL)                     /*!< REFDIV (Bit 0)                                        */
#define PLL_SYS_CS_REFDIV_Msk             (0x3fUL)                  /*!< REFDIV (Bitfield-Mask: 0x3f)                          */
/* ==========================================================  PWR  ========================================================== */
#define PLL_SYS_PWR_VCOPD_Pos             (5UL)                     /*!< VCOPD (Bit 5)                                         */
#define PLL_SYS_PWR_VCOPD_Msk             (0x20UL)                  /*!< VCOPD (Bitfield-Mask: 0x01)                           */
#define PLL_SYS_PWR_POSTDIVPD_Pos         (3UL)                     /*!< POSTDIVPD (Bit 3)                                     */
#define PLL_SYS_PWR_POSTDIVPD_Msk         (0x8UL)                   /*!< POSTDIVPD (Bitfield-Mask: 0x01)                       */
#define PLL_SYS_PWR_DSMPD_Pos             (2UL)                     /*!< DSMPD (Bit 2)                                         */
#define PLL_SYS_PWR_DSMPD_Msk             (0x4UL)                   /*!< DSMPD (Bitfield-Mask: 0x01)                           */
#define PLL_SYS_PWR_PD_Pos                (0UL)                     /*!< PD (Bit 0)                                            */
#define PLL_SYS_PWR_PD_Msk                (0x1UL)                   /*!< PD (Bitfield-Mask: 0x01)                              */
/* =======================================================  FBDIV_INT  ======================================================= */
#define PLL_SYS_FBDIV_INT_FBDIV_INT_Pos   (0UL)                     /*!< FBDIV_INT (Bit 0)                                     */
#define PLL_SYS_FBDIV_INT_FBDIV_INT_Msk   (0xfffUL)                 /*!< FBDIV_INT (Bitfield-Mask: 0xfff)                      */
/* =========================================================  PRIM  ========================================================== */
#define PLL_SYS_PRIM_POSTDIV1_Pos         (16UL)                    /*!< POSTDIV1 (Bit 16)                                     */
#define PLL_SYS_PRIM_POSTDIV1_Msk         (0x70000UL)               /*!< POSTDIV1 (Bitfield-Mask: 0x07)                        */
#define PLL_SYS_PRIM_POSTDIV2_Pos         (12UL)                    /*!< POSTDIV2 (Bit 12)                                     */
#define PLL_SYS_PRIM_POSTDIV2_Msk         (0x7000UL)                /*!< POSTDIV2 (Bitfield-Mask: 0x07)                        */


/* =========================================================================================================================== */
/* ================                                          BUSCTRL                                          ================ */
/* =========================================================================================================================== */

