mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =====================================================  BUS_PRIORITY  ====================================================== */
#define BUSCTRL_BUS_PRIORITY_DMA_W_Pos    (12UL)                    /*!< DMA_W (Bit 12)                                        */
#define BUSCTRL_BUS_PRIORITY_DMA_W_Msk    (0x1000UL)                /*!< DMA_W (Bitfield-Mask: 0x01)                           */
#define BUSCTRL_BUS_PRIORITY_DMA_R_Pos    (8UL)                     /*!< DMA_R (Bit 8)                                         */
#define BUSCTRL_BUS_PRIORITY_DMA_R_Msk    (0x100UL)                 /*!< DMA_R (Bitfield-Mask: 0x01)                           */
#define BUSCTRL_BUS_PRIORITY_PROC1_Pos    (4UL)                     /*!< PROC1 (Bit 4)                                         */
#define BUSCTRL_BUS_PRIORITY_PROC1_Msk    (0x10UL)                  /*!< PROC1 (Bitfield-Mask: 0x01)                           */
#define BUSCTRL_BUS_PRIORITY_PROC0_Pos    (0UL)                     /*!< PROC0 (Bit 0)                                         */
#define BUSCTRL_BUS_PRIORITY_PROC0_Msk    (0x1UL)                   /*!< PROC0 (Bitfield-Mask: 0x01)                           */
/* ===================================================  BUS_PRIORITY_ACK  ==================================================== */
#define BUSCTRL_BUS_PRIORITY_ACK_BUS_PRIORITY_ACK_Pos (0UL)         /*!< BUS_PRIORITY_ACK (Bit 0)                              */
#define BUSCTRL_BUS_PRIORITY_ACK_BUS_PRIORITY_ACK_Msk (0x1UL)       /*!< BUS_PRIORITY_ACK (Bitfield-Mask: 0x01)                */
/* =======================================================  PERFCTR0  ======================================================== */
#define BUSCTRL_PERFCTR0_PERFCTR0_Pos     (0UL)                     /*!< PERFCTR0 (Bit 0)                                      */
#define BUSCTRL_PERFCTR0_PERFCTR0_Msk     (0xffffffUL)              /*!< PERFCTR0 (Bitfield-Mask: 0xffffff)                    */
/* =======================================================  PERFSEL0  ======================================================== */
#define BUSCTRL_PERFSEL0_PERFSEL0_Pos     (0UL)                     /*!< PERFSEL0 (Bit 0)                                      */
#define BUSCTRL_PERFSEL0_PERFSEL0_Msk     (0x1fUL)                  /*!< PERFSEL0 (Bitfield-Mask: 0x1f)                        */
/* =======================================================  PERFCTR1  ======================================================== */
#define BUSCTRL_PERFCTR1_PERFCTR1_Pos     (0UL)                     /*!< PERFCTR1 (Bit 0)                                      */
#define BUSCTRL_PERFCTR1_PERFCTR1_Msk     (0xffffffUL)              /*!< PERFCTR1 (Bitfield-Mask: 0xffffff)                    */
/* =======================================================  PERFSEL1  ======================================================== */
#define BUSCTRL_PERFSEL1_PERFSEL1_Pos     (0UL)                     /*!< PERFSEL1 (Bit 0)                                      */
#define BUSCTRL_PERFSEL1_PERFSEL1_Msk     (0x1fUL)                  /*!< PERFSEL1 (Bitfield-Mask: 0x1f)                        */
/* =======================================================  PERFCTR2  ======================================================== */
#define BUSCTRL_PERFCTR2_PERFCTR2_Pos     (0UL)                     /*!< PERFCTR2 (Bit 0)                                      */
#define BUSCTRL_PERFCTR2_PERFCTR2_Msk     (0xffffffUL)              /*!< PERFCTR2 (Bitfield-Mask: 0xffffff)                    */
/* =======================================================  PERFSEL2  ======================================================== */
#define BUSCTRL_PERFSEL2_PERFSEL2_Pos     (0UL)                     /*!< PERFSEL2 (Bit 0)                                      */
#define BUSCTRL_PERFSEL2_PERFSEL2_Msk     (0x1fUL)                  /*!< PERFSEL2 (Bitfield-Mask: 0x1f)                        */
/* =======================================================  PERFCTR3  ======================================================== */
#define BUSCTRL_PERFCTR3_PERFCTR3_Pos     (0UL)                     /*!< PERFCTR3 (Bit 0)                                      */
#define BUSCTRL_PERFCTR3_PERFCTR3_Msk     (0xffffffUL)              /*!< PERFCTR3 (Bitfield-Mask: 0xffffff)                    */
/* =======================================================  PERFSEL3  ======================================================== */
#define BUSCTRL_PERFSEL3_PERFSEL3_Pos     (0UL)                     /*!< PERFSEL3 (Bit 0)                                      */
#define BUSCTRL_PERFSEL3_PERFSEL3_Msk     (0x1fUL)                  /*!< PERFSEL3 (Bitfield-Mask: 0x1f)                        */


/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  UARTDR  ========================================================= */
#define UART0_UARTDR_OE_Pos               (11UL)                    /*!< OE (Bit 11)                                           */
#define UART0_UARTDR_OE_Msk               (0x800UL)                 /*!< OE (Bitfield-Mask: 0x01)                              */
#define UART0_UARTDR_BE_Pos               (10UL)                    /*!< BE (Bit 10)                                           */
#define UART0_UARTDR_BE_Msk               (0x400UL)                 /*!< BE (Bitfield-Mask: 0x01)                              */
#define UART0_UARTDR_PE_Pos               (9UL)                     /*!< PE (Bit 9)                                            */
#define UART0_UARTDR_PE_Msk               (0x200UL)                 /*!< PE (Bitfield-Mask: 0x01)                              */
#define UART0_UARTDR_FE_Pos               (8UL)                     /*!< FE (Bit 8)                                            */
#define UART0_UARTDR_FE_Msk               (0x100UL)                 /*!< FE (Bitfield-Mask: 0x01)                              */
#define UART0_UARTDR_DATA_Pos             (0UL)                     /*!< DATA (Bit 0)                                          */
#define UART0_UARTDR_DATA_Msk             (0xffUL)                  /*!< DATA (Bitfield-Mask: 0xff)                            */
/* ========================================================  UARTRSR  ======================================================== */
#define UART0_UARTRSR_OE_Pos              (3UL)                     /*!< OE (Bit 3)                                            */
#define UART0_UARTRSR_OE_Msk              (0x8UL)                   /*!< OE (Bitfield-Mask: 0x01)                              */
#define UART0_UARTRSR_BE_Pos              (2UL)                     /*!< BE (Bit 2)                                            */
#define UART0_UARTRSR_BE_Msk              (0x4UL)                   /*!< BE (Bitfield-Mask: 0x01)                              */
#define UART0_UARTRSR_PE_Pos              (1UL)                     /*!< PE (Bit 1)                                            */
#define UART0_UARTRSR_PE_Msk              (0x2UL)                   /*!< PE (Bitfield-Mask: 0x01)                              */
#define UART0_UARTRSR_FE_Pos              (0UL)                     /*!< FE (Bit 0)                                            */
#define UART0_UARTRSR_FE_Msk              (0x1UL)                   /*!< FE (Bitfield-Mask: 0x01)                              */
/* ========================================================  UARTFR  ========================================================= */
#define UART0_UARTFR_RI_Pos               (8UL)                     /*!< RI (Bit 8)                                            */
#define UART0_UARTFR_RI_Msk               (0x100UL)                 /*!< RI (Bitfield-Mask: 0x01)                              */
#define UART0_UARTFR_TXFE_Pos             (7UL)                     /*!< TXFE (Bit 7)                                          */
#define UART0_UARTFR_TXFE_Msk             (0x80UL)                  /*!< TXFE (Bitfield-Mask: 0x01)                            */
#define UART0_UARTFR_RXFF_Pos             (6UL)                     /*!< RXFF (Bit 6)                                          */
#define UART0_UARTFR_RXFF_Msk             (0x40UL)                  /*!< RXFF (Bitfield-Mask: 0x01)                            */
#define UART0_UARTFR_TXFF_Pos             (5UL)                     /*!< TXFF (Bit 5)                                          */
#define UART0_UARTFR_TXFF_Msk             (0x20UL)                  /*!< TXFF (Bitfield-Mask: 0x01)                            */
#define UART0_UARTFR_RXFE_Pos             (4UL)                     /*!< RXFE (Bit 4)                                          */
#define UART0_UARTFR_RXFE_Msk             (0x10UL)                  /*!< RXFE (Bitfield-Mask: 0x01)                            */
#define UART0_UARTFR_BUSY_Pos             (3UL)                     /*!< BUSY (Bit 3)                                          */
#define UART0_UARTFR_BUSY_Msk             (0x8UL)                   /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define UART0_UARTFR_DCD_Pos              (2UL)                     /*!< DCD (Bit 2)                                           */
#define UART0_UARTFR_DCD_Msk              (0x4UL)                   /*!< DCD (Bitfield-Mask: 0x01)                             */
#define UART0_UARTFR_DSR_Pos              (1UL)                     /*!< DSR (Bit 1)                                           */
#define UART0_UARTFR_DSR_Msk              (0x2UL)                   /*!< DSR (Bitfield-Mask: 0x01)                             */
#define UART0_UARTFR_CTS_Pos              (0UL)                     /*!< CTS (Bit 0)                                           */
#define UART0_UARTFR_CTS_Msk              (0x1UL)                   /*!< CTS (Bitfield-Mask: 0x01)                             */
/* =======================================================  UARTILPR  ======================================================== */
#define UART0_UARTILPR_ILPDVSR_Pos        (0UL)                     /*!< ILPDVSR (Bit 0)                                       */
#define UART0_UARTILPR_ILPDVSR_Msk        (0xffUL)                  /*!< ILPDVSR (Bitfield-Mask: 0xff)                         */
/* =======================================================  UARTIBRD  ======================================================== */
#define UART0_UARTIBRD_BAUD_DIVINT_Pos    (0UL)                     /*!< BAUD_DIVINT (Bit 0)                                   */
#define UART0_UARTIBRD_BAUD_DIVINT_Msk    (0xffffUL)                /*!< BAUD_DIVINT (Bitfield-Mask: 0xffff)                   */
/* =======================================================  UARTFBRD  ======================================================== */
#define UART0_UARTFBRD_BAUD_DIVFRAC_Pos   (0UL)                     /*!< BAUD_DIVFRAC (Bit 0)                                  */
#define UART0_UARTFBRD_BAUD_DIVFRAC_Msk   (0x3fUL)                  /*!< BAUD_DIVFRAC (Bitfield-Mask: 0x3f)                    */
/* =======================================================  UARTLCR_H  ======================================================= */
#define UART0_UARTLCR_H_SPS_Pos           (7UL)                     /*!< SPS (Bit 7)                                           */
#define UART0_UARTLCR_H_SPS_Msk           (0x80UL)                  /*!< SPS (Bitfield-Mask: 0x01)                             */
#define UART0_UARTLCR_H_WLEN_Pos          (5UL)                     /*!< WLEN (Bit 5)                                          */
#define UART0_UARTLCR_H_WLEN_Msk          (0x60UL)                  /*!< WLEN (Bitfield-Mask: 0x03)                            */
#define UART0_UARTLCR_H_FEN_Pos           (4UL)                     /*!< FEN (Bit 4)                                           */
#define UART0_UARTLCR_H_FEN_Msk           (0x10UL)                  /*!< FEN (Bitfield-Mask: 0x01)                             */
#define UART0_UARTLCR_H_STP2_Pos          (3UL)                     /*!< STP2 (Bit 3)                                          */
#define UART0_UARTLCR_H_STP2_Msk          (0x8UL)                   /*!< STP2 (Bitfield-Mask: 0x01)                            */
#define UART0_UARTLCR_H_EPS_Pos           (2UL)                     /*!< EPS (Bit 2)                                           */
#define UART0_UARTLCR_H_EPS_Msk           (0x4UL)                   /*!< EPS (Bitfield-Mask: 0x01)                             */
#define UART0_UARTLCR_H_PEN_Pos           (1UL)                     /*!< PEN (Bit 1)                                           */
#define UART0_UARTLCR_H_PEN_Msk           (0x2UL)                   /*!< PEN (Bitfield-Mask: 0x01)                             */
#define UART0_UARTLCR_H_BRK_Pos           (0UL)                     /*!< BRK (Bit 0)                                           */
#define UART0_UARTLCR_H_BRK_Msk           (0x1UL)                   /*!< BRK (Bitfield-Mask: 0x01)                             */
/* ========================================================  UARTCR  ========================================================= */
#define UART0_UARTCR_CTSEN_Pos            (15UL)                    /*!< CTSEN (Bit 15)                                        */
#define UART0_UARTCR_CTSEN_Msk            (0x8000UL)                /*!< CTSEN (Bitfield-Mask: 0x01)                           */
#define UART0_UARTCR_RTSEN_Pos            (14UL)                    /*!< RTSEN (Bit 14)                                        */
#define UART0_UARTCR_RTSEN_Msk            (0x4000UL)                /*!< RTSEN (Bitfield-Mask: 0x01)                           */
#define UART0_UARTCR_OUT2_Pos             (13UL)                    /*!< OUT2 (Bit 13)                                         */
#define UART0_UARTCR_OUT2_Msk             (0x2000UL)                /*!< OUT2 (Bitfield-Mask: 0x01)                            */
#define UART0_UARTCR_OUT1_Pos             (12UL)                    /*!< OUT1 (Bit 12)                                         */
#define UART0_UARTCR_OUT1_Msk             (0x1000UL)                /*!< OUT1 (Bitfield-Mask: 0x01)                            */
#define UART0_UARTCR_RTS_Pos              (11UL)                    /*!< RTS (Bit 11)                                          */
#define UART0_UARTCR_RTS_Msk              (0x800UL)                 /*!< RTS (Bitfield-Mask: 0x01)                             */
#define UART0_UARTCR_DTR_Pos              (10UL)                    /*!< DTR (Bit 10)                                          */
#define UART0_UARTCR_DTR_Msk              (0x400UL)                 /*!< DTR (Bitfield-Mask: 0x01)                             */
#define UART0_UARTCR_RXE_Pos              (9UL)                     /*!< RXE (Bit 9)                                           */
#define UART0_UARTCR_RXE_Msk              (0x200UL)                 /*!< RXE (Bitfield-Mask: 0x01)                             */
#define UART0_UARTCR_TXE_Pos              (8UL)                     /*!< TXE (Bit 8)                                           */
#define UART0_UARTCR_TXE_Msk              (0x100UL)                 /*!< TXE (Bitfield-Mask: 0x01)                             */
#define UART0_UARTCR_LBE_Pos              (7UL)                     /*!< LBE (Bit 7)                                           */
#define UART0_UARTCR_LBE_Msk              (0x80UL)                  /*!< LBE (Bitfield-Mask: 0x01)                             */
#define UART0_UARTCR_SIRLP_Pos            (2UL)                     /*!< SIRLP (Bit 2)                                         */
#define UART0_UARTCR_SIRLP_Msk            (0x4UL)                   /*!< SIRLP (Bitfield-Mask: 0x01)                           */
#define UART0_UARTCR_SIREN_Pos            (1UL)                     /*!< SIREN (Bit 1)                                         */
#define UART0_UARTCR_SIREN_Msk            (0x2UL)                   /*!< SIREN (Bitfield-Mask: 0x01)                           */
#define UART0_UARTCR_UARTEN_Pos           (0UL)                     /*!< UARTEN (Bit 0)                                        */
#define UART0_UARTCR_UARTEN_Msk           (0x1UL)                   /*!< UARTEN (Bitfield-Mask: 0x01)                          */
/* =======================================================  UARTIFLS  ======================================================== */
#define UART0_UARTIFLS_RXIFLSEL_Pos       (3UL)                     /*!< RXIFLSEL (Bit 3)                                      */
#define UART0_UARTIFLS_RXIFLSEL_Msk       (0x38UL)                  /*!< RXIFLSEL (Bitfield-Mask: 0x07)                        */
#define UART0_UARTIFLS_TXIFLSEL_Pos       (0UL)                     /*!< TXIFLSEL (Bit 0)                                      */
#define UART0_UARTIFLS_TXIFLSEL_Msk       (0x7UL)                   /*!< TXIFLSEL (Bitfield-Mask: 0x07)                        */
/* =======================================================  UARTIMSC  ======================================================== */
#define UART0_UARTIMSC_OEIM_Pos           (10UL)                    /*!< OEIM (Bit 10)                                         */
#define UART0_UARTIMSC_OEIM_Msk           (0x400UL)                 /*!< OEIM (Bitfield-Mask: 0x01)                            */
#define UART0_UARTIMSC_BEIM_Pos           (9UL)                     /*!< BEIM (Bit 9)                                          */
#define UART0_UARTIMSC_BEIM_Msk           (0x200UL)                 /*!< BEIM (Bitfield-Mask: 0x01)                            */
#define UART0_UARTIMSC_PEIM_Pos           (8UL)                     /*!< PEIM (Bit 8)                                          */
#define UART0_UARTIMSC_PEIM_Msk           (0x100UL)                 /*!< PEIM (Bitfield-Mask: 0x01)                            */
#define UART0_UARTIMSC_FEIM_Pos           (7UL)                     /*!< FEIM (Bit 7)                                          */
#define UART0_UARTIMSC_FEIM_Msk           (0x80UL)                  /*!< FEIM (Bitfield-Mask: 0x01)                            */
#define UART0_UARTIMSC_RTIM_Pos           (6UL)                     /*!< RTIM (Bit 6)                                          */
#define UART0_UARTIMSC_RTIM_Msk           (0x40UL)                  /*!< RTIM (Bitfield-Mask: 0x01)                            */
#define UART0_UARTIMSC_TXIM_Pos           (5UL)                     /*!< TXIM (Bit 5)                                          */
#define UART0_UARTIMSC_TXIM_Msk           (0x20UL)                  /*!< TXIM (Bitfield-Mask: 0x01)                            */
#define UART0_UARTIMSC_RXIM_Pos           (4UL)                     /*!< RXIM (Bit 4)                                          */
#define UART0_UARTIMSC_RXIM_Msk           (0x10UL)                  /*!< RXIM (Bitfield-Mask: 0x01)                            */
#define UART0_UARTIMSC_DSRMIM_Pos         (3UL)                     /*!< DSRMIM (Bit 3)                                        */
#define UART0_UARTIMSC_DSRMIM_Msk         (0x8UL)                   /*!< DSRMIM (Bitfield-Mask: 0x01)                          */
#define UART0_UARTIMSC_DCDMIM_Pos         (2UL)                     /*!< DCDMIM (Bit 2)                                        */
#define UART0_UARTIMSC_DCDMIM_Msk         (0x4UL)                   /*!< DCDMIM (Bitfield-Mask: 0x01)                          */
#define UART0_UARTIMSC_CTSMIM_Pos         (1UL)                     /*!< CTSMIM (Bit 1)                                        */
#define UART0_UARTIMSC_CTSMIM_Msk         (0x2UL)                   /*!< CTSMIM (Bitfield-Mask: 0x01)                          */
#define UART0_UARTIMSC_RIMIM_Pos          (0UL)                     /*!< RIMIM (Bit 0)                                         */
#define UART0_UARTIMSC_RIMIM_Msk          (0x1UL)                   /*!< RIMIM (Bitfield-Mask: 0x01)                           */
/* ========================================================  UARTRIS  ======================================================== */
#define UART0_UARTRIS_OERIS_Pos           (10UL)                    /*!< OERIS (Bit 10)                                        */
#define UART0_UARTRIS_OERIS_Msk           (0x400UL)                 /*!< OERIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTRIS_BERIS_Pos           (9UL)                     /*!< BERIS (Bit 9)                                         */
#define UART0_UARTRIS_BERIS_Msk           (0x200UL)                 /*!< BERIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTRIS_PERIS_Pos           (8UL)                     /*!< PERIS (Bit 8)                                         */
#define UART0_UARTRIS_PERIS_Msk           (0x100UL)                 /*!< PERIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTRIS_FERIS_Pos           (7UL)                     /*!< FERIS (Bit 7)                                         */
#define UART0_UARTRIS_FERIS_Msk           (0x80UL)                  /*!< FERIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTRIS_RTRIS_Pos           (6UL)                     /*!< RTRIS (Bit 6)                                         */
#define UART0_UARTRIS_RTRIS_Msk           (0x40UL)                  /*!< RTRIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTRIS_TXRIS_Pos           (5UL)                     /*!< TXRIS (Bit 5)                                         */
#define UART0_UARTRIS_TXRIS_Msk           (0x20UL)                  /*!< TXRIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTRIS_RXRIS_Pos           (4UL)                     /*!< RXRIS (Bit 4)                                         */
#define UART0_UARTRIS_RXRIS_Msk           (0x10UL)                  /*!< RXRIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTRIS_DSRRMIS_Pos         (3UL)                     /*!< DSRRMIS (Bit 3)                                       */
#define UART0_UARTRIS_DSRRMIS_Msk         (0x8UL)                   /*!< DSRRMIS (Bitfield-Mask: 0x01)                         */
#define UART0_UARTRIS_DCDRMIS_Pos         (2UL)                     /*!< DCDRMIS (Bit 2)                                       */
#define UART0_UARTRIS_DCDRMIS_Msk         (0x4UL)                   /*!< DCDRMIS (Bitfield-Mask: 0x01)                         */
#define UART0_UARTRIS_CTSRMIS_Pos         (1UL)                     /*!< CTSRMIS (Bit 1)                                       */
#define UART0_UARTRIS_CTSRMIS_Msk         (0x2UL)                   /*!< CTSRMIS (Bitfield-Mask: 0x01)                         */
#define UART0_UARTRIS_RIRMIS_Pos          (0UL)                     /*!< RIRMIS (Bit 0)                                        */
#define UART0_UARTRIS_RIRMIS_Msk          (0x1UL)                   /*!< RIRMIS (Bitfield-Mask: 0x01)                          */
/* ========================================================  UARTMIS  ======================================================== */
#define UART0_UARTMIS_OEMIS_Pos           (10UL)                    /*!< OEMIS (Bit 10)                                        */
#define UART0_UARTMIS_OEMIS_Msk           (0x400UL)                 /*!< OEMIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTMIS_BEMIS_Pos           (9UL)                     /*!< BEMIS (Bit 9)                                         */
#define UART0_UARTMIS_BEMIS_Msk           (0x200UL)                 /*!< BEMIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTMIS_PEMIS_Pos           (8UL)                     /*!< PEMIS (Bit 8)                                         */
