mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define UART0_UARTMIS_PEMIS_Msk           (0x100UL)                 /*!< PEMIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTMIS_FEMIS_Pos           (7UL)                     /*!< FEMIS (Bit 7)                                         */
#define UART0_UARTMIS_FEMIS_Msk           (0x80UL)                  /*!< FEMIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTMIS_RTMIS_Pos           (6UL)                     /*!< RTMIS (Bit 6)                                         */
#define UART0_UARTMIS_RTMIS_Msk           (0x40UL)                  /*!< RTMIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTMIS_TXMIS_Pos           (5UL)                     /*!< TXMIS (Bit 5)                                         */
#define UART0_UARTMIS_TXMIS_Msk           (0x20UL)                  /*!< TXMIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTMIS_RXMIS_Pos           (4UL)                     /*!< RXMIS (Bit 4)                                         */
#define UART0_UARTMIS_RXMIS_Msk           (0x10UL)                  /*!< RXMIS (Bitfield-Mask: 0x01)                           */
#define UART0_UARTMIS_DSRMMIS_Pos         (3UL)                     /*!< DSRMMIS (Bit 3)                                       */
#define UART0_UARTMIS_DSRMMIS_Msk         (0x8UL)                   /*!< DSRMMIS (Bitfield-Mask: 0x01)                         */
#define UART0_UARTMIS_DCDMMIS_Pos         (2UL)                     /*!< DCDMMIS (Bit 2)                                       */
#define UART0_UARTMIS_DCDMMIS_Msk         (0x4UL)                   /*!< DCDMMIS (Bitfield-Mask: 0x01)                         */
#define UART0_UARTMIS_CTSMMIS_Pos         (1UL)                     /*!< CTSMMIS (Bit 1)                                       */
#define UART0_UARTMIS_CTSMMIS_Msk         (0x2UL)                   /*!< CTSMMIS (Bitfield-Mask: 0x01)                         */
#define UART0_UARTMIS_RIMMIS_Pos          (0UL)                     /*!< RIMMIS (Bit 0)                                        */
#define UART0_UARTMIS_RIMMIS_Msk          (0x1UL)                   /*!< RIMMIS (Bitfield-Mask: 0x01)                          */
/* ========================================================  UARTICR  ======================================================== */
#define UART0_UARTICR_OEIC_Pos            (10UL)                    /*!< OEIC (Bit 10)                                         */
#define UART0_UARTICR_OEIC_Msk            (0x400UL)                 /*!< OEIC (Bitfield-Mask: 0x01)                            */
#define UART0_UARTICR_BEIC_Pos            (9UL)                     /*!< BEIC (Bit 9)                                          */
#define UART0_UARTICR_BEIC_Msk            (0x200UL)                 /*!< BEIC (Bitfield-Mask: 0x01)                            */
#define UART0_UARTICR_PEIC_Pos            (8UL)                     /*!< PEIC (Bit 8)                                          */
#define UART0_UARTICR_PEIC_Msk            (0x100UL)                 /*!< PEIC (Bitfield-Mask: 0x01)                            */
#define UART0_UARTICR_FEIC_Pos            (7UL)                     /*!< FEIC (Bit 7)                                          */
#define UART0_UARTICR_FEIC_Msk            (0x80UL)                  /*!< FEIC (Bitfield-Mask: 0x01)                            */
#define UART0_UARTICR_RTIC_Pos            (6UL)                     /*!< RTIC (Bit 6)                                          */
#define UART0_UARTICR_RTIC_Msk            (0x40UL)                  /*!< RTIC (Bitfield-Mask: 0x01)                            */
#define UART0_UARTICR_TXIC_Pos            (5UL)                     /*!< TXIC (Bit 5)                                          */
#define UART0_UARTICR_TXIC_Msk            (0x20UL)                  /*!< TXIC (Bitfield-Mask: 0x01)                            */
#define UART0_UARTICR_RXIC_Pos            (4UL)                     /*!< RXIC (Bit 4)                                          */
#define UART0_UARTICR_RXIC_Msk            (0x10UL)                  /*!< RXIC (Bitfield-Mask: 0x01)                            */
#define UART0_UARTICR_DSRMIC_Pos          (3UL)                     /*!< DSRMIC (Bit 3)                                        */
#define UART0_UARTICR_DSRMIC_Msk          (0x8UL)                   /*!< DSRMIC (Bitfield-Mask: 0x01)                          */
#define UART0_UARTICR_DCDMIC_Pos          (2UL)                     /*!< DCDMIC (Bit 2)                                        */
#define UART0_UARTICR_DCDMIC_Msk          (0x4UL)                   /*!< DCDMIC (Bitfield-Mask: 0x01)                          */
#define UART0_UARTICR_CTSMIC_Pos          (1UL)                     /*!< CTSMIC (Bit 1)                                        */
#define UART0_UARTICR_CTSMIC_Msk          (0x2UL)                   /*!< CTSMIC (Bitfield-Mask: 0x01)                          */
#define UART0_UARTICR_RIMIC_Pos           (0UL)                     /*!< RIMIC (Bit 0)                                         */
#define UART0_UARTICR_RIMIC_Msk           (0x1UL)                   /*!< RIMIC (Bitfield-Mask: 0x01)                           */
/* =======================================================  UARTDMACR  ======================================================= */
#define UART0_UARTDMACR_DMAONERR_Pos      (2UL)                     /*!< DMAONERR (Bit 2)                                      */
#define UART0_UARTDMACR_DMAONERR_Msk      (0x4UL)                   /*!< DMAONERR (Bitfield-Mask: 0x01)                        */
#define UART0_UARTDMACR_TXDMAE_Pos        (1UL)                     /*!< TXDMAE (Bit 1)                                        */
#define UART0_UARTDMACR_TXDMAE_Msk        (0x2UL)                   /*!< TXDMAE (Bitfield-Mask: 0x01)                          */
#define UART0_UARTDMACR_RXDMAE_Pos        (0UL)                     /*!< RXDMAE (Bit 0)                                        */
#define UART0_UARTDMACR_RXDMAE_Msk        (0x1UL)                   /*!< RXDMAE (Bitfield-Mask: 0x01)                          */
/* =====================================================  UARTPERIPHID0  ===================================================== */
#define UART0_UARTPERIPHID0_PARTNUMBER0_Pos (0UL)                   /*!< PARTNUMBER0 (Bit 0)                                   */
#define UART0_UARTPERIPHID0_PARTNUMBER0_Msk (0xffUL)                /*!< PARTNUMBER0 (Bitfield-Mask: 0xff)                     */
/* =====================================================  UARTPERIPHID1  ===================================================== */
#define UART0_UARTPERIPHID1_DESIGNER0_Pos (4UL)                     /*!< DESIGNER0 (Bit 4)                                     */
#define UART0_UARTPERIPHID1_DESIGNER0_Msk (0xf0UL)                  /*!< DESIGNER0 (Bitfield-Mask: 0x0f)                       */
#define UART0_UARTPERIPHID1_PARTNUMBER1_Pos (0UL)                   /*!< PARTNUMBER1 (Bit 0)                                   */
#define UART0_UARTPERIPHID1_PARTNUMBER1_Msk (0xfUL)                 /*!< PARTNUMBER1 (Bitfield-Mask: 0x0f)                     */
/* =====================================================  UARTPERIPHID2  ===================================================== */
#define UART0_UARTPERIPHID2_REVISION_Pos  (4UL)                     /*!< REVISION (Bit 4)                                      */
#define UART0_UARTPERIPHID2_REVISION_Msk  (0xf0UL)                  /*!< REVISION (Bitfield-Mask: 0x0f)                        */
#define UART0_UARTPERIPHID2_DESIGNER1_Pos (0UL)                     /*!< DESIGNER1 (Bit 0)                                     */
#define UART0_UARTPERIPHID2_DESIGNER1_Msk (0xfUL)                   /*!< DESIGNER1 (Bitfield-Mask: 0x0f)                       */
/* =====================================================  UARTPERIPHID3  ===================================================== */
#define UART0_UARTPERIPHID3_CONFIGURATION_Pos (0UL)                 /*!< CONFIGURATION (Bit 0)                                 */
#define UART0_UARTPERIPHID3_CONFIGURATION_Msk (0xffUL)              /*!< CONFIGURATION (Bitfield-Mask: 0xff)                   */
/* =====================================================  UARTPCELLID0  ====================================================== */
#define UART0_UARTPCELLID0_UARTPCELLID0_Pos (0UL)                   /*!< UARTPCELLID0 (Bit 0)                                  */
#define UART0_UARTPCELLID0_UARTPCELLID0_Msk (0xffUL)                /*!< UARTPCELLID0 (Bitfield-Mask: 0xff)                    */
/* =====================================================  UARTPCELLID1  ====================================================== */
#define UART0_UARTPCELLID1_UARTPCELLID1_Pos (0UL)                   /*!< UARTPCELLID1 (Bit 0)                                  */
#define UART0_UARTPCELLID1_UARTPCELLID1_Msk (0xffUL)                /*!< UARTPCELLID1 (Bitfield-Mask: 0xff)                    */
/* =====================================================  UARTPCELLID2  ====================================================== */
#define UART0_UARTPCELLID2_UARTPCELLID2_Pos (0UL)                   /*!< UARTPCELLID2 (Bit 0)                                  */
#define UART0_UARTPCELLID2_UARTPCELLID2_Msk (0xffUL)                /*!< UARTPCELLID2 (Bitfield-Mask: 0xff)                    */
/* =====================================================  UARTPCELLID3  ====================================================== */
#define UART0_UARTPCELLID3_UARTPCELLID3_Pos (0UL)                   /*!< UARTPCELLID3 (Bit 0)                                  */
#define UART0_UARTPCELLID3_UARTPCELLID3_Msk (0xffUL)                /*!< UARTPCELLID3 (Bitfield-Mask: 0xff)                    */


/* =========================================================================================================================== */
/* ================                                           SPI0                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  SSPCR0  ========================================================= */
#define SPI0_SSPCR0_SCR_Pos               (8UL)                     /*!< SCR (Bit 8)                                           */
#define SPI0_SSPCR0_SCR_Msk               (0xff00UL)                /*!< SCR (Bitfield-Mask: 0xff)                             */
#define SPI0_SSPCR0_SPH_Pos               (7UL)                     /*!< SPH (Bit 7)                                           */
#define SPI0_SSPCR0_SPH_Msk               (0x80UL)                  /*!< SPH (Bitfield-Mask: 0x01)                             */
#define SPI0_SSPCR0_SPO_Pos               (6UL)                     /*!< SPO (Bit 6)                                           */
#define SPI0_SSPCR0_SPO_Msk               (0x40UL)                  /*!< SPO (Bitfield-Mask: 0x01)                             */
#define SPI0_SSPCR0_FRF_Pos               (4UL)                     /*!< FRF (Bit 4)                                           */
#define SPI0_SSPCR0_FRF_Msk               (0x30UL)                  /*!< FRF (Bitfield-Mask: 0x03)                             */
#define SPI0_SSPCR0_DSS_Pos               (0UL)                     /*!< DSS (Bit 0)                                           */
#define SPI0_SSPCR0_DSS_Msk               (0xfUL)                   /*!< DSS (Bitfield-Mask: 0x0f)                             */
/* ========================================================  SSPCR1  ========================================================= */
#define SPI0_SSPCR1_SOD_Pos               (3UL)                     /*!< SOD (Bit 3)                                           */
#define SPI0_SSPCR1_SOD_Msk               (0x8UL)                   /*!< SOD (Bitfield-Mask: 0x01)                             */
#define SPI0_SSPCR1_MS_Pos                (2UL)                     /*!< MS (Bit 2)                                            */
#define SPI0_SSPCR1_MS_Msk                (0x4UL)                   /*!< MS (Bitfield-Mask: 0x01)                              */
#define SPI0_SSPCR1_SSE_Pos               (1UL)                     /*!< SSE (Bit 1)                                           */
#define SPI0_SSPCR1_SSE_Msk               (0x2UL)                   /*!< SSE (Bitfield-Mask: 0x01)                             */
#define SPI0_SSPCR1_LBM_Pos               (0UL)                     /*!< LBM (Bit 0)                                           */
#define SPI0_SSPCR1_LBM_Msk               (0x1UL)                   /*!< LBM (Bitfield-Mask: 0x01)                             */
/* =========================================================  SSPDR  ========================================================= */
#define SPI0_SSPDR_DATA_Pos               (0UL)                     /*!< DATA (Bit 0)                                          */
#define SPI0_SSPDR_DATA_Msk               (0xffffUL)                /*!< DATA (Bitfield-Mask: 0xffff)                          */
/* =========================================================  SSPSR  ========================================================= */
#define SPI0_SSPSR_BSY_Pos                (4UL)                     /*!< BSY (Bit 4)                                           */
#define SPI0_SSPSR_BSY_Msk                (0x10UL)                  /*!< BSY (Bitfield-Mask: 0x01)                             */
#define SPI0_SSPSR_RFF_Pos                (3UL)                     /*!< RFF (Bit 3)                                           */
#define SPI0_SSPSR_RFF_Msk                (0x8UL)                   /*!< RFF (Bitfield-Mask: 0x01)                             */
#define SPI0_SSPSR_RNE_Pos                (2UL)                     /*!< RNE (Bit 2)                                           */
#define SPI0_SSPSR_RNE_Msk                (0x4UL)                   /*!< RNE (Bitfield-Mask: 0x01)                             */
#define SPI0_SSPSR_TNF_Pos                (1UL)                     /*!< TNF (Bit 1)                                           */
#define SPI0_SSPSR_TNF_Msk                (0x2UL)                   /*!< TNF (Bitfield-Mask: 0x01)                             */
#define SPI0_SSPSR_TFE_Pos                (0UL)                     /*!< TFE (Bit 0)                                           */
#define SPI0_SSPSR_TFE_Msk                (0x1UL)                   /*!< TFE (Bitfield-Mask: 0x01)                             */
/* ========================================================  SSPCPSR  ======================================================== */
#define SPI0_SSPCPSR_CPSDVSR_Pos          (0UL)                     /*!< CPSDVSR (Bit 0)                                       */
#define SPI0_SSPCPSR_CPSDVSR_Msk          (0xffUL)                  /*!< CPSDVSR (Bitfield-Mask: 0xff)                         */
/* ========================================================  SSPIMSC  ======================================================== */
#define SPI0_SSPIMSC_TXIM_Pos             (3UL)                     /*!< TXIM (Bit 3)                                          */
#define SPI0_SSPIMSC_TXIM_Msk             (0x8UL)                   /*!< TXIM (Bitfield-Mask: 0x01)                            */
#define SPI0_SSPIMSC_RXIM_Pos             (2UL)                     /*!< RXIM (Bit 2)                                          */
#define SPI0_SSPIMSC_RXIM_Msk             (0x4UL)                   /*!< RXIM (Bitfield-Mask: 0x01)                            */
#define SPI0_SSPIMSC_RTIM_Pos             (1UL)                     /*!< RTIM (Bit 1)                                          */
#define SPI0_SSPIMSC_RTIM_Msk             (0x2UL)                   /*!< RTIM (Bitfield-Mask: 0x01)                            */
#define SPI0_SSPIMSC_RORIM_Pos            (0UL)                     /*!< RORIM (Bit 0)                                         */
#define SPI0_SSPIMSC_RORIM_Msk            (0x1UL)                   /*!< RORIM (Bitfield-Mask: 0x01)                           */
/* ========================================================  SSPRIS  ========================================================= */
#define SPI0_SSPRIS_TXRIS_Pos             (3UL)                     /*!< TXRIS (Bit 3)                                         */
#define SPI0_SSPRIS_TXRIS_Msk             (0x8UL)                   /*!< TXRIS (Bitfield-Mask: 0x01)                           */
#define SPI0_SSPRIS_RXRIS_Pos             (2UL)                     /*!< RXRIS (Bit 2)                                         */
#define SPI0_SSPRIS_RXRIS_Msk             (0x4UL)                   /*!< RXRIS (Bitfield-Mask: 0x01)                           */
#define SPI0_SSPRIS_RTRIS_Pos             (1UL)                     /*!< RTRIS (Bit 1)                                         */
#define SPI0_SSPRIS_RTRIS_Msk             (0x2UL)                   /*!< RTRIS (Bitfield-Mask: 0x01)                           */
#define SPI0_SSPRIS_RORRIS_Pos            (0UL)                     /*!< RORRIS (Bit 0)                                        */
#define SPI0_SSPRIS_RORRIS_Msk            (0x1UL)                   /*!< RORRIS (Bitfield-Mask: 0x01)                          */
/* ========================================================  SSPMIS  ========================================================= */
#define SPI0_SSPMIS_TXMIS_Pos             (3UL)                     /*!< TXMIS (Bit 3)                                         */
#define SPI0_SSPMIS_TXMIS_Msk             (0x8UL)                   /*!< TXMIS (Bitfield-Mask: 0x01)                           */
#define SPI0_SSPMIS_RXMIS_Pos             (2UL)                     /*!< RXMIS (Bit 2)                                         */
#define SPI0_SSPMIS_RXMIS_Msk             (0x4UL)                   /*!< RXMIS (Bitfield-Mask: 0x01)                           */
#define SPI0_SSPMIS_RTMIS_Pos             (1UL)                     /*!< RTMIS (Bit 1)                                         */
#define SPI0_SSPMIS_RTMIS_Msk             (0x2UL)                   /*!< RTMIS (Bitfield-Mask: 0x01)                           */
#define SPI0_SSPMIS_RORMIS_Pos            (0UL)                     /*!< RORMIS (Bit 0)                                        */
#define SPI0_SSPMIS_RORMIS_Msk            (0x1UL)                   /*!< RORMIS (Bitfield-Mask: 0x01)                          */
/* ========================================================  SSPICR  ========================================================= */
#define SPI0_SSPICR_RTIC_Pos              (1UL)                     /*!< RTIC (Bit 1)                                          */
#define SPI0_SSPICR_RTIC_Msk              (0x2UL)                   /*!< RTIC (Bitfield-Mask: 0x01)                            */
#define SPI0_SSPICR_RORIC_Pos             (0UL)                     /*!< RORIC (Bit 0)                                         */
#define SPI0_SSPICR_RORIC_Msk             (0x1UL)                   /*!< RORIC (Bitfield-Mask: 0x01)                           */
/* =======================================================  SSPDMACR  ======================================================== */
#define SPI0_SSPDMACR_TXDMAE_Pos          (1UL)                     /*!< TXDMAE (Bit 1)                                        */
#define SPI0_SSPDMACR_TXDMAE_Msk          (0x2UL)                   /*!< TXDMAE (Bitfield-Mask: 0x01)                          */
#define SPI0_SSPDMACR_RXDMAE_Pos          (0UL)                     /*!< RXDMAE (Bit 0)                                        */
#define SPI0_SSPDMACR_RXDMAE_Msk          (0x1UL)                   /*!< RXDMAE (Bitfield-Mask: 0x01)                          */
/* =====================================================  SSPPERIPHID0  ====================================================== */
#define SPI0_SSPPERIPHID0_PARTNUMBER0_Pos (0UL)                     /*!< PARTNUMBER0 (Bit 0)                                   */
#define SPI0_SSPPERIPHID0_PARTNUMBER0_Msk (0xffUL)                  /*!< PARTNUMBER0 (Bitfield-Mask: 0xff)                     */
/* =====================================================  SSPPERIPHID1  ====================================================== */
#define SPI0_SSPPERIPHID1_DESIGNER0_Pos   (4UL)                     /*!< DESIGNER0 (Bit 4)                                     */
#define SPI0_SSPPERIPHID1_DESIGNER0_Msk   (0xf0UL)                  /*!< DESIGNER0 (Bitfield-Mask: 0x0f)                       */
#define SPI0_SSPPERIPHID1_PARTNUMBER1_Pos (0UL)                     /*!< PARTNUMBER1 (Bit 0)                                   */
#define SPI0_SSPPERIPHID1_PARTNUMBER1_Msk (0xfUL)                   /*!< PARTNUMBER1 (Bitfield-Mask: 0x0f)                     */
/* =====================================================  SSPPERIPHID2  ====================================================== */
#define SPI0_SSPPERIPHID2_REVISION_Pos    (4UL)                     /*!< REVISION (Bit 4)                                      */
#define SPI0_SSPPERIPHID2_REVISION_Msk    (0xf0UL)                  /*!< REVISION (Bitfield-Mask: 0x0f)                        */
#define SPI0_SSPPERIPHID2_DESIGNER1_Pos   (0UL)                     /*!< DESIGNER1 (Bit 0)                                     */
#define SPI0_SSPPERIPHID2_DESIGNER1_Msk   (0xfUL)                   /*!< DESIGNER1 (Bitfield-Mask: 0x0f)                       */
/* =====================================================  SSPPERIPHID3  ====================================================== */
#define SPI0_SSPPERIPHID3_CONFIGURATION_Pos (0UL)                   /*!< CONFIGURATION (Bit 0)                                 */
#define SPI0_SSPPERIPHID3_CONFIGURATION_Msk (0xffUL)                /*!< CONFIGURATION (Bitfield-Mask: 0xff)                   */
/* ======================================================  SSPPCELLID0  ====================================================== */
#define SPI0_SSPPCELLID0_SSPPCELLID0_Pos  (0UL)                     /*!< SSPPCELLID0 (Bit 0)                                   */
#define SPI0_SSPPCELLID0_SSPPCELLID0_Msk  (0xffUL)                  /*!< SSPPCELLID0 (Bitfield-Mask: 0xff)                     */
/* ======================================================  SSPPCELLID1  ====================================================== */
#define SPI0_SSPPCELLID1_SSPPCELLID1_Pos  (0UL)                     /*!< SSPPCELLID1 (Bit 0)                                   */
#define SPI0_SSPPCELLID1_SSPPCELLID1_Msk  (0xffUL)                  /*!< SSPPCELLID1 (Bitfield-Mask: 0xff)                     */
/* ======================================================  SSPPCELLID2  ====================================================== */
#define SPI0_SSPPCELLID2_SSPPCELLID2_Pos  (0UL)                     /*!< SSPPCELLID2 (Bit 0)                                   */
#define SPI0_SSPPCELLID2_SSPPCELLID2_Msk  (0xffUL)                  /*!< SSPPCELLID2 (Bitfield-Mask: 0xff)                     */
/* ======================================================  SSPPCELLID3  ====================================================== */
#define SPI0_SSPPCELLID3_SSPPCELLID3_Pos  (0UL)                     /*!< SSPPCELLID3 (Bit 0)                                   */
#define SPI0_SSPPCELLID3_SSPPCELLID3_Msk  (0xffUL)                  /*!< SSPPCELLID3 (Bitfield-Mask: 0xff)                     */


/* =========================================================================================================================== */
/* ================                                           I2C0                                            ================ */
/* =========================================================================================================================== */

