mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ========================================================  IC_CON  ========================================================= */
#define I2C0_IC_CON_STOP_DET_IF_MASTER_ACTIVE_Pos (10UL)            /*!< STOP_DET_IF_MASTER_ACTIVE (Bit 10)                    */
#define I2C0_IC_CON_STOP_DET_IF_MASTER_ACTIVE_Msk (0x400UL)         /*!< STOP_DET_IF_MASTER_ACTIVE (Bitfield-Mask: 0x01)       */
#define I2C0_IC_CON_RX_FIFO_FULL_HLD_CTRL_Pos (9UL)                 /*!< RX_FIFO_FULL_HLD_CTRL (Bit 9)                         */
#define I2C0_IC_CON_RX_FIFO_FULL_HLD_CTRL_Msk (0x200UL)             /*!< RX_FIFO_FULL_HLD_CTRL (Bitfield-Mask: 0x01)           */
#define I2C0_IC_CON_TX_EMPTY_CTRL_Pos     (8UL)                     /*!< TX_EMPTY_CTRL (Bit 8)                                 */
#define I2C0_IC_CON_TX_EMPTY_CTRL_Msk     (0x100UL)                 /*!< TX_EMPTY_CTRL (Bitfield-Mask: 0x01)                   */
#define I2C0_IC_CON_STOP_DET_IFADDRESSED_Pos (7UL)                  /*!< STOP_DET_IFADDRESSED (Bit 7)                          */
#define I2C0_IC_CON_STOP_DET_IFADDRESSED_Msk (0x80UL)               /*!< STOP_DET_IFADDRESSED (Bitfield-Mask: 0x01)            */
#define I2C0_IC_CON_IC_SLAVE_DISABLE_Pos  (6UL)                     /*!< IC_SLAVE_DISABLE (Bit 6)                              */
#define I2C0_IC_CON_IC_SLAVE_DISABLE_Msk  (0x40UL)                  /*!< IC_SLAVE_DISABLE (Bitfield-Mask: 0x01)                */
#define I2C0_IC_CON_IC_RESTART_EN_Pos     (5UL)                     /*!< IC_RESTART_EN (Bit 5)                                 */
#define I2C0_IC_CON_IC_RESTART_EN_Msk     (0x20UL)                  /*!< IC_RESTART_EN (Bitfield-Mask: 0x01)                   */
#define I2C0_IC_CON_IC_10BITADDR_MASTER_Pos (4UL)                   /*!< IC_10BITADDR_MASTER (Bit 4)                           */
#define I2C0_IC_CON_IC_10BITADDR_MASTER_Msk (0x10UL)                /*!< IC_10BITADDR_MASTER (Bitfield-Mask: 0x01)             */
#define I2C0_IC_CON_IC_10BITADDR_SLAVE_Pos (3UL)                    /*!< IC_10BITADDR_SLAVE (Bit 3)                            */
#define I2C0_IC_CON_IC_10BITADDR_SLAVE_Msk (0x8UL)                  /*!< IC_10BITADDR_SLAVE (Bitfield-Mask: 0x01)              */
#define I2C0_IC_CON_SPEED_Pos             (1UL)                     /*!< SPEED (Bit 1)                                         */
#define I2C0_IC_CON_SPEED_Msk             (0x6UL)                   /*!< SPEED (Bitfield-Mask: 0x03)                           */
#define I2C0_IC_CON_MASTER_MODE_Pos       (0UL)                     /*!< MASTER_MODE (Bit 0)                                   */
#define I2C0_IC_CON_MASTER_MODE_Msk       (0x1UL)                   /*!< MASTER_MODE (Bitfield-Mask: 0x01)                     */
/* ========================================================  IC_TAR  ========================================================= */
#define I2C0_IC_TAR_SPECIAL_Pos           (11UL)                    /*!< SPECIAL (Bit 11)                                      */
#define I2C0_IC_TAR_SPECIAL_Msk           (0x800UL)                 /*!< SPECIAL (Bitfield-Mask: 0x01)                         */
#define I2C0_IC_TAR_GC_OR_START_Pos       (10UL)                    /*!< GC_OR_START (Bit 10)                                  */
#define I2C0_IC_TAR_GC_OR_START_Msk       (0x400UL)                 /*!< GC_OR_START (Bitfield-Mask: 0x01)                     */
#define I2C0_IC_TAR_IC_TAR_Pos            (0UL)                     /*!< IC_TAR (Bit 0)                                        */
#define I2C0_IC_TAR_IC_TAR_Msk            (0x3ffUL)                 /*!< IC_TAR (Bitfield-Mask: 0x3ff)                         */
/* ========================================================  IC_SAR  ========================================================= */
#define I2C0_IC_SAR_IC_SAR_Pos            (0UL)                     /*!< IC_SAR (Bit 0)                                        */
#define I2C0_IC_SAR_IC_SAR_Msk            (0x3ffUL)                 /*!< IC_SAR (Bitfield-Mask: 0x3ff)                         */
/* ======================================================  IC_DATA_CMD  ====================================================== */
#define I2C0_IC_DATA_CMD_FIRST_DATA_BYTE_Pos (11UL)                 /*!< FIRST_DATA_BYTE (Bit 11)                              */
#define I2C0_IC_DATA_CMD_FIRST_DATA_BYTE_Msk (0x800UL)              /*!< FIRST_DATA_BYTE (Bitfield-Mask: 0x01)                 */
#define I2C0_IC_DATA_CMD_RESTART_Pos      (10UL)                    /*!< RESTART (Bit 10)                                      */
#define I2C0_IC_DATA_CMD_RESTART_Msk      (0x400UL)                 /*!< RESTART (Bitfield-Mask: 0x01)                         */
#define I2C0_IC_DATA_CMD_STOP_Pos         (9UL)                     /*!< STOP (Bit 9)                                          */
#define I2C0_IC_DATA_CMD_STOP_Msk         (0x200UL)                 /*!< STOP (Bitfield-Mask: 0x01)                            */
#define I2C0_IC_DATA_CMD_CMD_Pos          (8UL)                     /*!< CMD (Bit 8)                                           */
#define I2C0_IC_DATA_CMD_CMD_Msk          (0x100UL)                 /*!< CMD (Bitfield-Mask: 0x01)                             */
#define I2C0_IC_DATA_CMD_DAT_Pos          (0UL)                     /*!< DAT (Bit 0)                                           */
#define I2C0_IC_DATA_CMD_DAT_Msk          (0xffUL)                  /*!< DAT (Bitfield-Mask: 0xff)                             */
/* ====================================================  IC_SS_SCL_HCNT  ===================================================== */
#define I2C0_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT_Pos (0UL)                /*!< IC_SS_SCL_HCNT (Bit 0)                                */
#define I2C0_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT_Msk (0xffffUL)           /*!< IC_SS_SCL_HCNT (Bitfield-Mask: 0xffff)                */
/* ====================================================  IC_SS_SCL_LCNT  ===================================================== */
#define I2C0_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT_Pos (0UL)                /*!< IC_SS_SCL_LCNT (Bit 0)                                */
#define I2C0_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT_Msk (0xffffUL)           /*!< IC_SS_SCL_LCNT (Bitfield-Mask: 0xffff)                */
/* ====================================================  IC_FS_SCL_HCNT  ===================================================== */
#define I2C0_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_Pos (0UL)                /*!< IC_FS_SCL_HCNT (Bit 0)                                */
#define I2C0_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_Msk (0xffffUL)           /*!< IC_FS_SCL_HCNT (Bitfield-Mask: 0xffff)                */
/* ====================================================  IC_FS_SCL_LCNT  ===================================================== */
#define I2C0_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_Pos (0UL)                /*!< IC_FS_SCL_LCNT (Bit 0)                                */
#define I2C0_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_Msk (0xffffUL)           /*!< IC_FS_SCL_LCNT (Bitfield-Mask: 0xffff)                */
/* =====================================================  IC_INTR_STAT  ====================================================== */
#define I2C0_IC_INTR_STAT_R_RESTART_DET_Pos (12UL)                  /*!< R_RESTART_DET (Bit 12)                                */
#define I2C0_IC_INTR_STAT_R_RESTART_DET_Msk (0x1000UL)              /*!< R_RESTART_DET (Bitfield-Mask: 0x01)                   */
#define I2C0_IC_INTR_STAT_R_GEN_CALL_Pos  (11UL)                    /*!< R_GEN_CALL (Bit 11)                                   */
#define I2C0_IC_INTR_STAT_R_GEN_CALL_Msk  (0x800UL)                 /*!< R_GEN_CALL (Bitfield-Mask: 0x01)                      */
#define I2C0_IC_INTR_STAT_R_START_DET_Pos (10UL)                    /*!< R_START_DET (Bit 10)                                  */
#define I2C0_IC_INTR_STAT_R_START_DET_Msk (0x400UL)                 /*!< R_START_DET (Bitfield-Mask: 0x01)                     */
#define I2C0_IC_INTR_STAT_R_STOP_DET_Pos  (9UL)                     /*!< R_STOP_DET (Bit 9)                                    */
#define I2C0_IC_INTR_STAT_R_STOP_DET_Msk  (0x200UL)                 /*!< R_STOP_DET (Bitfield-Mask: 0x01)                      */
#define I2C0_IC_INTR_STAT_R_ACTIVITY_Pos  (8UL)                     /*!< R_ACTIVITY (Bit 8)                                    */
#define I2C0_IC_INTR_STAT_R_ACTIVITY_Msk  (0x100UL)                 /*!< R_ACTIVITY (Bitfield-Mask: 0x01)                      */
#define I2C0_IC_INTR_STAT_R_RX_DONE_Pos   (7UL)                     /*!< R_RX_DONE (Bit 7)                                     */
#define I2C0_IC_INTR_STAT_R_RX_DONE_Msk   (0x80UL)                  /*!< R_RX_DONE (Bitfield-Mask: 0x01)                       */
#define I2C0_IC_INTR_STAT_R_TX_ABRT_Pos   (6UL)                     /*!< R_TX_ABRT (Bit 6)                                     */
#define I2C0_IC_INTR_STAT_R_TX_ABRT_Msk   (0x40UL)                  /*!< R_TX_ABRT (Bitfield-Mask: 0x01)                       */
#define I2C0_IC_INTR_STAT_R_RD_REQ_Pos    (5UL)                     /*!< R_RD_REQ (Bit 5)                                      */
#define I2C0_IC_INTR_STAT_R_RD_REQ_Msk    (0x20UL)                  /*!< R_RD_REQ (Bitfield-Mask: 0x01)                        */
#define I2C0_IC_INTR_STAT_R_TX_EMPTY_Pos  (4UL)                     /*!< R_TX_EMPTY (Bit 4)                                    */
#define I2C0_IC_INTR_STAT_R_TX_EMPTY_Msk  (0x10UL)                  /*!< R_TX_EMPTY (Bitfield-Mask: 0x01)                      */
#define I2C0_IC_INTR_STAT_R_TX_OVER_Pos   (3UL)                     /*!< R_TX_OVER (Bit 3)                                     */
#define I2C0_IC_INTR_STAT_R_TX_OVER_Msk   (0x8UL)                   /*!< R_TX_OVER (Bitfield-Mask: 0x01)                       */
#define I2C0_IC_INTR_STAT_R_RX_FULL_Pos   (2UL)                     /*!< R_RX_FULL (Bit 2)                                     */
#define I2C0_IC_INTR_STAT_R_RX_FULL_Msk   (0x4UL)                   /*!< R_RX_FULL (Bitfield-Mask: 0x01)                       */
#define I2C0_IC_INTR_STAT_R_RX_OVER_Pos   (1UL)                     /*!< R_RX_OVER (Bit 1)                                     */
#define I2C0_IC_INTR_STAT_R_RX_OVER_Msk   (0x2UL)                   /*!< R_RX_OVER (Bitfield-Mask: 0x01)                       */
#define I2C0_IC_INTR_STAT_R_RX_UNDER_Pos  (0UL)                     /*!< R_RX_UNDER (Bit 0)                                    */
#define I2C0_IC_INTR_STAT_R_RX_UNDER_Msk  (0x1UL)                   /*!< R_RX_UNDER (Bitfield-Mask: 0x01)                      */
/* =====================================================  IC_INTR_MASK  ====================================================== */
#define I2C0_IC_INTR_MASK_M_RESTART_DET_Pos (12UL)                  /*!< M_RESTART_DET (Bit 12)                                */
#define I2C0_IC_INTR_MASK_M_RESTART_DET_Msk (0x1000UL)              /*!< M_RESTART_DET (Bitfield-Mask: 0x01)                   */
#define I2C0_IC_INTR_MASK_M_GEN_CALL_Pos  (11UL)                    /*!< M_GEN_CALL (Bit 11)                                   */
#define I2C0_IC_INTR_MASK_M_GEN_CALL_Msk  (0x800UL)                 /*!< M_GEN_CALL (Bitfield-Mask: 0x01)                      */
#define I2C0_IC_INTR_MASK_M_START_DET_Pos (10UL)                    /*!< M_START_DET (Bit 10)                                  */
#define I2C0_IC_INTR_MASK_M_START_DET_Msk (0x400UL)                 /*!< M_START_DET (Bitfield-Mask: 0x01)                     */
#define I2C0_IC_INTR_MASK_M_STOP_DET_Pos  (9UL)                     /*!< M_STOP_DET (Bit 9)                                    */
#define I2C0_IC_INTR_MASK_M_STOP_DET_Msk  (0x200UL)                 /*!< M_STOP_DET (Bitfield-Mask: 0x01)                      */
#define I2C0_IC_INTR_MASK_M_ACTIVITY_Pos  (8UL)                     /*!< M_ACTIVITY (Bit 8)                                    */
#define I2C0_IC_INTR_MASK_M_ACTIVITY_Msk  (0x100UL)                 /*!< M_ACTIVITY (Bitfield-Mask: 0x01)                      */
#define I2C0_IC_INTR_MASK_M_RX_DONE_Pos   (7UL)                     /*!< M_RX_DONE (Bit 7)                                     */
#define I2C0_IC_INTR_MASK_M_RX_DONE_Msk   (0x80UL)                  /*!< M_RX_DONE (Bitfield-Mask: 0x01)                       */
#define I2C0_IC_INTR_MASK_M_TX_ABRT_Pos   (6UL)                     /*!< M_TX_ABRT (Bit 6)                                     */
#define I2C0_IC_INTR_MASK_M_TX_ABRT_Msk   (0x40UL)                  /*!< M_TX_ABRT (Bitfield-Mask: 0x01)                       */
#define I2C0_IC_INTR_MASK_M_RD_REQ_Pos    (5UL)                     /*!< M_RD_REQ (Bit 5)                                      */
#define I2C0_IC_INTR_MASK_M_RD_REQ_Msk    (0x20UL)                  /*!< M_RD_REQ (Bitfield-Mask: 0x01)                        */
#define I2C0_IC_INTR_MASK_M_TX_EMPTY_Pos  (4UL)                     /*!< M_TX_EMPTY (Bit 4)                                    */
#define I2C0_IC_INTR_MASK_M_TX_EMPTY_Msk  (0x10UL)                  /*!< M_TX_EMPTY (Bitfield-Mask: 0x01)                      */
#define I2C0_IC_INTR_MASK_M_TX_OVER_Pos   (3UL)                     /*!< M_TX_OVER (Bit 3)                                     */
#define I2C0_IC_INTR_MASK_M_TX_OVER_Msk   (0x8UL)                   /*!< M_TX_OVER (Bitfield-Mask: 0x01)                       */
#define I2C0_IC_INTR_MASK_M_RX_FULL_Pos   (2UL)                     /*!< M_RX_FULL (Bit 2)                                     */
#define I2C0_IC_INTR_MASK_M_RX_FULL_Msk   (0x4UL)                   /*!< M_RX_FULL (Bitfield-Mask: 0x01)                       */
#define I2C0_IC_INTR_MASK_M_RX_OVER_Pos   (1UL)                     /*!< M_RX_OVER (Bit 1)                                     */
#define I2C0_IC_INTR_MASK_M_RX_OVER_Msk   (0x2UL)                   /*!< M_RX_OVER (Bitfield-Mask: 0x01)                       */
#define I2C0_IC_INTR_MASK_M_RX_UNDER_Pos  (0UL)                     /*!< M_RX_UNDER (Bit 0)                                    */
#define I2C0_IC_INTR_MASK_M_RX_UNDER_Msk  (0x1UL)                   /*!< M_RX_UNDER (Bitfield-Mask: 0x01)                      */
/* ===================================================  IC_RAW_INTR_STAT  ==================================================== */
#define I2C0_IC_RAW_INTR_STAT_RESTART_DET_Pos (12UL)                /*!< RESTART_DET (Bit 12)                                  */
#define I2C0_IC_RAW_INTR_STAT_RESTART_DET_Msk (0x1000UL)            /*!< RESTART_DET (Bitfield-Mask: 0x01)                     */
#define I2C0_IC_RAW_INTR_STAT_GEN_CALL_Pos (11UL)                   /*!< GEN_CALL (Bit 11)                                     */
#define I2C0_IC_RAW_INTR_STAT_GEN_CALL_Msk (0x800UL)                /*!< GEN_CALL (Bitfield-Mask: 0x01)                        */
#define I2C0_IC_RAW_INTR_STAT_START_DET_Pos (10UL)                  /*!< START_DET (Bit 10)                                    */
#define I2C0_IC_RAW_INTR_STAT_START_DET_Msk (0x400UL)               /*!< START_DET (Bitfield-Mask: 0x01)                       */
#define I2C0_IC_RAW_INTR_STAT_STOP_DET_Pos (9UL)                    /*!< STOP_DET (Bit 9)                                      */
#define I2C0_IC_RAW_INTR_STAT_STOP_DET_Msk (0x200UL)                /*!< STOP_DET (Bitfield-Mask: 0x01)                        */
#define I2C0_IC_RAW_INTR_STAT_ACTIVITY_Pos (8UL)                    /*!< ACTIVITY (Bit 8)                                      */
#define I2C0_IC_RAW_INTR_STAT_ACTIVITY_Msk (0x100UL)                /*!< ACTIVITY (Bitfield-Mask: 0x01)                        */
#define I2C0_IC_RAW_INTR_STAT_RX_DONE_Pos (7UL)                     /*!< RX_DONE (Bit 7)                                       */
#define I2C0_IC_RAW_INTR_STAT_RX_DONE_Msk (0x80UL)                  /*!< RX_DONE (Bitfield-Mask: 0x01)                         */
#define I2C0_IC_RAW_INTR_STAT_TX_ABRT_Pos (6UL)                     /*!< TX_ABRT (Bit 6)                                       */
#define I2C0_IC_RAW_INTR_STAT_TX_ABRT_Msk (0x40UL)                  /*!< TX_ABRT (Bitfield-Mask: 0x01)                         */
#define I2C0_IC_RAW_INTR_STAT_RD_REQ_Pos  (5UL)                     /*!< RD_REQ (Bit 5)                                        */
#define I2C0_IC_RAW_INTR_STAT_RD_REQ_Msk  (0x20UL)                  /*!< RD_REQ (Bitfield-Mask: 0x01)                          */
#define I2C0_IC_RAW_INTR_STAT_TX_EMPTY_Pos (4UL)                    /*!< TX_EMPTY (Bit 4)                                      */
#define I2C0_IC_RAW_INTR_STAT_TX_EMPTY_Msk (0x10UL)                 /*!< TX_EMPTY (Bitfield-Mask: 0x01)                        */
#define I2C0_IC_RAW_INTR_STAT_TX_OVER_Pos (3UL)                     /*!< TX_OVER (Bit 3)                                       */
#define I2C0_IC_RAW_INTR_STAT_TX_OVER_Msk (0x8UL)                   /*!< TX_OVER (Bitfield-Mask: 0x01)                         */
#define I2C0_IC_RAW_INTR_STAT_RX_FULL_Pos (2UL)                     /*!< RX_FULL (Bit 2)                                       */
#define I2C0_IC_RAW_INTR_STAT_RX_FULL_Msk (0x4UL)                   /*!< RX_FULL (Bitfield-Mask: 0x01)                         */
#define I2C0_IC_RAW_INTR_STAT_RX_OVER_Pos (1UL)                     /*!< RX_OVER (Bit 1)                                       */
#define I2C0_IC_RAW_INTR_STAT_RX_OVER_Msk (0x2UL)                   /*!< RX_OVER (Bitfield-Mask: 0x01)                         */
#define I2C0_IC_RAW_INTR_STAT_RX_UNDER_Pos (0UL)                    /*!< RX_UNDER (Bit 0)                                      */
#define I2C0_IC_RAW_INTR_STAT_RX_UNDER_Msk (0x1UL)                  /*!< RX_UNDER (Bitfield-Mask: 0x01)                        */
/* =======================================================  IC_RX_TL  ======================================================== */
#define I2C0_IC_RX_TL_RX_TL_Pos           (0UL)                     /*!< RX_TL (Bit 0)                                         */
#define I2C0_IC_RX_TL_RX_TL_Msk           (0xffUL)                  /*!< RX_TL (Bitfield-Mask: 0xff)                           */
/* =======================================================  IC_TX_TL  ======================================================== */
#define I2C0_IC_TX_TL_TX_TL_Pos           (0UL)                     /*!< TX_TL (Bit 0)                                         */
#define I2C0_IC_TX_TL_TX_TL_Msk           (0xffUL)                  /*!< TX_TL (Bitfield-Mask: 0xff)                           */
/* ======================================================  IC_CLR_INTR  ====================================================== */
#define I2C0_IC_CLR_INTR_CLR_INTR_Pos     (0UL)                     /*!< CLR_INTR (Bit 0)                                      */
#define I2C0_IC_CLR_INTR_CLR_INTR_Msk     (0x1UL)                   /*!< CLR_INTR (Bitfield-Mask: 0x01)                        */
/* ====================================================  IC_CLR_RX_UNDER  ==================================================== */
#define I2C0_IC_CLR_RX_UNDER_CLR_RX_UNDER_Pos (0UL)                 /*!< CLR_RX_UNDER (Bit 0)                                  */
#define I2C0_IC_CLR_RX_UNDER_CLR_RX_UNDER_Msk (0x1UL)               /*!< CLR_RX_UNDER (Bitfield-Mask: 0x01)                    */
/* ====================================================  IC_CLR_RX_OVER  ===================================================== */
#define I2C0_IC_CLR_RX_OVER_CLR_RX_OVER_Pos (0UL)                   /*!< CLR_RX_OVER (Bit 0)                                   */
#define I2C0_IC_CLR_RX_OVER_CLR_RX_OVER_Msk (0x1UL)                 /*!< CLR_RX_OVER (Bitfield-Mask: 0x01)                     */
/* ====================================================  IC_CLR_TX_OVER  ===================================================== */
#define I2C0_IC_CLR_TX_OVER_CLR_TX_OVER_Pos (0UL)                   /*!< CLR_TX_OVER (Bit 0)                                   */
#define I2C0_IC_CLR_TX_OVER_CLR_TX_OVER_Msk (0x1UL)                 /*!< CLR_TX_OVER (Bitfield-Mask: 0x01)                     */
/* =====================================================  IC_CLR_RD_REQ  ===================================================== */
#define I2C0_IC_CLR_RD_REQ_CLR_RD_REQ_Pos (0UL)                     /*!< CLR_RD_REQ (Bit 0)                                    */
#define I2C0_IC_CLR_RD_REQ_CLR_RD_REQ_Msk (0x1UL)                   /*!< CLR_RD_REQ (Bitfield-Mask: 0x01)                      */
/* ====================================================  IC_CLR_TX_ABRT  ===================================================== */
#define I2C0_IC_CLR_TX_ABRT_CLR_TX_ABRT_Pos (0UL)                   /*!< CLR_TX_ABRT (Bit 0)                                   */
#define I2C0_IC_CLR_TX_ABRT_CLR_TX_ABRT_Msk (0x1UL)                 /*!< CLR_TX_ABRT (Bitfield-Mask: 0x01)                     */
/* ====================================================  IC_CLR_RX_DONE  ===================================================== */
#define I2C0_IC_CLR_RX_DONE_CLR_RX_DONE_Pos (0UL)                   /*!< CLR_RX_DONE (Bit 0)                                   */
#define I2C0_IC_CLR_RX_DONE_CLR_RX_DONE_Msk (0x1UL)                 /*!< CLR_RX_DONE (Bitfield-Mask: 0x01)                     */
/* ====================================================  IC_CLR_ACTIVITY  ==================================================== */
#define I2C0_IC_CLR_ACTIVITY_CLR_ACTIVITY_Pos (0UL)                 /*!< CLR_ACTIVITY (Bit 0)                                  */
#define I2C0_IC_CLR_ACTIVITY_CLR_ACTIVITY_Msk (0x1UL)               /*!< CLR_ACTIVITY (Bitfield-Mask: 0x01)                    */
/* ====================================================  IC_CLR_STOP_DET  ==================================================== */
#define I2C0_IC_CLR_STOP_DET_CLR_STOP_DET_Pos (0UL)                 /*!< CLR_STOP_DET (Bit 0)                                  */
#define I2C0_IC_CLR_STOP_DET_CLR_STOP_DET_Msk (0x1UL)               /*!< CLR_STOP_DET (Bitfield-Mask: 0x01)                    */
/* ===================================================  IC_CLR_START_DET  ==================================================== */
#define I2C0_IC_CLR_START_DET_CLR_START_DET_Pos (0UL)               /*!< CLR_START_DET (Bit 0)                                 */
#define I2C0_IC_CLR_START_DET_CLR_START_DET_Msk (0x1UL)             /*!< CLR_START_DET (Bitfield-Mask: 0x01)                   */
/* ====================================================  IC_CLR_GEN_CALL  ==================================================== */
#define I2C0_IC_CLR_GEN_CALL_CLR_GEN_CALL_Pos (0UL)                 /*!< CLR_GEN_CALL (Bit 0)                                  */
#define I2C0_IC_CLR_GEN_CALL_CLR_GEN_CALL_Msk (0x1UL)               /*!< CLR_GEN_CALL (Bitfield-Mask: 0x01)                    */
/* =======================================================  IC_ENABLE  ======================================================= */
#define I2C0_IC_ENABLE_TX_CMD_BLOCK_Pos   (2UL)                     /*!< TX_CMD_BLOCK (Bit 2)                                  */
#define I2C0_IC_ENABLE_TX_CMD_BLOCK_Msk   (0x4UL)                   /*!< TX_CMD_BLOCK (Bitfield-Mask: 0x01)                    */
#define I2C0_IC_ENABLE_ABORT_Pos          (1UL)                     /*!< ABORT (Bit 1)                                         */
#define I2C0_IC_ENABLE_ABORT_Msk          (0x2UL)                   /*!< ABORT (Bitfield-Mask: 0x01)                           */
#define I2C0_IC_ENABLE_ENABLE_Pos         (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define I2C0_IC_ENABLE_ENABLE_Msk         (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* =======================================================  IC_STATUS  ======================================================= */
#define I2C0_IC_STATUS_SLV_ACTIVITY_Pos   (6UL)                     /*!< SLV_ACTIVITY (Bit 6)                                  */
#define I2C0_IC_STATUS_SLV_ACTIVITY_Msk   (0x40UL)                  /*!< SLV_ACTIVITY (Bitfield-Mask: 0x01)                    */
