mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define I2C0_IC_STATUS_MST_ACTIVITY_Pos   (5UL)                     /*!< MST_ACTIVITY (Bit 5)                                  */
#define I2C0_IC_STATUS_MST_ACTIVITY_Msk   (0x20UL)                  /*!< MST_ACTIVITY (Bitfield-Mask: 0x01)                    */
#define I2C0_IC_STATUS_RFF_Pos            (4UL)                     /*!< RFF (Bit 4)                                           */
#define I2C0_IC_STATUS_RFF_Msk            (0x10UL)                  /*!< RFF (Bitfield-Mask: 0x01)                             */
#define I2C0_IC_STATUS_RFNE_Pos           (3UL)                     /*!< RFNE (Bit 3)                                          */
#define I2C0_IC_STATUS_RFNE_Msk           (0x8UL)                   /*!< RFNE (Bitfield-Mask: 0x01)                            */
#define I2C0_IC_STATUS_TFE_Pos            (2UL)                     /*!< TFE (Bit 2)                                           */
#define I2C0_IC_STATUS_TFE_Msk            (0x4UL)                   /*!< TFE (Bitfield-Mask: 0x01)                             */
#define I2C0_IC_STATUS_TFNF_Pos           (1UL)                     /*!< TFNF (Bit 1)                                          */
#define I2C0_IC_STATUS_TFNF_Msk           (0x2UL)                   /*!< TFNF (Bitfield-Mask: 0x01)                            */
#define I2C0_IC_STATUS_ACTIVITY_Pos       (0UL)                     /*!< ACTIVITY (Bit 0)                                      */
#define I2C0_IC_STATUS_ACTIVITY_Msk       (0x1UL)                   /*!< ACTIVITY (Bitfield-Mask: 0x01)                        */
/* =======================================================  IC_TXFLR  ======================================================== */
#define I2C0_IC_TXFLR_TXFLR_Pos           (0UL)                     /*!< TXFLR (Bit 0)                                         */
#define I2C0_IC_TXFLR_TXFLR_Msk           (0x1fUL)                  /*!< TXFLR (Bitfield-Mask: 0x1f)                           */
/* =======================================================  IC_RXFLR  ======================================================== */
#define I2C0_IC_RXFLR_RXFLR_Pos           (0UL)                     /*!< RXFLR (Bit 0)                                         */
#define I2C0_IC_RXFLR_RXFLR_Msk           (0x1fUL)                  /*!< RXFLR (Bitfield-Mask: 0x1f)                           */
/* ======================================================  IC_SDA_HOLD  ====================================================== */
#define I2C0_IC_SDA_HOLD_IC_SDA_RX_HOLD_Pos (16UL)                  /*!< IC_SDA_RX_HOLD (Bit 16)                               */
#define I2C0_IC_SDA_HOLD_IC_SDA_RX_HOLD_Msk (0xff0000UL)            /*!< IC_SDA_RX_HOLD (Bitfield-Mask: 0xff)                  */
#define I2C0_IC_SDA_HOLD_IC_SDA_TX_HOLD_Pos (0UL)                   /*!< IC_SDA_TX_HOLD (Bit 0)                                */
#define I2C0_IC_SDA_HOLD_IC_SDA_TX_HOLD_Msk (0xffffUL)              /*!< IC_SDA_TX_HOLD (Bitfield-Mask: 0xffff)                */
/* ===================================================  IC_TX_ABRT_SOURCE  =================================================== */
#define I2C0_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_Pos (23UL)              /*!< TX_FLUSH_CNT (Bit 23)                                 */
#define I2C0_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_Msk (0xff800000UL)      /*!< TX_FLUSH_CNT (Bitfield-Mask: 0x1ff)                   */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_Pos (16UL)            /*!< ABRT_USER_ABRT (Bit 16)                               */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_Msk (0x10000UL)       /*!< ABRT_USER_ABRT (Bitfield-Mask: 0x01)                  */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_Pos (15UL)           /*!< ABRT_SLVRD_INTX (Bit 15)                              */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_Msk (0x8000UL)       /*!< ABRT_SLVRD_INTX (Bitfield-Mask: 0x01)                 */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_Pos (14UL)          /*!< ABRT_SLV_ARBLOST (Bit 14)                             */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_Msk (0x4000UL)      /*!< ABRT_SLV_ARBLOST (Bitfield-Mask: 0x01)                */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_Pos (13UL)      /*!< ABRT_SLVFLUSH_TXFIFO (Bit 13)                         */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_Msk (0x2000UL)  /*!< ABRT_SLVFLUSH_TXFIFO (Bitfield-Mask: 0x01)            */
#define I2C0_IC_TX_ABRT_SOURCE_ARB_LOST_Pos (12UL)                  /*!< ARB_LOST (Bit 12)                                     */
#define I2C0_IC_TX_ABRT_SOURCE_ARB_LOST_Msk (0x1000UL)              /*!< ARB_LOST (Bitfield-Mask: 0x01)                        */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_Pos (11UL)           /*!< ABRT_MASTER_DIS (Bit 11)                              */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_Msk (0x800UL)        /*!< ABRT_MASTER_DIS (Bitfield-Mask: 0x01)                 */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_Pos (10UL)       /*!< ABRT_10B_RD_NORSTRT (Bit 10)                          */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_Msk (0x400UL)    /*!< ABRT_10B_RD_NORSTRT (Bitfield-Mask: 0x01)             */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_Pos (9UL)         /*!< ABRT_SBYTE_NORSTRT (Bit 9)                            */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_Msk (0x200UL)     /*!< ABRT_SBYTE_NORSTRT (Bitfield-Mask: 0x01)              */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_Pos (8UL)            /*!< ABRT_HS_NORSTRT (Bit 8)                               */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_Msk (0x100UL)        /*!< ABRT_HS_NORSTRT (Bitfield-Mask: 0x01)                 */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_Pos (7UL)          /*!< ABRT_SBYTE_ACKDET (Bit 7)                             */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_Msk (0x80UL)       /*!< ABRT_SBYTE_ACKDET (Bitfield-Mask: 0x01)               */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_Pos (6UL)             /*!< ABRT_HS_ACKDET (Bit 6)                                */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_Msk (0x40UL)          /*!< ABRT_HS_ACKDET (Bitfield-Mask: 0x01)                  */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_Pos (5UL)            /*!< ABRT_GCALL_READ (Bit 5)                               */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_Msk (0x20UL)         /*!< ABRT_GCALL_READ (Bitfield-Mask: 0x01)                 */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_Pos (4UL)           /*!< ABRT_GCALL_NOACK (Bit 4)                              */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_Msk (0x10UL)        /*!< ABRT_GCALL_NOACK (Bitfield-Mask: 0x01)                */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_Pos (3UL)          /*!< ABRT_TXDATA_NOACK (Bit 3)                             */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_Msk (0x8UL)        /*!< ABRT_TXDATA_NOACK (Bitfield-Mask: 0x01)               */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_Pos (2UL)         /*!< ABRT_10ADDR2_NOACK (Bit 2)                            */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_Msk (0x4UL)       /*!< ABRT_10ADDR2_NOACK (Bitfield-Mask: 0x01)              */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_Pos (1UL)         /*!< ABRT_10ADDR1_NOACK (Bit 1)                            */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_Msk (0x2UL)       /*!< ABRT_10ADDR1_NOACK (Bitfield-Mask: 0x01)              */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_Pos (0UL)         /*!< ABRT_7B_ADDR_NOACK (Bit 0)                            */
#define I2C0_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_Msk (0x1UL)       /*!< ABRT_7B_ADDR_NOACK (Bitfield-Mask: 0x01)              */
/* =================================================  IC_SLV_DATA_NACK_ONLY  ================================================= */
#define I2C0_IC_SLV_DATA_NACK_ONLY_NACK_Pos (0UL)                   /*!< NACK (Bit 0)                                          */
#define I2C0_IC_SLV_DATA_NACK_ONLY_NACK_Msk (0x1UL)                 /*!< NACK (Bitfield-Mask: 0x01)                            */
/* =======================================================  IC_DMA_CR  ======================================================= */
#define I2C0_IC_DMA_CR_TDMAE_Pos          (1UL)                     /*!< TDMAE (Bit 1)                                         */
#define I2C0_IC_DMA_CR_TDMAE_Msk          (0x2UL)                   /*!< TDMAE (Bitfield-Mask: 0x01)                           */
#define I2C0_IC_DMA_CR_RDMAE_Pos          (0UL)                     /*!< RDMAE (Bit 0)                                         */
#define I2C0_IC_DMA_CR_RDMAE_Msk          (0x1UL)                   /*!< RDMAE (Bitfield-Mask: 0x01)                           */
/* ======================================================  IC_DMA_TDLR  ====================================================== */
#define I2C0_IC_DMA_TDLR_DMATDL_Pos       (0UL)                     /*!< DMATDL (Bit 0)                                        */
#define I2C0_IC_DMA_TDLR_DMATDL_Msk       (0xfUL)                   /*!< DMATDL (Bitfield-Mask: 0x0f)                          */
/* ======================================================  IC_DMA_RDLR  ====================================================== */
#define I2C0_IC_DMA_RDLR_DMARDL_Pos       (0UL)                     /*!< DMARDL (Bit 0)                                        */
#define I2C0_IC_DMA_RDLR_DMARDL_Msk       (0xfUL)                   /*!< DMARDL (Bitfield-Mask: 0x0f)                          */
/* =====================================================  IC_SDA_SETUP  ====================================================== */
#define I2C0_IC_SDA_SETUP_SDA_SETUP_Pos   (0UL)                     /*!< SDA_SETUP (Bit 0)                                     */
#define I2C0_IC_SDA_SETUP_SDA_SETUP_Msk   (0xffUL)                  /*!< SDA_SETUP (Bitfield-Mask: 0xff)                       */
/* ==================================================  IC_ACK_GENERAL_CALL  ================================================== */
#define I2C0_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_Pos (0UL)             /*!< ACK_GEN_CALL (Bit 0)                                  */
#define I2C0_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_Msk (0x1UL)           /*!< ACK_GEN_CALL (Bitfield-Mask: 0x01)                    */
/* ===================================================  IC_ENABLE_STATUS  ==================================================== */
#define I2C0_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_Pos (2UL)            /*!< SLV_RX_DATA_LOST (Bit 2)                              */
#define I2C0_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_Msk (0x4UL)          /*!< SLV_RX_DATA_LOST (Bitfield-Mask: 0x01)                */
#define I2C0_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_Pos (1UL)     /*!< SLV_DISABLED_WHILE_BUSY (Bit 1)                       */
#define I2C0_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_Msk (0x2UL)   /*!< SLV_DISABLED_WHILE_BUSY (Bitfield-Mask: 0x01)         */
#define I2C0_IC_ENABLE_STATUS_IC_EN_Pos   (0UL)                     /*!< IC_EN (Bit 0)                                         */
#define I2C0_IC_ENABLE_STATUS_IC_EN_Msk   (0x1UL)                   /*!< IC_EN (Bitfield-Mask: 0x01)                           */
/* =====================================================  IC_FS_SPKLEN  ====================================================== */
#define I2C0_IC_FS_SPKLEN_IC_FS_SPKLEN_Pos (0UL)                    /*!< IC_FS_SPKLEN (Bit 0)                                  */
#define I2C0_IC_FS_SPKLEN_IC_FS_SPKLEN_Msk (0xffUL)                 /*!< IC_FS_SPKLEN (Bitfield-Mask: 0xff)                    */
/* ==================================================  IC_CLR_RESTART_DET  =================================================== */
#define I2C0_IC_CLR_RESTART_DET_CLR_RESTART_DET_Pos (0UL)           /*!< CLR_RESTART_DET (Bit 0)                               */
#define I2C0_IC_CLR_RESTART_DET_CLR_RESTART_DET_Msk (0x1UL)         /*!< CLR_RESTART_DET (Bitfield-Mask: 0x01)                 */
/* ====================================================  IC_COMP_PARAM_1  ==================================================== */
#define I2C0_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_Pos (16UL)             /*!< TX_BUFFER_DEPTH (Bit 16)                              */
#define I2C0_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_Msk (0xff0000UL)       /*!< TX_BUFFER_DEPTH (Bitfield-Mask: 0xff)                 */
#define I2C0_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_Pos (8UL)              /*!< RX_BUFFER_DEPTH (Bit 8)                               */
#define I2C0_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_Msk (0xff00UL)         /*!< RX_BUFFER_DEPTH (Bitfield-Mask: 0xff)                 */
#define I2C0_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_Pos (7UL)           /*!< ADD_ENCODED_PARAMS (Bit 7)                            */
#define I2C0_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_Msk (0x80UL)        /*!< ADD_ENCODED_PARAMS (Bitfield-Mask: 0x01)              */
#define I2C0_IC_COMP_PARAM_1_HAS_DMA_Pos  (6UL)                     /*!< HAS_DMA (Bit 6)                                       */
#define I2C0_IC_COMP_PARAM_1_HAS_DMA_Msk  (0x40UL)                  /*!< HAS_DMA (Bitfield-Mask: 0x01)                         */
#define I2C0_IC_COMP_PARAM_1_INTR_IO_Pos  (5UL)                     /*!< INTR_IO (Bit 5)                                       */
#define I2C0_IC_COMP_PARAM_1_INTR_IO_Msk  (0x20UL)                  /*!< INTR_IO (Bitfield-Mask: 0x01)                         */
#define I2C0_IC_COMP_PARAM_1_HC_COUNT_VALUES_Pos (4UL)              /*!< HC_COUNT_VALUES (Bit 4)                               */
#define I2C0_IC_COMP_PARAM_1_HC_COUNT_VALUES_Msk (0x10UL)           /*!< HC_COUNT_VALUES (Bitfield-Mask: 0x01)                 */
#define I2C0_IC_COMP_PARAM_1_MAX_SPEED_MODE_Pos (2UL)               /*!< MAX_SPEED_MODE (Bit 2)                                */
#define I2C0_IC_COMP_PARAM_1_MAX_SPEED_MODE_Msk (0xcUL)             /*!< MAX_SPEED_MODE (Bitfield-Mask: 0x03)                  */
#define I2C0_IC_COMP_PARAM_1_APB_DATA_WIDTH_Pos (0UL)               /*!< APB_DATA_WIDTH (Bit 0)                                */
#define I2C0_IC_COMP_PARAM_1_APB_DATA_WIDTH_Msk (0x3UL)             /*!< APB_DATA_WIDTH (Bitfield-Mask: 0x03)                  */
/* ====================================================  IC_COMP_VERSION  ==================================================== */
#define I2C0_IC_COMP_VERSION_IC_COMP_VERSION_Pos (0UL)              /*!< IC_COMP_VERSION (Bit 0)                               */
#define I2C0_IC_COMP_VERSION_IC_COMP_VERSION_Msk (0xffffffffUL)     /*!< IC_COMP_VERSION (Bitfield-Mask: 0xffffffff)           */
/* =====================================================  IC_COMP_TYPE  ====================================================== */
#define I2C0_IC_COMP_TYPE_IC_COMP_TYPE_Pos (0UL)                    /*!< IC_COMP_TYPE (Bit 0)                                  */
#define I2C0_IC_COMP_TYPE_IC_COMP_TYPE_Msk (0xffffffffUL)           /*!< IC_COMP_TYPE (Bitfield-Mask: 0xffffffff)              */


/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CS  =========================================================== */
#define ADC_CS_RROBIN_Pos                 (16UL)                    /*!< RROBIN (Bit 16)                                       */
#define ADC_CS_RROBIN_Msk                 (0x1f0000UL)              /*!< RROBIN (Bitfield-Mask: 0x1f)                          */
#define ADC_CS_AINSEL_Pos                 (12UL)                    /*!< AINSEL (Bit 12)                                       */
#define ADC_CS_AINSEL_Msk                 (0x7000UL)                /*!< AINSEL (Bitfield-Mask: 0x07)                          */
#define ADC_CS_ERR_STICKY_Pos             (10UL)                    /*!< ERR_STICKY (Bit 10)                                   */
#define ADC_CS_ERR_STICKY_Msk             (0x400UL)                 /*!< ERR_STICKY (Bitfield-Mask: 0x01)                      */
#define ADC_CS_ERR_Pos                    (9UL)                     /*!< ERR (Bit 9)                                           */
#define ADC_CS_ERR_Msk                    (0x200UL)                 /*!< ERR (Bitfield-Mask: 0x01)                             */
#define ADC_CS_READY_Pos                  (8UL)                     /*!< READY (Bit 8)                                         */
#define ADC_CS_READY_Msk                  (0x100UL)                 /*!< READY (Bitfield-Mask: 0x01)                           */
#define ADC_CS_START_MANY_Pos             (3UL)                     /*!< START_MANY (Bit 3)                                    */
#define ADC_CS_START_MANY_Msk             (0x8UL)                   /*!< START_MANY (Bitfield-Mask: 0x01)                      */
#define ADC_CS_START_ONCE_Pos             (2UL)                     /*!< START_ONCE (Bit 2)                                    */
#define ADC_CS_START_ONCE_Msk             (0x4UL)                   /*!< START_ONCE (Bitfield-Mask: 0x01)                      */
#define ADC_CS_TS_EN_Pos                  (1UL)                     /*!< TS_EN (Bit 1)                                         */
#define ADC_CS_TS_EN_Msk                  (0x2UL)                   /*!< TS_EN (Bitfield-Mask: 0x01)                           */
#define ADC_CS_EN_Pos                     (0UL)                     /*!< EN (Bit 0)                                            */
#define ADC_CS_EN_Msk                     (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  RESULT  ========================================================= */
#define ADC_RESULT_RESULT_Pos             (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT_RESULT_Msk             (0xfffUL)                 /*!< RESULT (Bitfield-Mask: 0xfff)                         */
/* ==========================================================  FCS  ========================================================== */
#define ADC_FCS_THRESH_Pos                (24UL)                    /*!< THRESH (Bit 24)                                       */
#define ADC_FCS_THRESH_Msk                (0xf000000UL)             /*!< THRESH (Bitfield-Mask: 0x0f)                          */
#define ADC_FCS_LEVEL_Pos                 (16UL)                    /*!< LEVEL (Bit 16)                                        */
#define ADC_FCS_LEVEL_Msk                 (0xf0000UL)               /*!< LEVEL (Bitfield-Mask: 0x0f)                           */
#define ADC_FCS_OVER_Pos                  (11UL)                    /*!< OVER (Bit 11)                                         */
#define ADC_FCS_OVER_Msk                  (0x800UL)                 /*!< OVER (Bitfield-Mask: 0x01)                            */
#define ADC_FCS_UNDER_Pos                 (10UL)                    /*!< UNDER (Bit 10)                                        */
#define ADC_FCS_UNDER_Msk                 (0x400UL)                 /*!< UNDER (Bitfield-Mask: 0x01)                           */
#define ADC_FCS_FULL_Pos                  (9UL)                     /*!< FULL (Bit 9)                                          */
#define ADC_FCS_FULL_Msk                  (0x200UL)                 /*!< FULL (Bitfield-Mask: 0x01)                            */
#define ADC_FCS_EMPTY_Pos                 (8UL)                     /*!< EMPTY (Bit 8)                                         */
#define ADC_FCS_EMPTY_Msk                 (0x100UL)                 /*!< EMPTY (Bitfield-Mask: 0x01)                           */
#define ADC_FCS_DREQ_EN_Pos               (3UL)                     /*!< DREQ_EN (Bit 3)                                       */
#define ADC_FCS_DREQ_EN_Msk               (0x8UL)                   /*!< DREQ_EN (Bitfield-Mask: 0x01)                         */
#define ADC_FCS_ERR_Pos                   (2UL)                     /*!< ERR (Bit 2)                                           */
#define ADC_FCS_ERR_Msk                   (0x4UL)                   /*!< ERR (Bitfield-Mask: 0x01)                             */
#define ADC_FCS_SHIFT_Pos                 (1UL)                     /*!< SHIFT (Bit 1)                                         */
#define ADC_FCS_SHIFT_Msk                 (0x2UL)                   /*!< SHIFT (Bitfield-Mask: 0x01)                           */
#define ADC_FCS_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                            */
#define ADC_FCS_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  FIFO  ========================================================== */
#define ADC_FIFO_ERR_Pos                  (15UL)                    /*!< ERR (Bit 15)                                          */
#define ADC_FIFO_ERR_Msk                  (0x8000UL)                /*!< ERR (Bitfield-Mask: 0x01)                             */
#define ADC_FIFO_VAL_Pos                  (0UL)                     /*!< VAL (Bit 0)                                           */
#define ADC_FIFO_VAL_Msk                  (0xfffUL)                 /*!< VAL (Bitfield-Mask: 0xfff)                            */
/* ==========================================================  DIV  ========================================================== */
#define ADC_DIV_INT_Pos                   (8UL)                     /*!< INT (Bit 8)                                           */
#define ADC_DIV_INT_Msk                   (0xffff00UL)              /*!< INT (Bitfield-Mask: 0xffff)                           */
#define ADC_DIV_FRAC_Pos                  (0UL)                     /*!< FRAC (Bit 0)                                          */
#define ADC_DIV_FRAC_Msk                  (0xffUL)                  /*!< FRAC (Bitfield-Mask: 0xff)                            */
/* =========================================================  INTR  ========================================================== */
#define ADC_INTR_FIFO_Pos                 (0UL)                     /*!< FIFO (Bit 0)                                          */
#define ADC_INTR_FIFO_Msk                 (0x1UL)                   /*!< FIFO (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTE  ========================================================== */
#define ADC_INTE_FIFO_Pos                 (0UL)                     /*!< FIFO (Bit 0)                                          */
#define ADC_INTE_FIFO_Msk                 (0x1UL)                   /*!< FIFO (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTF  ========================================================== */
#define ADC_INTF_FIFO_Pos                 (0UL)                     /*!< FIFO (Bit 0)                                          */
#define ADC_INTF_FIFO_Msk                 (0x1UL)                   /*!< FIFO (Bitfield-Mask: 0x01)                            */
/* =========================================================  INTS  ========================================================== */
#define ADC_INTS_FIFO_Pos                 (0UL)                     /*!< FIFO (Bit 0)                                          */
#define ADC_INTS_FIFO_Msk                 (0x1UL)                   /*!< FIFO (Bitfield-Mask: 0x01)                            */


