mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =========================================================================================================================== */
/* ================                                            PWM                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  CH0_CSR  ======================================================== */
#define PWM_CH0_CSR_PH_ADV_Pos            (7UL)                     /*!< PH_ADV (Bit 7)                                        */
#define PWM_CH0_CSR_PH_ADV_Msk            (0x80UL)                  /*!< PH_ADV (Bitfield-Mask: 0x01)                          */
#define PWM_CH0_CSR_PH_RET_Pos            (6UL)                     /*!< PH_RET (Bit 6)                                        */
#define PWM_CH0_CSR_PH_RET_Msk            (0x40UL)                  /*!< PH_RET (Bitfield-Mask: 0x01)                          */
#define PWM_CH0_CSR_DIVMODE_Pos           (4UL)                     /*!< DIVMODE (Bit 4)                                       */
#define PWM_CH0_CSR_DIVMODE_Msk           (0x30UL)                  /*!< DIVMODE (Bitfield-Mask: 0x03)                         */
#define PWM_CH0_CSR_B_INV_Pos             (3UL)                     /*!< B_INV (Bit 3)                                         */
#define PWM_CH0_CSR_B_INV_Msk             (0x8UL)                   /*!< B_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH0_CSR_A_INV_Pos             (2UL)                     /*!< A_INV (Bit 2)                                         */
#define PWM_CH0_CSR_A_INV_Msk             (0x4UL)                   /*!< A_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH0_CSR_PH_CORRECT_Pos        (1UL)                     /*!< PH_CORRECT (Bit 1)                                    */
#define PWM_CH0_CSR_PH_CORRECT_Msk        (0x2UL)                   /*!< PH_CORRECT (Bitfield-Mask: 0x01)                      */
#define PWM_CH0_CSR_EN_Pos                (0UL)                     /*!< EN (Bit 0)                                            */
#define PWM_CH0_CSR_EN_Msk                (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  CH0_DIV  ======================================================== */
#define PWM_CH0_DIV_INT_Pos               (4UL)                     /*!< INT (Bit 4)                                           */
#define PWM_CH0_DIV_INT_Msk               (0xff0UL)                 /*!< INT (Bitfield-Mask: 0xff)                             */
#define PWM_CH0_DIV_FRAC_Pos              (0UL)                     /*!< FRAC (Bit 0)                                          */
#define PWM_CH0_DIV_FRAC_Msk              (0xfUL)                   /*!< FRAC (Bitfield-Mask: 0x0f)                            */
/* ========================================================  CH0_CTR  ======================================================== */
#define PWM_CH0_CTR_CH0_CTR_Pos           (0UL)                     /*!< CH0_CTR (Bit 0)                                       */
#define PWM_CH0_CTR_CH0_CTR_Msk           (0xffffUL)                /*!< CH0_CTR (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH0_CC  ========================================================= */
#define PWM_CH0_CC_B_Pos                  (16UL)                    /*!< B (Bit 16)                                            */
#define PWM_CH0_CC_B_Msk                  (0xffff0000UL)            /*!< B (Bitfield-Mask: 0xffff)                             */
#define PWM_CH0_CC_A_Pos                  (0UL)                     /*!< A (Bit 0)                                             */
#define PWM_CH0_CC_A_Msk                  (0xffffUL)                /*!< A (Bitfield-Mask: 0xffff)                             */
/* ========================================================  CH0_TOP  ======================================================== */
#define PWM_CH0_TOP_CH0_TOP_Pos           (0UL)                     /*!< CH0_TOP (Bit 0)                                       */
#define PWM_CH0_TOP_CH0_TOP_Msk           (0xffffUL)                /*!< CH0_TOP (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH1_CSR  ======================================================== */
#define PWM_CH1_CSR_PH_ADV_Pos            (7UL)                     /*!< PH_ADV (Bit 7)                                        */
#define PWM_CH1_CSR_PH_ADV_Msk            (0x80UL)                  /*!< PH_ADV (Bitfield-Mask: 0x01)                          */
#define PWM_CH1_CSR_PH_RET_Pos            (6UL)                     /*!< PH_RET (Bit 6)                                        */
#define PWM_CH1_CSR_PH_RET_Msk            (0x40UL)                  /*!< PH_RET (Bitfield-Mask: 0x01)                          */
#define PWM_CH1_CSR_DIVMODE_Pos           (4UL)                     /*!< DIVMODE (Bit 4)                                       */
#define PWM_CH1_CSR_DIVMODE_Msk           (0x30UL)                  /*!< DIVMODE (Bitfield-Mask: 0x03)                         */
#define PWM_CH1_CSR_B_INV_Pos             (3UL)                     /*!< B_INV (Bit 3)                                         */
#define PWM_CH1_CSR_B_INV_Msk             (0x8UL)                   /*!< B_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH1_CSR_A_INV_Pos             (2UL)                     /*!< A_INV (Bit 2)                                         */
#define PWM_CH1_CSR_A_INV_Msk             (0x4UL)                   /*!< A_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH1_CSR_PH_CORRECT_Pos        (1UL)                     /*!< PH_CORRECT (Bit 1)                                    */
#define PWM_CH1_CSR_PH_CORRECT_Msk        (0x2UL)                   /*!< PH_CORRECT (Bitfield-Mask: 0x01)                      */
#define PWM_CH1_CSR_EN_Pos                (0UL)                     /*!< EN (Bit 0)                                            */
#define PWM_CH1_CSR_EN_Msk                (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  CH1_DIV  ======================================================== */
#define PWM_CH1_DIV_INT_Pos               (4UL)                     /*!< INT (Bit 4)                                           */
#define PWM_CH1_DIV_INT_Msk               (0xff0UL)                 /*!< INT (Bitfield-Mask: 0xff)                             */
#define PWM_CH1_DIV_FRAC_Pos              (0UL)                     /*!< FRAC (Bit 0)                                          */
#define PWM_CH1_DIV_FRAC_Msk              (0xfUL)                   /*!< FRAC (Bitfield-Mask: 0x0f)                            */
/* ========================================================  CH1_CTR  ======================================================== */
#define PWM_CH1_CTR_CH1_CTR_Pos           (0UL)                     /*!< CH1_CTR (Bit 0)                                       */
#define PWM_CH1_CTR_CH1_CTR_Msk           (0xffffUL)                /*!< CH1_CTR (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH1_CC  ========================================================= */
#define PWM_CH1_CC_B_Pos                  (16UL)                    /*!< B (Bit 16)                                            */
#define PWM_CH1_CC_B_Msk                  (0xffff0000UL)            /*!< B (Bitfield-Mask: 0xffff)                             */
#define PWM_CH1_CC_A_Pos                  (0UL)                     /*!< A (Bit 0)                                             */
#define PWM_CH1_CC_A_Msk                  (0xffffUL)                /*!< A (Bitfield-Mask: 0xffff)                             */
/* ========================================================  CH1_TOP  ======================================================== */
#define PWM_CH1_TOP_CH1_TOP_Pos           (0UL)                     /*!< CH1_TOP (Bit 0)                                       */
#define PWM_CH1_TOP_CH1_TOP_Msk           (0xffffUL)                /*!< CH1_TOP (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH2_CSR  ======================================================== */
#define PWM_CH2_CSR_PH_ADV_Pos            (7UL)                     /*!< PH_ADV (Bit 7)                                        */
#define PWM_CH2_CSR_PH_ADV_Msk            (0x80UL)                  /*!< PH_ADV (Bitfield-Mask: 0x01)                          */
#define PWM_CH2_CSR_PH_RET_Pos            (6UL)                     /*!< PH_RET (Bit 6)                                        */
#define PWM_CH2_CSR_PH_RET_Msk            (0x40UL)                  /*!< PH_RET (Bitfield-Mask: 0x01)                          */
#define PWM_CH2_CSR_DIVMODE_Pos           (4UL)                     /*!< DIVMODE (Bit 4)                                       */
#define PWM_CH2_CSR_DIVMODE_Msk           (0x30UL)                  /*!< DIVMODE (Bitfield-Mask: 0x03)                         */
#define PWM_CH2_CSR_B_INV_Pos             (3UL)                     /*!< B_INV (Bit 3)                                         */
#define PWM_CH2_CSR_B_INV_Msk             (0x8UL)                   /*!< B_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH2_CSR_A_INV_Pos             (2UL)                     /*!< A_INV (Bit 2)                                         */
#define PWM_CH2_CSR_A_INV_Msk             (0x4UL)                   /*!< A_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH2_CSR_PH_CORRECT_Pos        (1UL)                     /*!< PH_CORRECT (Bit 1)                                    */
#define PWM_CH2_CSR_PH_CORRECT_Msk        (0x2UL)                   /*!< PH_CORRECT (Bitfield-Mask: 0x01)                      */
#define PWM_CH2_CSR_EN_Pos                (0UL)                     /*!< EN (Bit 0)                                            */
#define PWM_CH2_CSR_EN_Msk                (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  CH2_DIV  ======================================================== */
#define PWM_CH2_DIV_INT_Pos               (4UL)                     /*!< INT (Bit 4)                                           */
#define PWM_CH2_DIV_INT_Msk               (0xff0UL)                 /*!< INT (Bitfield-Mask: 0xff)                             */
#define PWM_CH2_DIV_FRAC_Pos              (0UL)                     /*!< FRAC (Bit 0)                                          */
#define PWM_CH2_DIV_FRAC_Msk              (0xfUL)                   /*!< FRAC (Bitfield-Mask: 0x0f)                            */
/* ========================================================  CH2_CTR  ======================================================== */
#define PWM_CH2_CTR_CH2_CTR_Pos           (0UL)                     /*!< CH2_CTR (Bit 0)                                       */
#define PWM_CH2_CTR_CH2_CTR_Msk           (0xffffUL)                /*!< CH2_CTR (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH2_CC  ========================================================= */
#define PWM_CH2_CC_B_Pos                  (16UL)                    /*!< B (Bit 16)                                            */
#define PWM_CH2_CC_B_Msk                  (0xffff0000UL)            /*!< B (Bitfield-Mask: 0xffff)                             */
#define PWM_CH2_CC_A_Pos                  (0UL)                     /*!< A (Bit 0)                                             */
#define PWM_CH2_CC_A_Msk                  (0xffffUL)                /*!< A (Bitfield-Mask: 0xffff)                             */
/* ========================================================  CH2_TOP  ======================================================== */
#define PWM_CH2_TOP_CH2_TOP_Pos           (0UL)                     /*!< CH2_TOP (Bit 0)                                       */
#define PWM_CH2_TOP_CH2_TOP_Msk           (0xffffUL)                /*!< CH2_TOP (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH3_CSR  ======================================================== */
#define PWM_CH3_CSR_PH_ADV_Pos            (7UL)                     /*!< PH_ADV (Bit 7)                                        */
#define PWM_CH3_CSR_PH_ADV_Msk            (0x80UL)                  /*!< PH_ADV (Bitfield-Mask: 0x01)                          */
#define PWM_CH3_CSR_PH_RET_Pos            (6UL)                     /*!< PH_RET (Bit 6)                                        */
#define PWM_CH3_CSR_PH_RET_Msk            (0x40UL)                  /*!< PH_RET (Bitfield-Mask: 0x01)                          */
#define PWM_CH3_CSR_DIVMODE_Pos           (4UL)                     /*!< DIVMODE (Bit 4)                                       */
#define PWM_CH3_CSR_DIVMODE_Msk           (0x30UL)                  /*!< DIVMODE (Bitfield-Mask: 0x03)                         */
#define PWM_CH3_CSR_B_INV_Pos             (3UL)                     /*!< B_INV (Bit 3)                                         */
#define PWM_CH3_CSR_B_INV_Msk             (0x8UL)                   /*!< B_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH3_CSR_A_INV_Pos             (2UL)                     /*!< A_INV (Bit 2)                                         */
#define PWM_CH3_CSR_A_INV_Msk             (0x4UL)                   /*!< A_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH3_CSR_PH_CORRECT_Pos        (1UL)                     /*!< PH_CORRECT (Bit 1)                                    */
#define PWM_CH3_CSR_PH_CORRECT_Msk        (0x2UL)                   /*!< PH_CORRECT (Bitfield-Mask: 0x01)                      */
#define PWM_CH3_CSR_EN_Pos                (0UL)                     /*!< EN (Bit 0)                                            */
#define PWM_CH3_CSR_EN_Msk                (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  CH3_DIV  ======================================================== */
#define PWM_CH3_DIV_INT_Pos               (4UL)                     /*!< INT (Bit 4)                                           */
#define PWM_CH3_DIV_INT_Msk               (0xff0UL)                 /*!< INT (Bitfield-Mask: 0xff)                             */
#define PWM_CH3_DIV_FRAC_Pos              (0UL)                     /*!< FRAC (Bit 0)                                          */
#define PWM_CH3_DIV_FRAC_Msk              (0xfUL)                   /*!< FRAC (Bitfield-Mask: 0x0f)                            */
/* ========================================================  CH3_CTR  ======================================================== */
#define PWM_CH3_CTR_CH3_CTR_Pos           (0UL)                     /*!< CH3_CTR (Bit 0)                                       */
#define PWM_CH3_CTR_CH3_CTR_Msk           (0xffffUL)                /*!< CH3_CTR (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH3_CC  ========================================================= */
#define PWM_CH3_CC_B_Pos                  (16UL)                    /*!< B (Bit 16)                                            */
#define PWM_CH3_CC_B_Msk                  (0xffff0000UL)            /*!< B (Bitfield-Mask: 0xffff)                             */
#define PWM_CH3_CC_A_Pos                  (0UL)                     /*!< A (Bit 0)                                             */
#define PWM_CH3_CC_A_Msk                  (0xffffUL)                /*!< A (Bitfield-Mask: 0xffff)                             */
/* ========================================================  CH3_TOP  ======================================================== */
#define PWM_CH3_TOP_CH3_TOP_Pos           (0UL)                     /*!< CH3_TOP (Bit 0)                                       */
#define PWM_CH3_TOP_CH3_TOP_Msk           (0xffffUL)                /*!< CH3_TOP (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH4_CSR  ======================================================== */
#define PWM_CH4_CSR_PH_ADV_Pos            (7UL)                     /*!< PH_ADV (Bit 7)                                        */
#define PWM_CH4_CSR_PH_ADV_Msk            (0x80UL)                  /*!< PH_ADV (Bitfield-Mask: 0x01)                          */
#define PWM_CH4_CSR_PH_RET_Pos            (6UL)                     /*!< PH_RET (Bit 6)                                        */
#define PWM_CH4_CSR_PH_RET_Msk            (0x40UL)                  /*!< PH_RET (Bitfield-Mask: 0x01)                          */
#define PWM_CH4_CSR_DIVMODE_Pos           (4UL)                     /*!< DIVMODE (Bit 4)                                       */
#define PWM_CH4_CSR_DIVMODE_Msk           (0x30UL)                  /*!< DIVMODE (Bitfield-Mask: 0x03)                         */
#define PWM_CH4_CSR_B_INV_Pos             (3UL)                     /*!< B_INV (Bit 3)                                         */
#define PWM_CH4_CSR_B_INV_Msk             (0x8UL)                   /*!< B_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH4_CSR_A_INV_Pos             (2UL)                     /*!< A_INV (Bit 2)                                         */
#define PWM_CH4_CSR_A_INV_Msk             (0x4UL)                   /*!< A_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH4_CSR_PH_CORRECT_Pos        (1UL)                     /*!< PH_CORRECT (Bit 1)                                    */
#define PWM_CH4_CSR_PH_CORRECT_Msk        (0x2UL)                   /*!< PH_CORRECT (Bitfield-Mask: 0x01)                      */
#define PWM_CH4_CSR_EN_Pos                (0UL)                     /*!< EN (Bit 0)                                            */
#define PWM_CH4_CSR_EN_Msk                (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  CH4_DIV  ======================================================== */
#define PWM_CH4_DIV_INT_Pos               (4UL)                     /*!< INT (Bit 4)                                           */
#define PWM_CH4_DIV_INT_Msk               (0xff0UL)                 /*!< INT (Bitfield-Mask: 0xff)                             */
#define PWM_CH4_DIV_FRAC_Pos              (0UL)                     /*!< FRAC (Bit 0)                                          */
#define PWM_CH4_DIV_FRAC_Msk              (0xfUL)                   /*!< FRAC (Bitfield-Mask: 0x0f)                            */
/* ========================================================  CH4_CTR  ======================================================== */
#define PWM_CH4_CTR_CH4_CTR_Pos           (0UL)                     /*!< CH4_CTR (Bit 0)                                       */
#define PWM_CH4_CTR_CH4_CTR_Msk           (0xffffUL)                /*!< CH4_CTR (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH4_CC  ========================================================= */
#define PWM_CH4_CC_B_Pos                  (16UL)                    /*!< B (Bit 16)                                            */
#define PWM_CH4_CC_B_Msk                  (0xffff0000UL)            /*!< B (Bitfield-Mask: 0xffff)                             */
#define PWM_CH4_CC_A_Pos                  (0UL)                     /*!< A (Bit 0)                                             */
#define PWM_CH4_CC_A_Msk                  (0xffffUL)                /*!< A (Bitfield-Mask: 0xffff)                             */
/* ========================================================  CH4_TOP  ======================================================== */
#define PWM_CH4_TOP_CH4_TOP_Pos           (0UL)                     /*!< CH4_TOP (Bit 0)                                       */
#define PWM_CH4_TOP_CH4_TOP_Msk           (0xffffUL)                /*!< CH4_TOP (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH5_CSR  ======================================================== */
#define PWM_CH5_CSR_PH_ADV_Pos            (7UL)                     /*!< PH_ADV (Bit 7)                                        */
#define PWM_CH5_CSR_PH_ADV_Msk            (0x80UL)                  /*!< PH_ADV (Bitfield-Mask: 0x01)                          */
#define PWM_CH5_CSR_PH_RET_Pos            (6UL)                     /*!< PH_RET (Bit 6)                                        */
#define PWM_CH5_CSR_PH_RET_Msk            (0x40UL)                  /*!< PH_RET (Bitfield-Mask: 0x01)                          */
#define PWM_CH5_CSR_DIVMODE_Pos           (4UL)                     /*!< DIVMODE (Bit 4)                                       */
#define PWM_CH5_CSR_DIVMODE_Msk           (0x30UL)                  /*!< DIVMODE (Bitfield-Mask: 0x03)                         */
#define PWM_CH5_CSR_B_INV_Pos             (3UL)                     /*!< B_INV (Bit 3)                                         */
#define PWM_CH5_CSR_B_INV_Msk             (0x8UL)                   /*!< B_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH5_CSR_A_INV_Pos             (2UL)                     /*!< A_INV (Bit 2)                                         */
#define PWM_CH5_CSR_A_INV_Msk             (0x4UL)                   /*!< A_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH5_CSR_PH_CORRECT_Pos        (1UL)                     /*!< PH_CORRECT (Bit 1)                                    */
#define PWM_CH5_CSR_PH_CORRECT_Msk        (0x2UL)                   /*!< PH_CORRECT (Bitfield-Mask: 0x01)                      */
#define PWM_CH5_CSR_EN_Pos                (0UL)                     /*!< EN (Bit 0)                                            */
#define PWM_CH5_CSR_EN_Msk                (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  CH5_DIV  ======================================================== */
#define PWM_CH5_DIV_INT_Pos               (4UL)                     /*!< INT (Bit 4)                                           */
#define PWM_CH5_DIV_INT_Msk               (0xff0UL)                 /*!< INT (Bitfield-Mask: 0xff)                             */
#define PWM_CH5_DIV_FRAC_Pos              (0UL)                     /*!< FRAC (Bit 0)                                          */
#define PWM_CH5_DIV_FRAC_Msk              (0xfUL)                   /*!< FRAC (Bitfield-Mask: 0x0f)                            */
/* ========================================================  CH5_CTR  ======================================================== */
#define PWM_CH5_CTR_CH5_CTR_Pos           (0UL)                     /*!< CH5_CTR (Bit 0)                                       */
#define PWM_CH5_CTR_CH5_CTR_Msk           (0xffffUL)                /*!< CH5_CTR (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH5_CC  ========================================================= */
#define PWM_CH5_CC_B_Pos                  (16UL)                    /*!< B (Bit 16)                                            */
#define PWM_CH5_CC_B_Msk                  (0xffff0000UL)            /*!< B (Bitfield-Mask: 0xffff)                             */
