mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define PWM_CH5_CC_A_Pos                  (0UL)                     /*!< A (Bit 0)                                             */
#define PWM_CH5_CC_A_Msk                  (0xffffUL)                /*!< A (Bitfield-Mask: 0xffff)                             */
/* ========================================================  CH5_TOP  ======================================================== */
#define PWM_CH5_TOP_CH5_TOP_Pos           (0UL)                     /*!< CH5_TOP (Bit 0)                                       */
#define PWM_CH5_TOP_CH5_TOP_Msk           (0xffffUL)                /*!< CH5_TOP (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH6_CSR  ======================================================== */
#define PWM_CH6_CSR_PH_ADV_Pos            (7UL)                     /*!< PH_ADV (Bit 7)                                        */
#define PWM_CH6_CSR_PH_ADV_Msk            (0x80UL)                  /*!< PH_ADV (Bitfield-Mask: 0x01)                          */
#define PWM_CH6_CSR_PH_RET_Pos            (6UL)                     /*!< PH_RET (Bit 6)                                        */
#define PWM_CH6_CSR_PH_RET_Msk            (0x40UL)                  /*!< PH_RET (Bitfield-Mask: 0x01)                          */
#define PWM_CH6_CSR_DIVMODE_Pos           (4UL)                     /*!< DIVMODE (Bit 4)                                       */
#define PWM_CH6_CSR_DIVMODE_Msk           (0x30UL)                  /*!< DIVMODE (Bitfield-Mask: 0x03)                         */
#define PWM_CH6_CSR_B_INV_Pos             (3UL)                     /*!< B_INV (Bit 3)                                         */
#define PWM_CH6_CSR_B_INV_Msk             (0x8UL)                   /*!< B_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH6_CSR_A_INV_Pos             (2UL)                     /*!< A_INV (Bit 2)                                         */
#define PWM_CH6_CSR_A_INV_Msk             (0x4UL)                   /*!< A_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH6_CSR_PH_CORRECT_Pos        (1UL)                     /*!< PH_CORRECT (Bit 1)                                    */
#define PWM_CH6_CSR_PH_CORRECT_Msk        (0x2UL)                   /*!< PH_CORRECT (Bitfield-Mask: 0x01)                      */
#define PWM_CH6_CSR_EN_Pos                (0UL)                     /*!< EN (Bit 0)                                            */
#define PWM_CH6_CSR_EN_Msk                (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  CH6_DIV  ======================================================== */
#define PWM_CH6_DIV_INT_Pos               (4UL)                     /*!< INT (Bit 4)                                           */
#define PWM_CH6_DIV_INT_Msk               (0xff0UL)                 /*!< INT (Bitfield-Mask: 0xff)                             */
#define PWM_CH6_DIV_FRAC_Pos              (0UL)                     /*!< FRAC (Bit 0)                                          */
#define PWM_CH6_DIV_FRAC_Msk              (0xfUL)                   /*!< FRAC (Bitfield-Mask: 0x0f)                            */
/* ========================================================  CH6_CTR  ======================================================== */
#define PWM_CH6_CTR_CH6_CTR_Pos           (0UL)                     /*!< CH6_CTR (Bit 0)                                       */
#define PWM_CH6_CTR_CH6_CTR_Msk           (0xffffUL)                /*!< CH6_CTR (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH6_CC  ========================================================= */
#define PWM_CH6_CC_B_Pos                  (16UL)                    /*!< B (Bit 16)                                            */
#define PWM_CH6_CC_B_Msk                  (0xffff0000UL)            /*!< B (Bitfield-Mask: 0xffff)                             */
#define PWM_CH6_CC_A_Pos                  (0UL)                     /*!< A (Bit 0)                                             */
#define PWM_CH6_CC_A_Msk                  (0xffffUL)                /*!< A (Bitfield-Mask: 0xffff)                             */
/* ========================================================  CH6_TOP  ======================================================== */
#define PWM_CH6_TOP_CH6_TOP_Pos           (0UL)                     /*!< CH6_TOP (Bit 0)                                       */
#define PWM_CH6_TOP_CH6_TOP_Msk           (0xffffUL)                /*!< CH6_TOP (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH7_CSR  ======================================================== */
#define PWM_CH7_CSR_PH_ADV_Pos            (7UL)                     /*!< PH_ADV (Bit 7)                                        */
#define PWM_CH7_CSR_PH_ADV_Msk            (0x80UL)                  /*!< PH_ADV (Bitfield-Mask: 0x01)                          */
#define PWM_CH7_CSR_PH_RET_Pos            (6UL)                     /*!< PH_RET (Bit 6)                                        */
#define PWM_CH7_CSR_PH_RET_Msk            (0x40UL)                  /*!< PH_RET (Bitfield-Mask: 0x01)                          */
#define PWM_CH7_CSR_DIVMODE_Pos           (4UL)                     /*!< DIVMODE (Bit 4)                                       */
#define PWM_CH7_CSR_DIVMODE_Msk           (0x30UL)                  /*!< DIVMODE (Bitfield-Mask: 0x03)                         */
#define PWM_CH7_CSR_B_INV_Pos             (3UL)                     /*!< B_INV (Bit 3)                                         */
#define PWM_CH7_CSR_B_INV_Msk             (0x8UL)                   /*!< B_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH7_CSR_A_INV_Pos             (2UL)                     /*!< A_INV (Bit 2)                                         */
#define PWM_CH7_CSR_A_INV_Msk             (0x4UL)                   /*!< A_INV (Bitfield-Mask: 0x01)                           */
#define PWM_CH7_CSR_PH_CORRECT_Pos        (1UL)                     /*!< PH_CORRECT (Bit 1)                                    */
#define PWM_CH7_CSR_PH_CORRECT_Msk        (0x2UL)                   /*!< PH_CORRECT (Bitfield-Mask: 0x01)                      */
#define PWM_CH7_CSR_EN_Pos                (0UL)                     /*!< EN (Bit 0)                                            */
#define PWM_CH7_CSR_EN_Msk                (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  CH7_DIV  ======================================================== */
#define PWM_CH7_DIV_INT_Pos               (4UL)                     /*!< INT (Bit 4)                                           */
#define PWM_CH7_DIV_INT_Msk               (0xff0UL)                 /*!< INT (Bitfield-Mask: 0xff)                             */
#define PWM_CH7_DIV_FRAC_Pos              (0UL)                     /*!< FRAC (Bit 0)                                          */
#define PWM_CH7_DIV_FRAC_Msk              (0xfUL)                   /*!< FRAC (Bitfield-Mask: 0x0f)                            */
/* ========================================================  CH7_CTR  ======================================================== */
#define PWM_CH7_CTR_CH7_CTR_Pos           (0UL)                     /*!< CH7_CTR (Bit 0)                                       */
#define PWM_CH7_CTR_CH7_CTR_Msk           (0xffffUL)                /*!< CH7_CTR (Bitfield-Mask: 0xffff)                       */
/* ========================================================  CH7_CC  ========================================================= */
#define PWM_CH7_CC_B_Pos                  (16UL)                    /*!< B (Bit 16)                                            */
#define PWM_CH7_CC_B_Msk                  (0xffff0000UL)            /*!< B (Bitfield-Mask: 0xffff)                             */
#define PWM_CH7_CC_A_Pos                  (0UL)                     /*!< A (Bit 0)                                             */
#define PWM_CH7_CC_A_Msk                  (0xffffUL)                /*!< A (Bitfield-Mask: 0xffff)                             */
/* ========================================================  CH7_TOP  ======================================================== */
#define PWM_CH7_TOP_CH7_TOP_Pos           (0UL)                     /*!< CH7_TOP (Bit 0)                                       */
#define PWM_CH7_TOP_CH7_TOP_Msk           (0xffffUL)                /*!< CH7_TOP (Bitfield-Mask: 0xffff)                       */
/* ==========================================================  EN  =========================================================== */
#define PWM_EN_CH7_Pos                    (7UL)                     /*!< CH7 (Bit 7)                                           */
#define PWM_EN_CH7_Msk                    (0x80UL)                  /*!< CH7 (Bitfield-Mask: 0x01)                             */
#define PWM_EN_CH6_Pos                    (6UL)                     /*!< CH6 (Bit 6)                                           */
#define PWM_EN_CH6_Msk                    (0x40UL)                  /*!< CH6 (Bitfield-Mask: 0x01)                             */
#define PWM_EN_CH5_Pos                    (5UL)                     /*!< CH5 (Bit 5)                                           */
#define PWM_EN_CH5_Msk                    (0x20UL)                  /*!< CH5 (Bitfield-Mask: 0x01)                             */
#define PWM_EN_CH4_Pos                    (4UL)                     /*!< CH4 (Bit 4)                                           */
#define PWM_EN_CH4_Msk                    (0x10UL)                  /*!< CH4 (Bitfield-Mask: 0x01)                             */
#define PWM_EN_CH3_Pos                    (3UL)                     /*!< CH3 (Bit 3)                                           */
#define PWM_EN_CH3_Msk                    (0x8UL)                   /*!< CH3 (Bitfield-Mask: 0x01)                             */
#define PWM_EN_CH2_Pos                    (2UL)                     /*!< CH2 (Bit 2)                                           */
#define PWM_EN_CH2_Msk                    (0x4UL)                   /*!< CH2 (Bitfield-Mask: 0x01)                             */
#define PWM_EN_CH1_Pos                    (1UL)                     /*!< CH1 (Bit 1)                                           */
#define PWM_EN_CH1_Msk                    (0x2UL)                   /*!< CH1 (Bitfield-Mask: 0x01)                             */
#define PWM_EN_CH0_Pos                    (0UL)                     /*!< CH0 (Bit 0)                                           */
#define PWM_EN_CH0_Msk                    (0x1UL)                   /*!< CH0 (Bitfield-Mask: 0x01)                             */
/* =========================================================  INTR  ========================================================== */
#define PWM_INTR_CH7_Pos                  (7UL)                     /*!< CH7 (Bit 7)                                           */
#define PWM_INTR_CH7_Msk                  (0x80UL)                  /*!< CH7 (Bitfield-Mask: 0x01)                             */
#define PWM_INTR_CH6_Pos                  (6UL)                     /*!< CH6 (Bit 6)                                           */
#define PWM_INTR_CH6_Msk                  (0x40UL)                  /*!< CH6 (Bitfield-Mask: 0x01)                             */
#define PWM_INTR_CH5_Pos                  (5UL)                     /*!< CH5 (Bit 5)                                           */
#define PWM_INTR_CH5_Msk                  (0x20UL)                  /*!< CH5 (Bitfield-Mask: 0x01)                             */
#define PWM_INTR_CH4_Pos                  (4UL)                     /*!< CH4 (Bit 4)                                           */
#define PWM_INTR_CH4_Msk                  (0x10UL)                  /*!< CH4 (Bitfield-Mask: 0x01)                             */
#define PWM_INTR_CH3_Pos                  (3UL)                     /*!< CH3 (Bit 3)                                           */
#define PWM_INTR_CH3_Msk                  (0x8UL)                   /*!< CH3 (Bitfield-Mask: 0x01)                             */
#define PWM_INTR_CH2_Pos                  (2UL)                     /*!< CH2 (Bit 2)                                           */
#define PWM_INTR_CH2_Msk                  (0x4UL)                   /*!< CH2 (Bitfield-Mask: 0x01)                             */
#define PWM_INTR_CH1_Pos                  (1UL)                     /*!< CH1 (Bit 1)                                           */
#define PWM_INTR_CH1_Msk                  (0x2UL)                   /*!< CH1 (Bitfield-Mask: 0x01)                             */
#define PWM_INTR_CH0_Pos                  (0UL)                     /*!< CH0 (Bit 0)                                           */
#define PWM_INTR_CH0_Msk                  (0x1UL)                   /*!< CH0 (Bitfield-Mask: 0x01)                             */
/* =========================================================  INTE  ========================================================== */
#define PWM_INTE_CH7_Pos                  (7UL)                     /*!< CH7 (Bit 7)                                           */
#define PWM_INTE_CH7_Msk                  (0x80UL)                  /*!< CH7 (Bitfield-Mask: 0x01)                             */
#define PWM_INTE_CH6_Pos                  (6UL)                     /*!< CH6 (Bit 6)                                           */
#define PWM_INTE_CH6_Msk                  (0x40UL)                  /*!< CH6 (Bitfield-Mask: 0x01)                             */
#define PWM_INTE_CH5_Pos                  (5UL)                     /*!< CH5 (Bit 5)                                           */
#define PWM_INTE_CH5_Msk                  (0x20UL)                  /*!< CH5 (Bitfield-Mask: 0x01)                             */
#define PWM_INTE_CH4_Pos                  (4UL)                     /*!< CH4 (Bit 4)                                           */
#define PWM_INTE_CH4_Msk                  (0x10UL)                  /*!< CH4 (Bitfield-Mask: 0x01)                             */
#define PWM_INTE_CH3_Pos                  (3UL)                     /*!< CH3 (Bit 3)                                           */
#define PWM_INTE_CH3_Msk                  (0x8UL)                   /*!< CH3 (Bitfield-Mask: 0x01)                             */
#define PWM_INTE_CH2_Pos                  (2UL)                     /*!< CH2 (Bit 2)                                           */
#define PWM_INTE_CH2_Msk                  (0x4UL)                   /*!< CH2 (Bitfield-Mask: 0x01)                             */
#define PWM_INTE_CH1_Pos                  (1UL)                     /*!< CH1 (Bit 1)                                           */
#define PWM_INTE_CH1_Msk                  (0x2UL)                   /*!< CH1 (Bitfield-Mask: 0x01)                             */
#define PWM_INTE_CH0_Pos                  (0UL)                     /*!< CH0 (Bit 0)                                           */
#define PWM_INTE_CH0_Msk                  (0x1UL)                   /*!< CH0 (Bitfield-Mask: 0x01)                             */
/* =========================================================  INTF  ========================================================== */
#define PWM_INTF_CH7_Pos                  (7UL)                     /*!< CH7 (Bit 7)                                           */
#define PWM_INTF_CH7_Msk                  (0x80UL)                  /*!< CH7 (Bitfield-Mask: 0x01)                             */
#define PWM_INTF_CH6_Pos                  (6UL)                     /*!< CH6 (Bit 6)                                           */
#define PWM_INTF_CH6_Msk                  (0x40UL)                  /*!< CH6 (Bitfield-Mask: 0x01)                             */
#define PWM_INTF_CH5_Pos                  (5UL)                     /*!< CH5 (Bit 5)                                           */
#define PWM_INTF_CH5_Msk                  (0x20UL)                  /*!< CH5 (Bitfield-Mask: 0x01)                             */
#define PWM_INTF_CH4_Pos                  (4UL)                     /*!< CH4 (Bit 4)                                           */
#define PWM_INTF_CH4_Msk                  (0x10UL)                  /*!< CH4 (Bitfield-Mask: 0x01)                             */
#define PWM_INTF_CH3_Pos                  (3UL)                     /*!< CH3 (Bit 3)                                           */
#define PWM_INTF_CH3_Msk                  (0x8UL)                   /*!< CH3 (Bitfield-Mask: 0x01)                             */
#define PWM_INTF_CH2_Pos                  (2UL)                     /*!< CH2 (Bit 2)                                           */
#define PWM_INTF_CH2_Msk                  (0x4UL)                   /*!< CH2 (Bitfield-Mask: 0x01)                             */
#define PWM_INTF_CH1_Pos                  (1UL)                     /*!< CH1 (Bit 1)                                           */
#define PWM_INTF_CH1_Msk                  (0x2UL)                   /*!< CH1 (Bitfield-Mask: 0x01)                             */
#define PWM_INTF_CH0_Pos                  (0UL)                     /*!< CH0 (Bit 0)                                           */
#define PWM_INTF_CH0_Msk                  (0x1UL)                   /*!< CH0 (Bitfield-Mask: 0x01)                             */
/* =========================================================  INTS  ========================================================== */
#define PWM_INTS_CH7_Pos                  (7UL)                     /*!< CH7 (Bit 7)                                           */
#define PWM_INTS_CH7_Msk                  (0x80UL)                  /*!< CH7 (Bitfield-Mask: 0x01)                             */
#define PWM_INTS_CH6_Pos                  (6UL)                     /*!< CH6 (Bit 6)                                           */
#define PWM_INTS_CH6_Msk                  (0x40UL)                  /*!< CH6 (Bitfield-Mask: 0x01)                             */
#define PWM_INTS_CH5_Pos                  (5UL)                     /*!< CH5 (Bit 5)                                           */
#define PWM_INTS_CH5_Msk                  (0x20UL)                  /*!< CH5 (Bitfield-Mask: 0x01)                             */
#define PWM_INTS_CH4_Pos                  (4UL)                     /*!< CH4 (Bit 4)                                           */
#define PWM_INTS_CH4_Msk                  (0x10UL)                  /*!< CH4 (Bitfield-Mask: 0x01)                             */
#define PWM_INTS_CH3_Pos                  (3UL)                     /*!< CH3 (Bit 3)                                           */
#define PWM_INTS_CH3_Msk                  (0x8UL)                   /*!< CH3 (Bitfield-Mask: 0x01)                             */
#define PWM_INTS_CH2_Pos                  (2UL)                     /*!< CH2 (Bit 2)                                           */
#define PWM_INTS_CH2_Msk                  (0x4UL)                   /*!< CH2 (Bitfield-Mask: 0x01)                             */
#define PWM_INTS_CH1_Pos                  (1UL)                     /*!< CH1 (Bit 1)                                           */
#define PWM_INTS_CH1_Msk                  (0x2UL)                   /*!< CH1 (Bitfield-Mask: 0x01)                             */
#define PWM_INTS_CH0_Pos                  (0UL)                     /*!< CH0 (Bit 0)                                           */
#define PWM_INTS_CH0_Msk                  (0x1UL)                   /*!< CH0 (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                           TIMER                                           ================ */
/* =========================================================================================================================== */

