mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ========================================================  TIMEHW  ========================================================= */
/* ========================================================  TIMELW  ========================================================= */
/* ========================================================  TIMEHR  ========================================================= */
/* ========================================================  TIMELR  ========================================================= */
/* ========================================================  ALARM0  ========================================================= */
/* ========================================================  ALARM1  ========================================================= */
/* ========================================================  ALARM2  ========================================================= */
/* ========================================================  ALARM3  ========================================================= */
/* =========================================================  ARMED  ========================================================= */
#define TIMER_ARMED_ARMED_Pos             (0UL)                     /*!< ARMED (Bit 0)                                         */
#define TIMER_ARMED_ARMED_Msk             (0xfUL)                   /*!< ARMED (Bitfield-Mask: 0x0f)                           */
/* =======================================================  TIMERAWH  ======================================================== */
/* =======================================================  TIMERAWL  ======================================================== */
/* =======================================================  DBGPAUSE  ======================================================== */
#define TIMER_DBGPAUSE_DBG1_Pos           (2UL)                     /*!< DBG1 (Bit 2)                                          */
#define TIMER_DBGPAUSE_DBG1_Msk           (0x4UL)                   /*!< DBG1 (Bitfield-Mask: 0x01)                            */
#define TIMER_DBGPAUSE_DBG0_Pos           (1UL)                     /*!< DBG0 (Bit 1)                                          */
#define TIMER_DBGPAUSE_DBG0_Msk           (0x2UL)                   /*!< DBG0 (Bitfield-Mask: 0x01)                            */
/* =========================================================  PAUSE  ========================================================= */
#define TIMER_PAUSE_PAUSE_Pos             (0UL)                     /*!< PAUSE (Bit 0)                                         */
#define TIMER_PAUSE_PAUSE_Msk             (0x1UL)                   /*!< PAUSE (Bitfield-Mask: 0x01)                           */
/* =========================================================  INTR  ========================================================== */
#define TIMER_INTR_ALARM_3_Pos            (3UL)                     /*!< ALARM_3 (Bit 3)                                       */
#define TIMER_INTR_ALARM_3_Msk            (0x8UL)                   /*!< ALARM_3 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTR_ALARM_2_Pos            (2UL)                     /*!< ALARM_2 (Bit 2)                                       */
#define TIMER_INTR_ALARM_2_Msk            (0x4UL)                   /*!< ALARM_2 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTR_ALARM_1_Pos            (1UL)                     /*!< ALARM_1 (Bit 1)                                       */
#define TIMER_INTR_ALARM_1_Msk            (0x2UL)                   /*!< ALARM_1 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTR_ALARM_0_Pos            (0UL)                     /*!< ALARM_0 (Bit 0)                                       */
#define TIMER_INTR_ALARM_0_Msk            (0x1UL)                   /*!< ALARM_0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  INTE  ========================================================== */
#define TIMER_INTE_ALARM_3_Pos            (3UL)                     /*!< ALARM_3 (Bit 3)                                       */
#define TIMER_INTE_ALARM_3_Msk            (0x8UL)                   /*!< ALARM_3 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTE_ALARM_2_Pos            (2UL)                     /*!< ALARM_2 (Bit 2)                                       */
#define TIMER_INTE_ALARM_2_Msk            (0x4UL)                   /*!< ALARM_2 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTE_ALARM_1_Pos            (1UL)                     /*!< ALARM_1 (Bit 1)                                       */
#define TIMER_INTE_ALARM_1_Msk            (0x2UL)                   /*!< ALARM_1 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTE_ALARM_0_Pos            (0UL)                     /*!< ALARM_0 (Bit 0)                                       */
#define TIMER_INTE_ALARM_0_Msk            (0x1UL)                   /*!< ALARM_0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  INTF  ========================================================== */
#define TIMER_INTF_ALARM_3_Pos            (3UL)                     /*!< ALARM_3 (Bit 3)                                       */
#define TIMER_INTF_ALARM_3_Msk            (0x8UL)                   /*!< ALARM_3 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTF_ALARM_2_Pos            (2UL)                     /*!< ALARM_2 (Bit 2)                                       */
#define TIMER_INTF_ALARM_2_Msk            (0x4UL)                   /*!< ALARM_2 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTF_ALARM_1_Pos            (1UL)                     /*!< ALARM_1 (Bit 1)                                       */
#define TIMER_INTF_ALARM_1_Msk            (0x2UL)                   /*!< ALARM_1 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTF_ALARM_0_Pos            (0UL)                     /*!< ALARM_0 (Bit 0)                                       */
#define TIMER_INTF_ALARM_0_Msk            (0x1UL)                   /*!< ALARM_0 (Bitfield-Mask: 0x01)                         */
/* =========================================================  INTS  ========================================================== */
#define TIMER_INTS_ALARM_3_Pos            (3UL)                     /*!< ALARM_3 (Bit 3)                                       */
#define TIMER_INTS_ALARM_3_Msk            (0x8UL)                   /*!< ALARM_3 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTS_ALARM_2_Pos            (2UL)                     /*!< ALARM_2 (Bit 2)                                       */
#define TIMER_INTS_ALARM_2_Msk            (0x4UL)                   /*!< ALARM_2 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTS_ALARM_1_Pos            (1UL)                     /*!< ALARM_1 (Bit 1)                                       */
#define TIMER_INTS_ALARM_1_Msk            (0x2UL)                   /*!< ALARM_1 (Bitfield-Mask: 0x01)                         */
#define TIMER_INTS_ALARM_0_Pos            (0UL)                     /*!< ALARM_0 (Bit 0)                                       */
#define TIMER_INTS_ALARM_0_Msk            (0x1UL)                   /*!< ALARM_0 (Bitfield-Mask: 0x01)                         */


/* =========================================================================================================================== */
/* ================                                         WATCHDOG                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define WATCHDOG_CTRL_TRIGGER_Pos         (31UL)                    /*!< TRIGGER (Bit 31)                                      */
#define WATCHDOG_CTRL_TRIGGER_Msk         (0x80000000UL)            /*!< TRIGGER (Bitfield-Mask: 0x01)                         */
#define WATCHDOG_CTRL_ENABLE_Pos          (30UL)                    /*!< ENABLE (Bit 30)                                       */
#define WATCHDOG_CTRL_ENABLE_Msk          (0x40000000UL)            /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define WATCHDOG_CTRL_PAUSE_DBG1_Pos      (26UL)                    /*!< PAUSE_DBG1 (Bit 26)                                   */
#define WATCHDOG_CTRL_PAUSE_DBG1_Msk      (0x4000000UL)             /*!< PAUSE_DBG1 (Bitfield-Mask: 0x01)                      */
#define WATCHDOG_CTRL_PAUSE_DBG0_Pos      (25UL)                    /*!< PAUSE_DBG0 (Bit 25)                                   */
#define WATCHDOG_CTRL_PAUSE_DBG0_Msk      (0x2000000UL)             /*!< PAUSE_DBG0 (Bitfield-Mask: 0x01)                      */
#define WATCHDOG_CTRL_PAUSE_JTAG_Pos      (24UL)                    /*!< PAUSE_JTAG (Bit 24)                                   */
#define WATCHDOG_CTRL_PAUSE_JTAG_Msk      (0x1000000UL)             /*!< PAUSE_JTAG (Bitfield-Mask: 0x01)                      */
#define WATCHDOG_CTRL_TIME_Pos            (0UL)                     /*!< TIME (Bit 0)                                          */
#define WATCHDOG_CTRL_TIME_Msk            (0xffffffUL)              /*!< TIME (Bitfield-Mask: 0xffffff)                        */
/* =========================================================  LOAD  ========================================================== */
#define WATCHDOG_LOAD_LOAD_Pos            (0UL)                     /*!< LOAD (Bit 0)                                          */
#define WATCHDOG_LOAD_LOAD_Msk            (0xffffffUL)              /*!< LOAD (Bitfield-Mask: 0xffffff)                        */
/* ========================================================  REASON  ========================================================= */
#define WATCHDOG_REASON_FORCE_Pos         (1UL)                     /*!< FORCE (Bit 1)                                         */
#define WATCHDOG_REASON_FORCE_Msk         (0x2UL)                   /*!< FORCE (Bitfield-Mask: 0x01)                           */
#define WATCHDOG_REASON_TIMER_Pos         (0UL)                     /*!< TIMER (Bit 0)                                         */
#define WATCHDOG_REASON_TIMER_Msk         (0x1UL)                   /*!< TIMER (Bitfield-Mask: 0x01)                           */
/* =======================================================  SCRATCH0  ======================================================== */
/* =======================================================  SCRATCH1  ======================================================== */
/* =======================================================  SCRATCH2  ======================================================== */
/* =======================================================  SCRATCH3  ======================================================== */
/* =======================================================  SCRATCH4  ======================================================== */
/* =======================================================  SCRATCH5  ======================================================== */
/* =======================================================  SCRATCH6  ======================================================== */
/* =======================================================  SCRATCH7  ======================================================== */
/* =========================================================  TICK  ========================================================== */
#define WATCHDOG_TICK_COUNT_Pos           (11UL)                    /*!< COUNT (Bit 11)                                        */
#define WATCHDOG_TICK_COUNT_Msk           (0xff800UL)               /*!< COUNT (Bitfield-Mask: 0x1ff)                          */
#define WATCHDOG_TICK_RUNNING_Pos         (10UL)                    /*!< RUNNING (Bit 10)                                      */
#define WATCHDOG_TICK_RUNNING_Msk         (0x400UL)                 /*!< RUNNING (Bitfield-Mask: 0x01)                         */
#define WATCHDOG_TICK_ENABLE_Pos          (9UL)                     /*!< ENABLE (Bit 9)                                        */
#define WATCHDOG_TICK_ENABLE_Msk          (0x200UL)                 /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define WATCHDOG_TICK_CYCLES_Pos          (0UL)                     /*!< CYCLES (Bit 0)                                        */
#define WATCHDOG_TICK_CYCLES_Msk          (0x1ffUL)                 /*!< CYCLES (Bitfield-Mask: 0x1ff)                         */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

