mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =======================================================  CLKDIV_M1  ======================================================= */
#define RTC_CLKDIV_M1_CLKDIV_M1_Pos       (0UL)                     /*!< CLKDIV_M1 (Bit 0)                                     */
#define RTC_CLKDIV_M1_CLKDIV_M1_Msk       (0xffffUL)                /*!< CLKDIV_M1 (Bitfield-Mask: 0xffff)                     */
/* ========================================================  SETUP_0  ======================================================== */
#define RTC_SETUP_0_YEAR_Pos              (12UL)                    /*!< YEAR (Bit 12)                                         */
#define RTC_SETUP_0_YEAR_Msk              (0xfff000UL)              /*!< YEAR (Bitfield-Mask: 0xfff)                           */
#define RTC_SETUP_0_MONTH_Pos             (8UL)                     /*!< MONTH (Bit 8)                                         */
#define RTC_SETUP_0_MONTH_Msk             (0xf00UL)                 /*!< MONTH (Bitfield-Mask: 0x0f)                           */
#define RTC_SETUP_0_DAY_Pos               (0UL)                     /*!< DAY (Bit 0)                                           */
#define RTC_SETUP_0_DAY_Msk               (0x1fUL)                  /*!< DAY (Bitfield-Mask: 0x1f)                             */
/* ========================================================  SETUP_1  ======================================================== */
#define RTC_SETUP_1_DOTW_Pos              (24UL)                    /*!< DOTW (Bit 24)                                         */
#define RTC_SETUP_1_DOTW_Msk              (0x7000000UL)             /*!< DOTW (Bitfield-Mask: 0x07)                            */
#define RTC_SETUP_1_HOUR_Pos              (16UL)                    /*!< HOUR (Bit 16)                                         */
#define RTC_SETUP_1_HOUR_Msk              (0x1f0000UL)              /*!< HOUR (Bitfield-Mask: 0x1f)                            */
#define RTC_SETUP_1_MIN_Pos               (8UL)                     /*!< MIN (Bit 8)                                           */
#define RTC_SETUP_1_MIN_Msk               (0x3f00UL)                /*!< MIN (Bitfield-Mask: 0x3f)                             */
#define RTC_SETUP_1_SEC_Pos               (0UL)                     /*!< SEC (Bit 0)                                           */
#define RTC_SETUP_1_SEC_Msk               (0x3fUL)                  /*!< SEC (Bitfield-Mask: 0x3f)                             */
/* =========================================================  CTRL  ========================================================== */
#define RTC_CTRL_FORCE_NOTLEAPYEAR_Pos    (8UL)                     /*!< FORCE_NOTLEAPYEAR (Bit 8)                             */
#define RTC_CTRL_FORCE_NOTLEAPYEAR_Msk    (0x100UL)                 /*!< FORCE_NOTLEAPYEAR (Bitfield-Mask: 0x01)               */
#define RTC_CTRL_LOAD_Pos                 (4UL)                     /*!< LOAD (Bit 4)                                          */
#define RTC_CTRL_LOAD_Msk                 (0x10UL)                  /*!< LOAD (Bitfield-Mask: 0x01)                            */
#define RTC_CTRL_RTC_ACTIVE_Pos           (1UL)                     /*!< RTC_ACTIVE (Bit 1)                                    */
#define RTC_CTRL_RTC_ACTIVE_Msk           (0x2UL)                   /*!< RTC_ACTIVE (Bitfield-Mask: 0x01)                      */
#define RTC_CTRL_RTC_ENABLE_Pos           (0UL)                     /*!< RTC_ENABLE (Bit 0)                                    */
#define RTC_CTRL_RTC_ENABLE_Msk           (0x1UL)                   /*!< RTC_ENABLE (Bitfield-Mask: 0x01)                      */
/* ======================================================  IRQ_SETUP_0  ====================================================== */
#define RTC_IRQ_SETUP_0_MATCH_ACTIVE_Pos  (29UL)                    /*!< MATCH_ACTIVE (Bit 29)                                 */
#define RTC_IRQ_SETUP_0_MATCH_ACTIVE_Msk  (0x20000000UL)            /*!< MATCH_ACTIVE (Bitfield-Mask: 0x01)                    */
#define RTC_IRQ_SETUP_0_MATCH_ENA_Pos     (28UL)                    /*!< MATCH_ENA (Bit 28)                                    */
#define RTC_IRQ_SETUP_0_MATCH_ENA_Msk     (0x10000000UL)            /*!< MATCH_ENA (Bitfield-Mask: 0x01)                       */
#define RTC_IRQ_SETUP_0_YEAR_ENA_Pos      (26UL)                    /*!< YEAR_ENA (Bit 26)                                     */
#define RTC_IRQ_SETUP_0_YEAR_ENA_Msk      (0x4000000UL)             /*!< YEAR_ENA (Bitfield-Mask: 0x01)                        */
#define RTC_IRQ_SETUP_0_MONTH_ENA_Pos     (25UL)                    /*!< MONTH_ENA (Bit 25)                                    */
#define RTC_IRQ_SETUP_0_MONTH_ENA_Msk     (0x2000000UL)             /*!< MONTH_ENA (Bitfield-Mask: 0x01)                       */
#define RTC_IRQ_SETUP_0_DAY_ENA_Pos       (24UL)                    /*!< DAY_ENA (Bit 24)                                      */
#define RTC_IRQ_SETUP_0_DAY_ENA_Msk       (0x1000000UL)             /*!< DAY_ENA (Bitfield-Mask: 0x01)                         */
#define RTC_IRQ_SETUP_0_YEAR_Pos          (12UL)                    /*!< YEAR (Bit 12)                                         */
#define RTC_IRQ_SETUP_0_YEAR_Msk          (0xfff000UL)              /*!< YEAR (Bitfield-Mask: 0xfff)                           */
#define RTC_IRQ_SETUP_0_MONTH_Pos         (8UL)                     /*!< MONTH (Bit 8)                                         */
#define RTC_IRQ_SETUP_0_MONTH_Msk         (0xf00UL)                 /*!< MONTH (Bitfield-Mask: 0x0f)                           */
#define RTC_IRQ_SETUP_0_DAY_Pos           (0UL)                     /*!< DAY (Bit 0)                                           */
#define RTC_IRQ_SETUP_0_DAY_Msk           (0x1fUL)                  /*!< DAY (Bitfield-Mask: 0x1f)                             */
/* ======================================================  IRQ_SETUP_1  ====================================================== */
#define RTC_IRQ_SETUP_1_DOTW_ENA_Pos      (31UL)                    /*!< DOTW_ENA (Bit 31)                                     */
#define RTC_IRQ_SETUP_1_DOTW_ENA_Msk      (0x80000000UL)            /*!< DOTW_ENA (Bitfield-Mask: 0x01)                        */
#define RTC_IRQ_SETUP_1_HOUR_ENA_Pos      (30UL)                    /*!< HOUR_ENA (Bit 30)                                     */
#define RTC_IRQ_SETUP_1_HOUR_ENA_Msk      (0x40000000UL)            /*!< HOUR_ENA (Bitfield-Mask: 0x01)                        */
#define RTC_IRQ_SETUP_1_MIN_ENA_Pos       (29UL)                    /*!< MIN_ENA (Bit 29)                                      */
#define RTC_IRQ_SETUP_1_MIN_ENA_Msk       (0x20000000UL)            /*!< MIN_ENA (Bitfield-Mask: 0x01)                         */
#define RTC_IRQ_SETUP_1_SEC_ENA_Pos       (28UL)                    /*!< SEC_ENA (Bit 28)                                      */
#define RTC_IRQ_SETUP_1_SEC_ENA_Msk       (0x10000000UL)            /*!< SEC_ENA (Bitfield-Mask: 0x01)                         */
#define RTC_IRQ_SETUP_1_DOTW_Pos          (24UL)                    /*!< DOTW (Bit 24)                                         */
#define RTC_IRQ_SETUP_1_DOTW_Msk          (0x7000000UL)             /*!< DOTW (Bitfield-Mask: 0x07)                            */
#define RTC_IRQ_SETUP_1_HOUR_Pos          (16UL)                    /*!< HOUR (Bit 16)                                         */
#define RTC_IRQ_SETUP_1_HOUR_Msk          (0x1f0000UL)              /*!< HOUR (Bitfield-Mask: 0x1f)                            */
#define RTC_IRQ_SETUP_1_MIN_Pos           (8UL)                     /*!< MIN (Bit 8)                                           */
#define RTC_IRQ_SETUP_1_MIN_Msk           (0x3f00UL)                /*!< MIN (Bitfield-Mask: 0x3f)                             */
#define RTC_IRQ_SETUP_1_SEC_Pos           (0UL)                     /*!< SEC (Bit 0)                                           */
#define RTC_IRQ_SETUP_1_SEC_Msk           (0x3fUL)                  /*!< SEC (Bitfield-Mask: 0x3f)                             */
/* =========================================================  RTC_1  ========================================================= */
#define RTC_RTC_1_YEAR_Pos                (12UL)                    /*!< YEAR (Bit 12)                                         */
#define RTC_RTC_1_YEAR_Msk                (0xfff000UL)              /*!< YEAR (Bitfield-Mask: 0xfff)                           */
#define RTC_RTC_1_MONTH_Pos               (8UL)                     /*!< MONTH (Bit 8)                                         */
#define RTC_RTC_1_MONTH_Msk               (0xf00UL)                 /*!< MONTH (Bitfield-Mask: 0x0f)                           */
#define RTC_RTC_1_DAY_Pos                 (0UL)                     /*!< DAY (Bit 0)                                           */
#define RTC_RTC_1_DAY_Msk                 (0x1fUL)                  /*!< DAY (Bitfield-Mask: 0x1f)                             */
/* =========================================================  RTC_0  ========================================================= */
#define RTC_RTC_0_DOTW_Pos                (24UL)                    /*!< DOTW (Bit 24)                                         */
#define RTC_RTC_0_DOTW_Msk                (0x7000000UL)             /*!< DOTW (Bitfield-Mask: 0x07)                            */
#define RTC_RTC_0_HOUR_Pos                (16UL)                    /*!< HOUR (Bit 16)                                         */
#define RTC_RTC_0_HOUR_Msk                (0x1f0000UL)              /*!< HOUR (Bitfield-Mask: 0x1f)                            */
#define RTC_RTC_0_MIN_Pos                 (8UL)                     /*!< MIN (Bit 8)                                           */
#define RTC_RTC_0_MIN_Msk                 (0x3f00UL)                /*!< MIN (Bitfield-Mask: 0x3f)                             */
#define RTC_RTC_0_SEC_Pos                 (0UL)                     /*!< SEC (Bit 0)                                           */
#define RTC_RTC_0_SEC_Msk                 (0x3fUL)                  /*!< SEC (Bitfield-Mask: 0x3f)                             */
/* =========================================================  INTR  ========================================================== */
#define RTC_INTR_RTC_Pos                  (0UL)                     /*!< RTC (Bit 0)                                           */
#define RTC_INTR_RTC_Msk                  (0x1UL)                   /*!< RTC (Bitfield-Mask: 0x01)                             */
/* =========================================================  INTE  ========================================================== */
#define RTC_INTE_RTC_Pos                  (0UL)                     /*!< RTC (Bit 0)                                           */
#define RTC_INTE_RTC_Msk                  (0x1UL)                   /*!< RTC (Bitfield-Mask: 0x01)                             */
/* =========================================================  INTF  ========================================================== */
#define RTC_INTF_RTC_Pos                  (0UL)                     /*!< RTC (Bit 0)                                           */
#define RTC_INTF_RTC_Msk                  (0x1UL)                   /*!< RTC (Bitfield-Mask: 0x01)                             */
/* =========================================================  INTS  ========================================================== */
#define RTC_INTS_RTC_Pos                  (0UL)                     /*!< RTC (Bit 0)                                           */
#define RTC_INTS_RTC_Msk                  (0x1UL)                   /*!< RTC (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                           ROSC                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define ROSC_CTRL_ENABLE_Pos              (12UL)                    /*!< ENABLE (Bit 12)                                       */
#define ROSC_CTRL_ENABLE_Msk              (0xfff000UL)              /*!< ENABLE (Bitfield-Mask: 0xfff)                         */
#define ROSC_CTRL_FREQ_RANGE_Pos          (0UL)                     /*!< FREQ_RANGE (Bit 0)                                    */
#define ROSC_CTRL_FREQ_RANGE_Msk          (0xfffUL)                 /*!< FREQ_RANGE (Bitfield-Mask: 0xfff)                     */
/* =========================================================  FREQA  ========================================================= */
#define ROSC_FREQA_PASSWD_Pos             (16UL)                    /*!< PASSWD (Bit 16)                                       */
#define ROSC_FREQA_PASSWD_Msk             (0xffff0000UL)            /*!< PASSWD (Bitfield-Mask: 0xffff)                        */
#define ROSC_FREQA_DS3_Pos                (12UL)                    /*!< DS3 (Bit 12)                                          */
#define ROSC_FREQA_DS3_Msk                (0x7000UL)                /*!< DS3 (Bitfield-Mask: 0x07)                             */
#define ROSC_FREQA_DS2_Pos                (8UL)                     /*!< DS2 (Bit 8)                                           */
#define ROSC_FREQA_DS2_Msk                (0x700UL)                 /*!< DS2 (Bitfield-Mask: 0x07)                             */
#define ROSC_FREQA_DS1_Pos                (4UL)                     /*!< DS1 (Bit 4)                                           */
#define ROSC_FREQA_DS1_Msk                (0x70UL)                  /*!< DS1 (Bitfield-Mask: 0x07)                             */
#define ROSC_FREQA_DS0_Pos                (0UL)                     /*!< DS0 (Bit 0)                                           */
#define ROSC_FREQA_DS0_Msk                (0x7UL)                   /*!< DS0 (Bitfield-Mask: 0x07)                             */
/* =========================================================  FREQB  ========================================================= */
#define ROSC_FREQB_PASSWD_Pos             (16UL)                    /*!< PASSWD (Bit 16)                                       */
#define ROSC_FREQB_PASSWD_Msk             (0xffff0000UL)            /*!< PASSWD (Bitfield-Mask: 0xffff)                        */
#define ROSC_FREQB_DS7_Pos                (12UL)                    /*!< DS7 (Bit 12)                                          */
#define ROSC_FREQB_DS7_Msk                (0x7000UL)                /*!< DS7 (Bitfield-Mask: 0x07)                             */
#define ROSC_FREQB_DS6_Pos                (8UL)                     /*!< DS6 (Bit 8)                                           */
#define ROSC_FREQB_DS6_Msk                (0x700UL)                 /*!< DS6 (Bitfield-Mask: 0x07)                             */
#define ROSC_FREQB_DS5_Pos                (4UL)                     /*!< DS5 (Bit 4)                                           */
#define ROSC_FREQB_DS5_Msk                (0x70UL)                  /*!< DS5 (Bitfield-Mask: 0x07)                             */
#define ROSC_FREQB_DS4_Pos                (0UL)                     /*!< DS4 (Bit 0)                                           */
#define ROSC_FREQB_DS4_Msk                (0x7UL)                   /*!< DS4 (Bitfield-Mask: 0x07)                             */
/* ========================================================  DORMANT  ======================================================== */
/* ==========================================================  DIV  ========================================================== */
#define ROSC_DIV_DIV_Pos                  (0UL)                     /*!< DIV (Bit 0)                                           */
#define ROSC_DIV_DIV_Msk                  (0xfffUL)                 /*!< DIV (Bitfield-Mask: 0xfff)                            */
/* =========================================================  PHASE  ========================================================= */
#define ROSC_PHASE_PASSWD_Pos             (4UL)                     /*!< PASSWD (Bit 4)                                        */
#define ROSC_PHASE_PASSWD_Msk             (0xff0UL)                 /*!< PASSWD (Bitfield-Mask: 0xff)                          */
#define ROSC_PHASE_ENABLE_Pos             (3UL)                     /*!< ENABLE (Bit 3)                                        */
#define ROSC_PHASE_ENABLE_Msk             (0x8UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
#define ROSC_PHASE_FLIP_Pos               (2UL)                     /*!< FLIP (Bit 2)                                          */
#define ROSC_PHASE_FLIP_Msk               (0x4UL)                   /*!< FLIP (Bitfield-Mask: 0x01)                            */
#define ROSC_PHASE_SHIFT_Pos              (0UL)                     /*!< SHIFT (Bit 0)                                         */
#define ROSC_PHASE_SHIFT_Msk              (0x3UL)                   /*!< SHIFT (Bitfield-Mask: 0x03)                           */
/* ========================================================  STATUS  ========================================================= */
#define ROSC_STATUS_STABLE_Pos            (31UL)                    /*!< STABLE (Bit 31)                                       */
#define ROSC_STATUS_STABLE_Msk            (0x80000000UL)            /*!< STABLE (Bitfield-Mask: 0x01)                          */
#define ROSC_STATUS_BADWRITE_Pos          (24UL)                    /*!< BADWRITE (Bit 24)                                     */
#define ROSC_STATUS_BADWRITE_Msk          (0x1000000UL)             /*!< BADWRITE (Bitfield-Mask: 0x01)                        */
#define ROSC_STATUS_DIV_RUNNING_Pos       (16UL)                    /*!< DIV_RUNNING (Bit 16)                                  */
#define ROSC_STATUS_DIV_RUNNING_Msk       (0x10000UL)               /*!< DIV_RUNNING (Bitfield-Mask: 0x01)                     */
#define ROSC_STATUS_ENABLED_Pos           (12UL)                    /*!< ENABLED (Bit 12)                                      */
#define ROSC_STATUS_ENABLED_Msk           (0x1000UL)                /*!< ENABLED (Bitfield-Mask: 0x01)                         */
/* =======================================================  RANDOMBIT  ======================================================= */
#define ROSC_RANDOMBIT_RANDOMBIT_Pos      (0UL)                     /*!< RANDOMBIT (Bit 0)                                     */
#define ROSC_RANDOMBIT_RANDOMBIT_Msk      (0x1UL)                   /*!< RANDOMBIT (Bitfield-Mask: 0x01)                       */
/* =========================================================  COUNT  ========================================================= */
#define ROSC_COUNT_COUNT_Pos              (0UL)                     /*!< COUNT (Bit 0)                                         */
#define ROSC_COUNT_COUNT_Msk              (0xffUL)                  /*!< COUNT (Bitfield-Mask: 0xff)                           */


/* =========================================================================================================================== */
/* ================                                    VREG_AND_CHIP_RESET                                    ================ */
/* =========================================================================================================================== */

/* =========================================================  VREG  ========================================================== */
#define VREG_AND_CHIP_RESET_VREG_ROK_Pos  (12UL)                    /*!< ROK (Bit 12)                                          */
#define VREG_AND_CHIP_RESET_VREG_ROK_Msk  (0x1000UL)                /*!< ROK (Bitfield-Mask: 0x01)                             */
#define VREG_AND_CHIP_RESET_VREG_VSEL_Pos (4UL)                     /*!< VSEL (Bit 4)                                          */
#define VREG_AND_CHIP_RESET_VREG_VSEL_Msk (0xf0UL)                  /*!< VSEL (Bitfield-Mask: 0x0f)                            */
#define VREG_AND_CHIP_RESET_VREG_HIZ_Pos  (1UL)                     /*!< HIZ (Bit 1)                                           */
#define VREG_AND_CHIP_RESET_VREG_HIZ_Msk  (0x2UL)                   /*!< HIZ (Bitfield-Mask: 0x01)                             */
#define VREG_AND_CHIP_RESET_VREG_EN_Pos   (0UL)                     /*!< EN (Bit 0)                                            */
#define VREG_AND_CHIP_RESET_VREG_EN_Msk   (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  BOD  ========================================================== */
#define VREG_AND_CHIP_RESET_BOD_VSEL_Pos  (4UL)                     /*!< VSEL (Bit 4)                                          */
#define VREG_AND_CHIP_RESET_BOD_VSEL_Msk  (0xf0UL)                  /*!< VSEL (Bitfield-Mask: 0x0f)                            */
#define VREG_AND_CHIP_RESET_BOD_EN_Pos    (0UL)                     /*!< EN (Bit 0)                                            */
#define VREG_AND_CHIP_RESET_BOD_EN_Msk    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ======================================================  CHIP_RESET  ======================================================= */
#define VREG_AND_CHIP_RESET_CHIP_RESET_PSM_RESTART_FLAG_Pos (24UL)  /*!< PSM_RESTART_FLAG (Bit 24)                             */
#define VREG_AND_CHIP_RESET_CHIP_RESET_PSM_RESTART_FLAG_Msk (0x1000000UL) /*!< PSM_RESTART_FLAG (Bitfield-Mask: 0x01)          */
#define VREG_AND_CHIP_RESET_CHIP_RESET_HAD_PSM_RESTART_Pos (20UL)   /*!< HAD_PSM_RESTART (Bit 20)                              */
#define VREG_AND_CHIP_RESET_CHIP_RESET_HAD_PSM_RESTART_Msk (0x100000UL) /*!< HAD_PSM_RESTART (Bitfield-Mask: 0x01)             */
#define VREG_AND_CHIP_RESET_CHIP_RESET_HAD_RUN_Pos (16UL)           /*!< HAD_RUN (Bit 16)                                      */
#define VREG_AND_CHIP_RESET_CHIP_RESET_HAD_RUN_Msk (0x10000UL)      /*!< HAD_RUN (Bitfield-Mask: 0x01)                         */
#define VREG_AND_CHIP_RESET_CHIP_RESET_HAD_POR_Pos (8UL)            /*!< HAD_POR (Bit 8)                                       */
#define VREG_AND_CHIP_RESET_CHIP_RESET_HAD_POR_Msk (0x100UL)        /*!< HAD_POR (Bitfield-Mask: 0x01)                         */


/* =========================================================================================================================== */
/* ================                                           TBMAN                                           ================ */
/* =========================================================================================================================== */

/* =======================================================  PLATFORM  ======================================================== */
#define TBMAN_PLATFORM_FPGA_Pos           (1UL)                     /*!< FPGA (Bit 1)                                          */
#define TBMAN_PLATFORM_FPGA_Msk           (0x2UL)                   /*!< FPGA (Bitfield-Mask: 0x01)                            */
#define TBMAN_PLATFORM_ASIC_Pos           (0UL)                     /*!< ASIC (Bit 0)                                          */
#define TBMAN_PLATFORM_ASIC_Msk           (0x1UL)                   /*!< ASIC (Bitfield-Mask: 0x01)                            */


