mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ===================================================  CH3_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH3_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH3_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH3_AL2_CTRL  ====================================================== */
/* ==================================================  CH3_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH3_AL2_READ_ADDR  =================================================== */
/* ================================================  CH3_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH3_AL3_CTRL  ====================================================== */
/* ==================================================  CH3_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH3_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH3_AL3_READ_ADDR_TRIG  ================================================= */
/* =====================================================  CH4_READ_ADDR  ===================================================== */
/* ====================================================  CH4_WRITE_ADDR  ===================================================== */
/* ====================================================  CH4_TRANS_COUNT  ==================================================== */
/* =====================================================  CH4_CTRL_TRIG  ===================================================== */
#define DMA_CH4_CTRL_TRIG_AHB_ERROR_Pos   (31UL)                    /*!< AHB_ERROR (Bit 31)                                    */
#define DMA_CH4_CTRL_TRIG_AHB_ERROR_Msk   (0x80000000UL)            /*!< AHB_ERROR (Bitfield-Mask: 0x01)                       */
#define DMA_CH4_CTRL_TRIG_READ_ERROR_Pos  (30UL)                    /*!< READ_ERROR (Bit 30)                                   */
#define DMA_CH4_CTRL_TRIG_READ_ERROR_Msk  (0x40000000UL)            /*!< READ_ERROR (Bitfield-Mask: 0x01)                      */
#define DMA_CH4_CTRL_TRIG_WRITE_ERROR_Pos (29UL)                    /*!< WRITE_ERROR (Bit 29)                                  */
#define DMA_CH4_CTRL_TRIG_WRITE_ERROR_Msk (0x20000000UL)            /*!< WRITE_ERROR (Bitfield-Mask: 0x01)                     */
#define DMA_CH4_CTRL_TRIG_BUSY_Pos        (24UL)                    /*!< BUSY (Bit 24)                                         */
#define DMA_CH4_CTRL_TRIG_BUSY_Msk        (0x1000000UL)             /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define DMA_CH4_CTRL_TRIG_SNIFF_EN_Pos    (23UL)                    /*!< SNIFF_EN (Bit 23)                                     */
#define DMA_CH4_CTRL_TRIG_SNIFF_EN_Msk    (0x800000UL)              /*!< SNIFF_EN (Bitfield-Mask: 0x01)                        */
#define DMA_CH4_CTRL_TRIG_BSWAP_Pos       (22UL)                    /*!< BSWAP (Bit 22)                                        */
#define DMA_CH4_CTRL_TRIG_BSWAP_Msk       (0x400000UL)              /*!< BSWAP (Bitfield-Mask: 0x01)                           */
#define DMA_CH4_CTRL_TRIG_IRQ_QUIET_Pos   (21UL)                    /*!< IRQ_QUIET (Bit 21)                                    */
#define DMA_CH4_CTRL_TRIG_IRQ_QUIET_Msk   (0x200000UL)              /*!< IRQ_QUIET (Bitfield-Mask: 0x01)                       */
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_Pos    (15UL)                    /*!< TREQ_SEL (Bit 15)                                     */
#define DMA_CH4_CTRL_TRIG_TREQ_SEL_Msk    (0x1f8000UL)              /*!< TREQ_SEL (Bitfield-Mask: 0x3f)                        */
#define DMA_CH4_CTRL_TRIG_CHAIN_TO_Pos    (11UL)                    /*!< CHAIN_TO (Bit 11)                                     */
#define DMA_CH4_CTRL_TRIG_CHAIN_TO_Msk    (0x7800UL)                /*!< CHAIN_TO (Bitfield-Mask: 0x0f)                        */
#define DMA_CH4_CTRL_TRIG_RING_SEL_Pos    (10UL)                    /*!< RING_SEL (Bit 10)                                     */
#define DMA_CH4_CTRL_TRIG_RING_SEL_Msk    (0x400UL)                 /*!< RING_SEL (Bitfield-Mask: 0x01)                        */
#define DMA_CH4_CTRL_TRIG_RING_SIZE_Pos   (6UL)                     /*!< RING_SIZE (Bit 6)                                     */
#define DMA_CH4_CTRL_TRIG_RING_SIZE_Msk   (0x3c0UL)                 /*!< RING_SIZE (Bitfield-Mask: 0x0f)                       */
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_Pos  (5UL)                     /*!< INCR_WRITE (Bit 5)                                    */
#define DMA_CH4_CTRL_TRIG_INCR_WRITE_Msk  (0x20UL)                  /*!< INCR_WRITE (Bitfield-Mask: 0x01)                      */
#define DMA_CH4_CTRL_TRIG_INCR_READ_Pos   (4UL)                     /*!< INCR_READ (Bit 4)                                     */
#define DMA_CH4_CTRL_TRIG_INCR_READ_Msk   (0x10UL)                  /*!< INCR_READ (Bitfield-Mask: 0x01)                       */
#define DMA_CH4_CTRL_TRIG_DATA_SIZE_Pos   (2UL)                     /*!< DATA_SIZE (Bit 2)                                     */
#define DMA_CH4_CTRL_TRIG_DATA_SIZE_Msk   (0xcUL)                   /*!< DATA_SIZE (Bitfield-Mask: 0x03)                       */
#define DMA_CH4_CTRL_TRIG_HIGH_PRIORITY_Pos (1UL)                   /*!< HIGH_PRIORITY (Bit 1)                                 */
#define DMA_CH4_CTRL_TRIG_HIGH_PRIORITY_Msk (0x2UL)                 /*!< HIGH_PRIORITY (Bitfield-Mask: 0x01)                   */
#define DMA_CH4_CTRL_TRIG_EN_Pos          (0UL)                     /*!< EN (Bit 0)                                            */
#define DMA_CH4_CTRL_TRIG_EN_Msk          (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =====================================================  CH4_AL1_CTRL  ====================================================== */
/* ===================================================  CH4_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH4_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH4_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH4_AL2_CTRL  ====================================================== */
/* ==================================================  CH4_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH4_AL2_READ_ADDR  =================================================== */
/* ================================================  CH4_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH4_AL3_CTRL  ====================================================== */
/* ==================================================  CH4_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH4_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH4_AL3_READ_ADDR_TRIG  ================================================= */
/* =====================================================  CH5_READ_ADDR  ===================================================== */
/* ====================================================  CH5_WRITE_ADDR  ===================================================== */
/* ====================================================  CH5_TRANS_COUNT  ==================================================== */
/* =====================================================  CH5_CTRL_TRIG  ===================================================== */
#define DMA_CH5_CTRL_TRIG_AHB_ERROR_Pos   (31UL)                    /*!< AHB_ERROR (Bit 31)                                    */
#define DMA_CH5_CTRL_TRIG_AHB_ERROR_Msk   (0x80000000UL)            /*!< AHB_ERROR (Bitfield-Mask: 0x01)                       */
#define DMA_CH5_CTRL_TRIG_READ_ERROR_Pos  (30UL)                    /*!< READ_ERROR (Bit 30)                                   */
#define DMA_CH5_CTRL_TRIG_READ_ERROR_Msk  (0x40000000UL)            /*!< READ_ERROR (Bitfield-Mask: 0x01)                      */
#define DMA_CH5_CTRL_TRIG_WRITE_ERROR_Pos (29UL)                    /*!< WRITE_ERROR (Bit 29)                                  */
#define DMA_CH5_CTRL_TRIG_WRITE_ERROR_Msk (0x20000000UL)            /*!< WRITE_ERROR (Bitfield-Mask: 0x01)                     */
#define DMA_CH5_CTRL_TRIG_BUSY_Pos        (24UL)                    /*!< BUSY (Bit 24)                                         */
#define DMA_CH5_CTRL_TRIG_BUSY_Msk        (0x1000000UL)             /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define DMA_CH5_CTRL_TRIG_SNIFF_EN_Pos    (23UL)                    /*!< SNIFF_EN (Bit 23)                                     */
#define DMA_CH5_CTRL_TRIG_SNIFF_EN_Msk    (0x800000UL)              /*!< SNIFF_EN (Bitfield-Mask: 0x01)                        */
#define DMA_CH5_CTRL_TRIG_BSWAP_Pos       (22UL)                    /*!< BSWAP (Bit 22)                                        */
#define DMA_CH5_CTRL_TRIG_BSWAP_Msk       (0x400000UL)              /*!< BSWAP (Bitfield-Mask: 0x01)                           */
#define DMA_CH5_CTRL_TRIG_IRQ_QUIET_Pos   (21UL)                    /*!< IRQ_QUIET (Bit 21)                                    */
#define DMA_CH5_CTRL_TRIG_IRQ_QUIET_Msk   (0x200000UL)              /*!< IRQ_QUIET (Bitfield-Mask: 0x01)                       */
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_Pos    (15UL)                    /*!< TREQ_SEL (Bit 15)                                     */
#define DMA_CH5_CTRL_TRIG_TREQ_SEL_Msk    (0x1f8000UL)              /*!< TREQ_SEL (Bitfield-Mask: 0x3f)                        */
#define DMA_CH5_CTRL_TRIG_CHAIN_TO_Pos    (11UL)                    /*!< CHAIN_TO (Bit 11)                                     */
#define DMA_CH5_CTRL_TRIG_CHAIN_TO_Msk    (0x7800UL)                /*!< CHAIN_TO (Bitfield-Mask: 0x0f)                        */
#define DMA_CH5_CTRL_TRIG_RING_SEL_Pos    (10UL)                    /*!< RING_SEL (Bit 10)                                     */
#define DMA_CH5_CTRL_TRIG_RING_SEL_Msk    (0x400UL)                 /*!< RING_SEL (Bitfield-Mask: 0x01)                        */
#define DMA_CH5_CTRL_TRIG_RING_SIZE_Pos   (6UL)                     /*!< RING_SIZE (Bit 6)                                     */
#define DMA_CH5_CTRL_TRIG_RING_SIZE_Msk   (0x3c0UL)                 /*!< RING_SIZE (Bitfield-Mask: 0x0f)                       */
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_Pos  (5UL)                     /*!< INCR_WRITE (Bit 5)                                    */
#define DMA_CH5_CTRL_TRIG_INCR_WRITE_Msk  (0x20UL)                  /*!< INCR_WRITE (Bitfield-Mask: 0x01)                      */
#define DMA_CH5_CTRL_TRIG_INCR_READ_Pos   (4UL)                     /*!< INCR_READ (Bit 4)                                     */
#define DMA_CH5_CTRL_TRIG_INCR_READ_Msk   (0x10UL)                  /*!< INCR_READ (Bitfield-Mask: 0x01)                       */
#define DMA_CH5_CTRL_TRIG_DATA_SIZE_Pos   (2UL)                     /*!< DATA_SIZE (Bit 2)                                     */
#define DMA_CH5_CTRL_TRIG_DATA_SIZE_Msk   (0xcUL)                   /*!< DATA_SIZE (Bitfield-Mask: 0x03)                       */
#define DMA_CH5_CTRL_TRIG_HIGH_PRIORITY_Pos (1UL)                   /*!< HIGH_PRIORITY (Bit 1)                                 */
#define DMA_CH5_CTRL_TRIG_HIGH_PRIORITY_Msk (0x2UL)                 /*!< HIGH_PRIORITY (Bitfield-Mask: 0x01)                   */
#define DMA_CH5_CTRL_TRIG_EN_Pos          (0UL)                     /*!< EN (Bit 0)                                            */
#define DMA_CH5_CTRL_TRIG_EN_Msk          (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =====================================================  CH5_AL1_CTRL  ====================================================== */
/* ===================================================  CH5_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH5_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH5_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH5_AL2_CTRL  ====================================================== */
/* ==================================================  CH5_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH5_AL2_READ_ADDR  =================================================== */
/* ================================================  CH5_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH5_AL3_CTRL  ====================================================== */
/* ==================================================  CH5_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH5_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH5_AL3_READ_ADDR_TRIG  ================================================= */
/* =====================================================  CH6_READ_ADDR  ===================================================== */
/* ====================================================  CH6_WRITE_ADDR  ===================================================== */
/* ====================================================  CH6_TRANS_COUNT  ==================================================== */
/* =====================================================  CH6_CTRL_TRIG  ===================================================== */
#define DMA_CH6_CTRL_TRIG_AHB_ERROR_Pos   (31UL)                    /*!< AHB_ERROR (Bit 31)                                    */
#define DMA_CH6_CTRL_TRIG_AHB_ERROR_Msk   (0x80000000UL)            /*!< AHB_ERROR (Bitfield-Mask: 0x01)                       */
#define DMA_CH6_CTRL_TRIG_READ_ERROR_Pos  (30UL)                    /*!< READ_ERROR (Bit 30)                                   */
#define DMA_CH6_CTRL_TRIG_READ_ERROR_Msk  (0x40000000UL)            /*!< READ_ERROR (Bitfield-Mask: 0x01)                      */
#define DMA_CH6_CTRL_TRIG_WRITE_ERROR_Pos (29UL)                    /*!< WRITE_ERROR (Bit 29)                                  */
#define DMA_CH6_CTRL_TRIG_WRITE_ERROR_Msk (0x20000000UL)            /*!< WRITE_ERROR (Bitfield-Mask: 0x01)                     */
#define DMA_CH6_CTRL_TRIG_BUSY_Pos        (24UL)                    /*!< BUSY (Bit 24)                                         */
#define DMA_CH6_CTRL_TRIG_BUSY_Msk        (0x1000000UL)             /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define DMA_CH6_CTRL_TRIG_SNIFF_EN_Pos    (23UL)                    /*!< SNIFF_EN (Bit 23)                                     */
#define DMA_CH6_CTRL_TRIG_SNIFF_EN_Msk    (0x800000UL)              /*!< SNIFF_EN (Bitfield-Mask: 0x01)                        */
#define DMA_CH6_CTRL_TRIG_BSWAP_Pos       (22UL)                    /*!< BSWAP (Bit 22)                                        */
#define DMA_CH6_CTRL_TRIG_BSWAP_Msk       (0x400000UL)              /*!< BSWAP (Bitfield-Mask: 0x01)                           */
#define DMA_CH6_CTRL_TRIG_IRQ_QUIET_Pos   (21UL)                    /*!< IRQ_QUIET (Bit 21)                                    */
#define DMA_CH6_CTRL_TRIG_IRQ_QUIET_Msk   (0x200000UL)              /*!< IRQ_QUIET (Bitfield-Mask: 0x01)                       */
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_Pos    (15UL)                    /*!< TREQ_SEL (Bit 15)                                     */
#define DMA_CH6_CTRL_TRIG_TREQ_SEL_Msk    (0x1f8000UL)              /*!< TREQ_SEL (Bitfield-Mask: 0x3f)                        */
#define DMA_CH6_CTRL_TRIG_CHAIN_TO_Pos    (11UL)                    /*!< CHAIN_TO (Bit 11)                                     */
#define DMA_CH6_CTRL_TRIG_CHAIN_TO_Msk    (0x7800UL)                /*!< CHAIN_TO (Bitfield-Mask: 0x0f)                        */
#define DMA_CH6_CTRL_TRIG_RING_SEL_Pos    (10UL)                    /*!< RING_SEL (Bit 10)                                     */
#define DMA_CH6_CTRL_TRIG_RING_SEL_Msk    (0x400UL)                 /*!< RING_SEL (Bitfield-Mask: 0x01)                        */
#define DMA_CH6_CTRL_TRIG_RING_SIZE_Pos   (6UL)                     /*!< RING_SIZE (Bit 6)                                     */
#define DMA_CH6_CTRL_TRIG_RING_SIZE_Msk   (0x3c0UL)                 /*!< RING_SIZE (Bitfield-Mask: 0x0f)                       */
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_Pos  (5UL)                     /*!< INCR_WRITE (Bit 5)                                    */
#define DMA_CH6_CTRL_TRIG_INCR_WRITE_Msk  (0x20UL)                  /*!< INCR_WRITE (Bitfield-Mask: 0x01)                      */
#define DMA_CH6_CTRL_TRIG_INCR_READ_Pos   (4UL)                     /*!< INCR_READ (Bit 4)                                     */
#define DMA_CH6_CTRL_TRIG_INCR_READ_Msk   (0x10UL)                  /*!< INCR_READ (Bitfield-Mask: 0x01)                       */
#define DMA_CH6_CTRL_TRIG_DATA_SIZE_Pos   (2UL)                     /*!< DATA_SIZE (Bit 2)                                     */
#define DMA_CH6_CTRL_TRIG_DATA_SIZE_Msk   (0xcUL)                   /*!< DATA_SIZE (Bitfield-Mask: 0x03)                       */
#define DMA_CH6_CTRL_TRIG_HIGH_PRIORITY_Pos (1UL)                   /*!< HIGH_PRIORITY (Bit 1)                                 */
#define DMA_CH6_CTRL_TRIG_HIGH_PRIORITY_Msk (0x2UL)                 /*!< HIGH_PRIORITY (Bitfield-Mask: 0x01)                   */
#define DMA_CH6_CTRL_TRIG_EN_Pos          (0UL)                     /*!< EN (Bit 0)                                            */
#define DMA_CH6_CTRL_TRIG_EN_Msk          (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =====================================================  CH6_AL1_CTRL  ====================================================== */
/* ===================================================  CH6_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH6_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH6_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH6_AL2_CTRL  ====================================================== */
/* ==================================================  CH6_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH6_AL2_READ_ADDR  =================================================== */
/* ================================================  CH6_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH6_AL3_CTRL  ====================================================== */
/* ==================================================  CH6_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH6_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH6_AL3_READ_ADDR_TRIG  ================================================= */
/* =====================================================  CH7_READ_ADDR  ===================================================== */
/* ====================================================  CH7_WRITE_ADDR  ===================================================== */
/* ====================================================  CH7_TRANS_COUNT  ==================================================== */
/* =====================================================  CH7_CTRL_TRIG  ===================================================== */
#define DMA_CH7_CTRL_TRIG_AHB_ERROR_Pos   (31UL)                    /*!< AHB_ERROR (Bit 31)                                    */
#define DMA_CH7_CTRL_TRIG_AHB_ERROR_Msk   (0x80000000UL)            /*!< AHB_ERROR (Bitfield-Mask: 0x01)                       */
#define DMA_CH7_CTRL_TRIG_READ_ERROR_Pos  (30UL)                    /*!< READ_ERROR (Bit 30)                                   */
#define DMA_CH7_CTRL_TRIG_READ_ERROR_Msk  (0x40000000UL)            /*!< READ_ERROR (Bitfield-Mask: 0x01)                      */
#define DMA_CH7_CTRL_TRIG_WRITE_ERROR_Pos (29UL)                    /*!< WRITE_ERROR (Bit 29)                                  */
#define DMA_CH7_CTRL_TRIG_WRITE_ERROR_Msk (0x20000000UL)            /*!< WRITE_ERROR (Bitfield-Mask: 0x01)                     */
#define DMA_CH7_CTRL_TRIG_BUSY_Pos        (24UL)                    /*!< BUSY (Bit 24)                                         */
#define DMA_CH7_CTRL_TRIG_BUSY_Msk        (0x1000000UL)             /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define DMA_CH7_CTRL_TRIG_SNIFF_EN_Pos    (23UL)                    /*!< SNIFF_EN (Bit 23)                                     */
#define DMA_CH7_CTRL_TRIG_SNIFF_EN_Msk    (0x800000UL)              /*!< SNIFF_EN (Bitfield-Mask: 0x01)                        */
#define DMA_CH7_CTRL_TRIG_BSWAP_Pos       (22UL)                    /*!< BSWAP (Bit 22)                                        */
#define DMA_CH7_CTRL_TRIG_BSWAP_Msk       (0x400000UL)              /*!< BSWAP (Bitfield-Mask: 0x01)                           */
#define DMA_CH7_CTRL_TRIG_IRQ_QUIET_Pos   (21UL)                    /*!< IRQ_QUIET (Bit 21)                                    */
#define DMA_CH7_CTRL_TRIG_IRQ_QUIET_Msk   (0x200000UL)              /*!< IRQ_QUIET (Bitfield-Mask: 0x01)                       */
#define DMA_CH7_CTRL_TRIG_TREQ_SEL_Pos    (15UL)                    /*!< TREQ_SEL (Bit 15)                                     */
#define DMA_CH7_CTRL_TRIG_TREQ_SEL_Msk    (0x1f8000UL)              /*!< TREQ_SEL (Bitfield-Mask: 0x3f)                        */
#define DMA_CH7_CTRL_TRIG_CHAIN_TO_Pos    (11UL)                    /*!< CHAIN_TO (Bit 11)                                     */
#define DMA_CH7_CTRL_TRIG_CHAIN_TO_Msk    (0x7800UL)                /*!< CHAIN_TO (Bitfield-Mask: 0x0f)                        */
#define DMA_CH7_CTRL_TRIG_RING_SEL_Pos    (10UL)                    /*!< RING_SEL (Bit 10)                                     */
#define DMA_CH7_CTRL_TRIG_RING_SEL_Msk    (0x400UL)                 /*!< RING_SEL (Bitfield-Mask: 0x01)                        */
#define DMA_CH7_CTRL_TRIG_RING_SIZE_Pos   (6UL)                     /*!< RING_SIZE (Bit 6)                                     */
#define DMA_CH7_CTRL_TRIG_RING_SIZE_Msk   (0x3c0UL)                 /*!< RING_SIZE (Bitfield-Mask: 0x0f)                       */
#define DMA_CH7_CTRL_TRIG_INCR_WRITE_Pos  (5UL)                     /*!< INCR_WRITE (Bit 5)                                    */
#define DMA_CH7_CTRL_TRIG_INCR_WRITE_Msk  (0x20UL)                  /*!< INCR_WRITE (Bitfield-Mask: 0x01)                      */
#define DMA_CH7_CTRL_TRIG_INCR_READ_Pos   (4UL)                     /*!< INCR_READ (Bit 4)                                     */
