mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define DMA_CH11_CTRL_TRIG_CHAIN_TO_Msk   (0x7800UL)                /*!< CHAIN_TO (Bitfield-Mask: 0x0f)                        */
#define DMA_CH11_CTRL_TRIG_RING_SEL_Pos   (10UL)                    /*!< RING_SEL (Bit 10)                                     */
#define DMA_CH11_CTRL_TRIG_RING_SEL_Msk   (0x400UL)                 /*!< RING_SEL (Bitfield-Mask: 0x01)                        */
#define DMA_CH11_CTRL_TRIG_RING_SIZE_Pos  (6UL)                     /*!< RING_SIZE (Bit 6)                                     */
#define DMA_CH11_CTRL_TRIG_RING_SIZE_Msk  (0x3c0UL)                 /*!< RING_SIZE (Bitfield-Mask: 0x0f)                       */
#define DMA_CH11_CTRL_TRIG_INCR_WRITE_Pos (5UL)                     /*!< INCR_WRITE (Bit 5)                                    */
#define DMA_CH11_CTRL_TRIG_INCR_WRITE_Msk (0x20UL)                  /*!< INCR_WRITE (Bitfield-Mask: 0x01)                      */
#define DMA_CH11_CTRL_TRIG_INCR_READ_Pos  (4UL)                     /*!< INCR_READ (Bit 4)                                     */
#define DMA_CH11_CTRL_TRIG_INCR_READ_Msk  (0x10UL)                  /*!< INCR_READ (Bitfield-Mask: 0x01)                       */
#define DMA_CH11_CTRL_TRIG_DATA_SIZE_Pos  (2UL)                     /*!< DATA_SIZE (Bit 2)                                     */
#define DMA_CH11_CTRL_TRIG_DATA_SIZE_Msk  (0xcUL)                   /*!< DATA_SIZE (Bitfield-Mask: 0x03)                       */
#define DMA_CH11_CTRL_TRIG_HIGH_PRIORITY_Pos (1UL)                  /*!< HIGH_PRIORITY (Bit 1)                                 */
#define DMA_CH11_CTRL_TRIG_HIGH_PRIORITY_Msk (0x2UL)                /*!< HIGH_PRIORITY (Bitfield-Mask: 0x01)                   */
#define DMA_CH11_CTRL_TRIG_EN_Pos         (0UL)                     /*!< EN (Bit 0)                                            */
#define DMA_CH11_CTRL_TRIG_EN_Msk         (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =====================================================  CH11_AL1_CTRL  ===================================================== */
/* ==================================================  CH11_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH11_AL1_WRITE_ADDR  ================================================== */
/* ===============================================  CH11_AL1_TRANS_COUNT_TRIG  =============================================== */
/* =====================================================  CH11_AL2_CTRL  ===================================================== */
/* =================================================  CH11_AL2_TRANS_COUNT  ================================================== */
/* ==================================================  CH11_AL2_READ_ADDR  =================================================== */
/* ===============================================  CH11_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH11_AL3_CTRL  ===================================================== */
/* ==================================================  CH11_AL3_WRITE_ADDR  ================================================== */
/* =================================================  CH11_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH11_AL3_READ_ADDR_TRIG  ================================================ */
/* =========================================================  INTR  ========================================================== */
#define DMA_INTR_INTR_Pos                 (0UL)                     /*!< INTR (Bit 0)                                          */
#define DMA_INTR_INTR_Msk                 (0xffffUL)                /*!< INTR (Bitfield-Mask: 0xffff)                          */
/* =========================================================  INTE0  ========================================================= */
#define DMA_INTE0_INTE0_Pos               (0UL)                     /*!< INTE0 (Bit 0)                                         */
#define DMA_INTE0_INTE0_Msk               (0xffffUL)                /*!< INTE0 (Bitfield-Mask: 0xffff)                         */
/* =========================================================  INTF0  ========================================================= */
#define DMA_INTF0_INTF0_Pos               (0UL)                     /*!< INTF0 (Bit 0)                                         */
#define DMA_INTF0_INTF0_Msk               (0xffffUL)                /*!< INTF0 (Bitfield-Mask: 0xffff)                         */
/* =========================================================  INTS0  ========================================================= */
#define DMA_INTS0_INTS0_Pos               (0UL)                     /*!< INTS0 (Bit 0)                                         */
#define DMA_INTS0_INTS0_Msk               (0xffffUL)                /*!< INTS0 (Bitfield-Mask: 0xffff)                         */
/* =========================================================  INTE1  ========================================================= */
#define DMA_INTE1_INTE1_Pos               (0UL)                     /*!< INTE1 (Bit 0)                                         */
#define DMA_INTE1_INTE1_Msk               (0xffffUL)                /*!< INTE1 (Bitfield-Mask: 0xffff)                         */
/* =========================================================  INTF1  ========================================================= */
#define DMA_INTF1_INTF1_Pos               (0UL)                     /*!< INTF1 (Bit 0)                                         */
#define DMA_INTF1_INTF1_Msk               (0xffffUL)                /*!< INTF1 (Bitfield-Mask: 0xffff)                         */
/* =========================================================  INTS1  ========================================================= */
#define DMA_INTS1_INTS1_Pos               (0UL)                     /*!< INTS1 (Bit 0)                                         */
#define DMA_INTS1_INTS1_Msk               (0xffffUL)                /*!< INTS1 (Bitfield-Mask: 0xffff)                         */
/* ========================================================  TIMER0  ========================================================= */
#define DMA_TIMER0_X_Pos                  (16UL)                    /*!< X (Bit 16)                                            */
#define DMA_TIMER0_X_Msk                  (0xffff0000UL)            /*!< X (Bitfield-Mask: 0xffff)                             */
#define DMA_TIMER0_Y_Pos                  (0UL)                     /*!< Y (Bit 0)                                             */
#define DMA_TIMER0_Y_Msk                  (0xffffUL)                /*!< Y (Bitfield-Mask: 0xffff)                             */
/* ========================================================  TIMER1  ========================================================= */
#define DMA_TIMER1_X_Pos                  (16UL)                    /*!< X (Bit 16)                                            */
#define DMA_TIMER1_X_Msk                  (0xffff0000UL)            /*!< X (Bitfield-Mask: 0xffff)                             */
#define DMA_TIMER1_Y_Pos                  (0UL)                     /*!< Y (Bit 0)                                             */
#define DMA_TIMER1_Y_Msk                  (0xffffUL)                /*!< Y (Bitfield-Mask: 0xffff)                             */
/* ========================================================  TIMER2  ========================================================= */
#define DMA_TIMER2_X_Pos                  (16UL)                    /*!< X (Bit 16)                                            */
#define DMA_TIMER2_X_Msk                  (0xffff0000UL)            /*!< X (Bitfield-Mask: 0xffff)                             */
#define DMA_TIMER2_Y_Pos                  (0UL)                     /*!< Y (Bit 0)                                             */
#define DMA_TIMER2_Y_Msk                  (0xffffUL)                /*!< Y (Bitfield-Mask: 0xffff)                             */
/* ========================================================  TIMER3  ========================================================= */
#define DMA_TIMER3_X_Pos                  (16UL)                    /*!< X (Bit 16)                                            */
#define DMA_TIMER3_X_Msk                  (0xffff0000UL)            /*!< X (Bitfield-Mask: 0xffff)                             */
#define DMA_TIMER3_Y_Pos                  (0UL)                     /*!< Y (Bit 0)                                             */
#define DMA_TIMER3_Y_Msk                  (0xffffUL)                /*!< Y (Bitfield-Mask: 0xffff)                             */
/* ==================================================  MULTI_CHAN_TRIGGER  =================================================== */
#define DMA_MULTI_CHAN_TRIGGER_MULTI_CHAN_TRIGGER_Pos (0UL)         /*!< MULTI_CHAN_TRIGGER (Bit 0)                            */
#define DMA_MULTI_CHAN_TRIGGER_MULTI_CHAN_TRIGGER_Msk (0xffffUL)    /*!< MULTI_CHAN_TRIGGER (Bitfield-Mask: 0xffff)            */
/* ======================================================  SNIFF_CTRL  ======================================================= */
#define DMA_SNIFF_CTRL_OUT_INV_Pos        (11UL)                    /*!< OUT_INV (Bit 11)                                      */
#define DMA_SNIFF_CTRL_OUT_INV_Msk        (0x800UL)                 /*!< OUT_INV (Bitfield-Mask: 0x01)                         */
#define DMA_SNIFF_CTRL_OUT_REV_Pos        (10UL)                    /*!< OUT_REV (Bit 10)                                      */
#define DMA_SNIFF_CTRL_OUT_REV_Msk        (0x400UL)                 /*!< OUT_REV (Bitfield-Mask: 0x01)                         */
#define DMA_SNIFF_CTRL_BSWAP_Pos          (9UL)                     /*!< BSWAP (Bit 9)                                         */
#define DMA_SNIFF_CTRL_BSWAP_Msk          (0x200UL)                 /*!< BSWAP (Bitfield-Mask: 0x01)                           */
#define DMA_SNIFF_CTRL_CALC_Pos           (5UL)                     /*!< CALC (Bit 5)                                          */
#define DMA_SNIFF_CTRL_CALC_Msk           (0x1e0UL)                 /*!< CALC (Bitfield-Mask: 0x0f)                            */
#define DMA_SNIFF_CTRL_DMACH_Pos          (1UL)                     /*!< DMACH (Bit 1)                                         */
#define DMA_SNIFF_CTRL_DMACH_Msk          (0x1eUL)                  /*!< DMACH (Bitfield-Mask: 0x0f)                           */
#define DMA_SNIFF_CTRL_EN_Pos             (0UL)                     /*!< EN (Bit 0)                                            */
#define DMA_SNIFF_CTRL_EN_Msk             (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ======================================================  SNIFF_DATA  ======================================================= */
/* ======================================================  FIFO_LEVELS  ====================================================== */
#define DMA_FIFO_LEVELS_RAF_LVL_Pos       (16UL)                    /*!< RAF_LVL (Bit 16)                                      */
#define DMA_FIFO_LEVELS_RAF_LVL_Msk       (0xff0000UL)              /*!< RAF_LVL (Bitfield-Mask: 0xff)                         */
#define DMA_FIFO_LEVELS_WAF_LVL_Pos       (8UL)                     /*!< WAF_LVL (Bit 8)                                       */
#define DMA_FIFO_LEVELS_WAF_LVL_Msk       (0xff00UL)                /*!< WAF_LVL (Bitfield-Mask: 0xff)                         */
#define DMA_FIFO_LEVELS_TDF_LVL_Pos       (0UL)                     /*!< TDF_LVL (Bit 0)                                       */
#define DMA_FIFO_LEVELS_TDF_LVL_Msk       (0xffUL)                  /*!< TDF_LVL (Bitfield-Mask: 0xff)                         */
/* ======================================================  CHAN_ABORT  ======================================================= */
#define DMA_CHAN_ABORT_CHAN_ABORT_Pos     (0UL)                     /*!< CHAN_ABORT (Bit 0)                                    */
#define DMA_CHAN_ABORT_CHAN_ABORT_Msk     (0xffffUL)                /*!< CHAN_ABORT (Bitfield-Mask: 0xffff)                    */
/* ======================================================  N_CHANNELS  ======================================================= */
#define DMA_N_CHANNELS_N_CHANNELS_Pos     (0UL)                     /*!< N_CHANNELS (Bit 0)                                    */
#define DMA_N_CHANNELS_N_CHANNELS_Msk     (0x1fUL)                  /*!< N_CHANNELS (Bitfield-Mask: 0x1f)                      */
/* ====================================================  CH0_DBG_CTDREQ  ===================================================== */
#define DMA_CH0_DBG_CTDREQ_CH0_DBG_CTDREQ_Pos (0UL)                 /*!< CH0_DBG_CTDREQ (Bit 0)                                */
#define DMA_CH0_DBG_CTDREQ_CH0_DBG_CTDREQ_Msk (0x3fUL)              /*!< CH0_DBG_CTDREQ (Bitfield-Mask: 0x3f)                  */
/* ======================================================  CH0_DBG_TCR  ====================================================== */
/* ====================================================  CH1_DBG_CTDREQ  ===================================================== */
#define DMA_CH1_DBG_CTDREQ_CH1_DBG_CTDREQ_Pos (0UL)                 /*!< CH1_DBG_CTDREQ (Bit 0)                                */
#define DMA_CH1_DBG_CTDREQ_CH1_DBG_CTDREQ_Msk (0x3fUL)              /*!< CH1_DBG_CTDREQ (Bitfield-Mask: 0x3f)                  */
/* ======================================================  CH1_DBG_TCR  ====================================================== */
/* ====================================================  CH2_DBG_CTDREQ  ===================================================== */
#define DMA_CH2_DBG_CTDREQ_CH2_DBG_CTDREQ_Pos (0UL)                 /*!< CH2_DBG_CTDREQ (Bit 0)                                */
#define DMA_CH2_DBG_CTDREQ_CH2_DBG_CTDREQ_Msk (0x3fUL)              /*!< CH2_DBG_CTDREQ (Bitfield-Mask: 0x3f)                  */
/* ======================================================  CH2_DBG_TCR  ====================================================== */
/* ====================================================  CH3_DBG_CTDREQ  ===================================================== */
#define DMA_CH3_DBG_CTDREQ_CH3_DBG_CTDREQ_Pos (0UL)                 /*!< CH3_DBG_CTDREQ (Bit 0)                                */
#define DMA_CH3_DBG_CTDREQ_CH3_DBG_CTDREQ_Msk (0x3fUL)              /*!< CH3_DBG_CTDREQ (Bitfield-Mask: 0x3f)                  */
/* ======================================================  CH3_DBG_TCR  ====================================================== */
/* ====================================================  CH4_DBG_CTDREQ  ===================================================== */
#define DMA_CH4_DBG_CTDREQ_CH4_DBG_CTDREQ_Pos (0UL)                 /*!< CH4_DBG_CTDREQ (Bit 0)                                */
#define DMA_CH4_DBG_CTDREQ_CH4_DBG_CTDREQ_Msk (0x3fUL)              /*!< CH4_DBG_CTDREQ (Bitfield-Mask: 0x3f)                  */
/* ======================================================  CH4_DBG_TCR  ====================================================== */
/* ====================================================  CH5_DBG_CTDREQ  ===================================================== */
#define DMA_CH5_DBG_CTDREQ_CH5_DBG_CTDREQ_Pos (0UL)                 /*!< CH5_DBG_CTDREQ (Bit 0)                                */
#define DMA_CH5_DBG_CTDREQ_CH5_DBG_CTDREQ_Msk (0x3fUL)              /*!< CH5_DBG_CTDREQ (Bitfield-Mask: 0x3f)                  */
/* ======================================================  CH5_DBG_TCR  ====================================================== */
/* ====================================================  CH6_DBG_CTDREQ  ===================================================== */
#define DMA_CH6_DBG_CTDREQ_CH6_DBG_CTDREQ_Pos (0UL)                 /*!< CH6_DBG_CTDREQ (Bit 0)                                */
#define DMA_CH6_DBG_CTDREQ_CH6_DBG_CTDREQ_Msk (0x3fUL)              /*!< CH6_DBG_CTDREQ (Bitfield-Mask: 0x3f)                  */
/* ======================================================  CH6_DBG_TCR  ====================================================== */
/* ====================================================  CH7_DBG_CTDREQ  ===================================================== */
#define DMA_CH7_DBG_CTDREQ_CH7_DBG_CTDREQ_Pos (0UL)                 /*!< CH7_DBG_CTDREQ (Bit 0)                                */
#define DMA_CH7_DBG_CTDREQ_CH7_DBG_CTDREQ_Msk (0x3fUL)              /*!< CH7_DBG_CTDREQ (Bitfield-Mask: 0x3f)                  */
/* ======================================================  CH7_DBG_TCR  ====================================================== */
/* ====================================================  CH8_DBG_CTDREQ  ===================================================== */
#define DMA_CH8_DBG_CTDREQ_CH8_DBG_CTDREQ_Pos (0UL)                 /*!< CH8_DBG_CTDREQ (Bit 0)                                */
#define DMA_CH8_DBG_CTDREQ_CH8_DBG_CTDREQ_Msk (0x3fUL)              /*!< CH8_DBG_CTDREQ (Bitfield-Mask: 0x3f)                  */
/* ======================================================  CH8_DBG_TCR  ====================================================== */
/* ====================================================  CH9_DBG_CTDREQ  ===================================================== */
#define DMA_CH9_DBG_CTDREQ_CH9_DBG_CTDREQ_Pos (0UL)                 /*!< CH9_DBG_CTDREQ (Bit 0)                                */
#define DMA_CH9_DBG_CTDREQ_CH9_DBG_CTDREQ_Msk (0x3fUL)              /*!< CH9_DBG_CTDREQ (Bitfield-Mask: 0x3f)                  */
/* ======================================================  CH9_DBG_TCR  ====================================================== */
/* ====================================================  CH10_DBG_CTDREQ  ==================================================== */
#define DMA_CH10_DBG_CTDREQ_CH10_DBG_CTDREQ_Pos (0UL)               /*!< CH10_DBG_CTDREQ (Bit 0)                               */
#define DMA_CH10_DBG_CTDREQ_CH10_DBG_CTDREQ_Msk (0x3fUL)            /*!< CH10_DBG_CTDREQ (Bitfield-Mask: 0x3f)                 */
/* =====================================================  CH10_DBG_TCR  ====================================================== */
/* ====================================================  CH11_DBG_CTDREQ  ==================================================== */
#define DMA_CH11_DBG_CTDREQ_CH11_DBG_CTDREQ_Pos (0UL)               /*!< CH11_DBG_CTDREQ (Bit 0)                               */
#define DMA_CH11_DBG_CTDREQ_CH11_DBG_CTDREQ_Msk (0x3fUL)            /*!< CH11_DBG_CTDREQ (Bitfield-Mask: 0x3f)                 */
/* =====================================================  CH11_DBG_TCR  ====================================================== */


/* =========================================================================================================================== */
/* ================                                       USBCTRL_DPRAM                                       ================ */
/* =========================================================================================================================== */

