mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =======================================================  ADDR_ENDP  ======================================================= */
#define USBCTRL_REGS_ADDR_ENDP_ENDPOINT_Pos (16UL)                  /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP_ENDPOINT_Msk (0xf0000UL)             /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP_ADDRESS_Pos (0UL)                    /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP_ADDRESS_Msk (0x7fUL)                 /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP1  ======================================================= */
#define USBCTRL_REGS_ADDR_ENDP1_INTEP_PREAMBLE_Pos (26UL)           /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP1_INTEP_PREAMBLE_Msk (0x4000000UL)    /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP1_INTEP_DIR_Pos (25UL)                /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP1_INTEP_DIR_Msk (0x2000000UL)         /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP1_ENDPOINT_Pos (16UL)                 /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP1_ENDPOINT_Msk (0xf0000UL)            /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP1_ADDRESS_Pos (0UL)                   /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP1_ADDRESS_Msk (0x7fUL)                /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP2  ======================================================= */
#define USBCTRL_REGS_ADDR_ENDP2_INTEP_PREAMBLE_Pos (26UL)           /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP2_INTEP_PREAMBLE_Msk (0x4000000UL)    /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP2_INTEP_DIR_Pos (25UL)                /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP2_INTEP_DIR_Msk (0x2000000UL)         /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP2_ENDPOINT_Pos (16UL)                 /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP2_ENDPOINT_Msk (0xf0000UL)            /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP2_ADDRESS_Pos (0UL)                   /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP2_ADDRESS_Msk (0x7fUL)                /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP3  ======================================================= */
#define USBCTRL_REGS_ADDR_ENDP3_INTEP_PREAMBLE_Pos (26UL)           /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP3_INTEP_PREAMBLE_Msk (0x4000000UL)    /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP3_INTEP_DIR_Pos (25UL)                /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP3_INTEP_DIR_Msk (0x2000000UL)         /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP3_ENDPOINT_Pos (16UL)                 /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP3_ENDPOINT_Msk (0xf0000UL)            /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP3_ADDRESS_Pos (0UL)                   /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP3_ADDRESS_Msk (0x7fUL)                /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP4  ======================================================= */
#define USBCTRL_REGS_ADDR_ENDP4_INTEP_PREAMBLE_Pos (26UL)           /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP4_INTEP_PREAMBLE_Msk (0x4000000UL)    /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP4_INTEP_DIR_Pos (25UL)                /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP4_INTEP_DIR_Msk (0x2000000UL)         /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP4_ENDPOINT_Pos (16UL)                 /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP4_ENDPOINT_Msk (0xf0000UL)            /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP4_ADDRESS_Pos (0UL)                   /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP4_ADDRESS_Msk (0x7fUL)                /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP5  ======================================================= */
#define USBCTRL_REGS_ADDR_ENDP5_INTEP_PREAMBLE_Pos (26UL)           /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP5_INTEP_PREAMBLE_Msk (0x4000000UL)    /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP5_INTEP_DIR_Pos (25UL)                /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP5_INTEP_DIR_Msk (0x2000000UL)         /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP5_ENDPOINT_Pos (16UL)                 /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP5_ENDPOINT_Msk (0xf0000UL)            /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP5_ADDRESS_Pos (0UL)                   /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP5_ADDRESS_Msk (0x7fUL)                /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP6  ======================================================= */
#define USBCTRL_REGS_ADDR_ENDP6_INTEP_PREAMBLE_Pos (26UL)           /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP6_INTEP_PREAMBLE_Msk (0x4000000UL)    /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP6_INTEP_DIR_Pos (25UL)                /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP6_INTEP_DIR_Msk (0x2000000UL)         /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP6_ENDPOINT_Pos (16UL)                 /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP6_ENDPOINT_Msk (0xf0000UL)            /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP6_ADDRESS_Pos (0UL)                   /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP6_ADDRESS_Msk (0x7fUL)                /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP7  ======================================================= */
#define USBCTRL_REGS_ADDR_ENDP7_INTEP_PREAMBLE_Pos (26UL)           /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP7_INTEP_PREAMBLE_Msk (0x4000000UL)    /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP7_INTEP_DIR_Pos (25UL)                /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP7_INTEP_DIR_Msk (0x2000000UL)         /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP7_ENDPOINT_Pos (16UL)                 /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP7_ENDPOINT_Msk (0xf0000UL)            /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP7_ADDRESS_Pos (0UL)                   /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP7_ADDRESS_Msk (0x7fUL)                /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP8  ======================================================= */
#define USBCTRL_REGS_ADDR_ENDP8_INTEP_PREAMBLE_Pos (26UL)           /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP8_INTEP_PREAMBLE_Msk (0x4000000UL)    /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP8_INTEP_DIR_Pos (25UL)                /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP8_INTEP_DIR_Msk (0x2000000UL)         /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP8_ENDPOINT_Pos (16UL)                 /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP8_ENDPOINT_Msk (0xf0000UL)            /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP8_ADDRESS_Pos (0UL)                   /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP8_ADDRESS_Msk (0x7fUL)                /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP9  ======================================================= */
#define USBCTRL_REGS_ADDR_ENDP9_INTEP_PREAMBLE_Pos (26UL)           /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP9_INTEP_PREAMBLE_Msk (0x4000000UL)    /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP9_INTEP_DIR_Pos (25UL)                /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP9_INTEP_DIR_Msk (0x2000000UL)         /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP9_ENDPOINT_Pos (16UL)                 /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP9_ENDPOINT_Msk (0xf0000UL)            /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP9_ADDRESS_Pos (0UL)                   /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP9_ADDRESS_Msk (0x7fUL)                /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP10  ====================================================== */
#define USBCTRL_REGS_ADDR_ENDP10_INTEP_PREAMBLE_Pos (26UL)          /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP10_INTEP_PREAMBLE_Msk (0x4000000UL)   /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP10_INTEP_DIR_Pos (25UL)               /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP10_INTEP_DIR_Msk (0x2000000UL)        /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP10_ENDPOINT_Pos (16UL)                /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP10_ENDPOINT_Msk (0xf0000UL)           /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP10_ADDRESS_Pos (0UL)                  /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP10_ADDRESS_Msk (0x7fUL)               /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP11  ====================================================== */
#define USBCTRL_REGS_ADDR_ENDP11_INTEP_PREAMBLE_Pos (26UL)          /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP11_INTEP_PREAMBLE_Msk (0x4000000UL)   /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP11_INTEP_DIR_Pos (25UL)               /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP11_INTEP_DIR_Msk (0x2000000UL)        /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP11_ENDPOINT_Pos (16UL)                /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP11_ENDPOINT_Msk (0xf0000UL)           /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP11_ADDRESS_Pos (0UL)                  /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP11_ADDRESS_Msk (0x7fUL)               /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP12  ====================================================== */
#define USBCTRL_REGS_ADDR_ENDP12_INTEP_PREAMBLE_Pos (26UL)          /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP12_INTEP_PREAMBLE_Msk (0x4000000UL)   /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP12_INTEP_DIR_Pos (25UL)               /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP12_INTEP_DIR_Msk (0x2000000UL)        /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP12_ENDPOINT_Pos (16UL)                /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP12_ENDPOINT_Msk (0xf0000UL)           /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP12_ADDRESS_Pos (0UL)                  /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP12_ADDRESS_Msk (0x7fUL)               /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP13  ====================================================== */
#define USBCTRL_REGS_ADDR_ENDP13_INTEP_PREAMBLE_Pos (26UL)          /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP13_INTEP_PREAMBLE_Msk (0x4000000UL)   /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP13_INTEP_DIR_Pos (25UL)               /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP13_INTEP_DIR_Msk (0x2000000UL)        /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP13_ENDPOINT_Pos (16UL)                /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP13_ENDPOINT_Msk (0xf0000UL)           /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP13_ADDRESS_Pos (0UL)                  /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP13_ADDRESS_Msk (0x7fUL)               /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP14  ====================================================== */
#define USBCTRL_REGS_ADDR_ENDP14_INTEP_PREAMBLE_Pos (26UL)          /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP14_INTEP_PREAMBLE_Msk (0x4000000UL)   /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP14_INTEP_DIR_Pos (25UL)               /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP14_INTEP_DIR_Msk (0x2000000UL)        /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP14_ENDPOINT_Pos (16UL)                /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP14_ENDPOINT_Msk (0xf0000UL)           /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP14_ADDRESS_Pos (0UL)                  /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP14_ADDRESS_Msk (0x7fUL)               /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* ======================================================  ADDR_ENDP15  ====================================================== */
#define USBCTRL_REGS_ADDR_ENDP15_INTEP_PREAMBLE_Pos (26UL)          /*!< INTEP_PREAMBLE (Bit 26)                               */
#define USBCTRL_REGS_ADDR_ENDP15_INTEP_PREAMBLE_Msk (0x4000000UL)   /*!< INTEP_PREAMBLE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_ADDR_ENDP15_INTEP_DIR_Pos (25UL)               /*!< INTEP_DIR (Bit 25)                                    */
#define USBCTRL_REGS_ADDR_ENDP15_INTEP_DIR_Msk (0x2000000UL)        /*!< INTEP_DIR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_ADDR_ENDP15_ENDPOINT_Pos (16UL)                /*!< ENDPOINT (Bit 16)                                     */
#define USBCTRL_REGS_ADDR_ENDP15_ENDPOINT_Msk (0xf0000UL)           /*!< ENDPOINT (Bitfield-Mask: 0x0f)                        */
#define USBCTRL_REGS_ADDR_ENDP15_ADDRESS_Pos (0UL)                  /*!< ADDRESS (Bit 0)                                       */
#define USBCTRL_REGS_ADDR_ENDP15_ADDRESS_Msk (0x7fUL)               /*!< ADDRESS (Bitfield-Mask: 0x7f)                         */
/* =======================================================  MAIN_CTRL  ======================================================= */
#define USBCTRL_REGS_MAIN_CTRL_SIM_TIMING_Pos (31UL)                /*!< SIM_TIMING (Bit 31)                                   */
#define USBCTRL_REGS_MAIN_CTRL_SIM_TIMING_Msk (0x80000000UL)        /*!< SIM_TIMING (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_MAIN_CTRL_HOST_NDEVICE_Pos (1UL)               /*!< HOST_NDEVICE (Bit 1)                                  */
#define USBCTRL_REGS_MAIN_CTRL_HOST_NDEVICE_Msk (0x2UL)             /*!< HOST_NDEVICE (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_MAIN_CTRL_CONTROLLER_EN_Pos (0UL)              /*!< CONTROLLER_EN (Bit 0)                                 */
#define USBCTRL_REGS_MAIN_CTRL_CONTROLLER_EN_Msk (0x1UL)            /*!< CONTROLLER_EN (Bitfield-Mask: 0x01)                   */
/* ========================================================  SOF_WR  ========================================================= */
#define USBCTRL_REGS_SOF_WR_COUNT_Pos     (0UL)                     /*!< COUNT (Bit 0)                                         */
#define USBCTRL_REGS_SOF_WR_COUNT_Msk     (0x7ffUL)                 /*!< COUNT (Bitfield-Mask: 0x7ff)                          */
/* ========================================================  SOF_RD  ========================================================= */
#define USBCTRL_REGS_SOF_RD_COUNT_Pos     (0UL)                     /*!< COUNT (Bit 0)                                         */
#define USBCTRL_REGS_SOF_RD_COUNT_Msk     (0x7ffUL)                 /*!< COUNT (Bitfield-Mask: 0x7ff)                          */
/* =======================================================  SIE_CTRL  ======================================================== */
#define USBCTRL_REGS_SIE_CTRL_EP0_INT_STALL_Pos (31UL)              /*!< EP0_INT_STALL (Bit 31)                                */
#define USBCTRL_REGS_SIE_CTRL_EP0_INT_STALL_Msk (0x80000000UL)      /*!< EP0_INT_STALL (Bitfield-Mask: 0x01)                   */
#define USBCTRL_REGS_SIE_CTRL_EP0_DOUBLE_BUF_Pos (30UL)             /*!< EP0_DOUBLE_BUF (Bit 30)                               */
#define USBCTRL_REGS_SIE_CTRL_EP0_DOUBLE_BUF_Msk (0x40000000UL)     /*!< EP0_DOUBLE_BUF (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_SIE_CTRL_EP0_INT_1BUF_Pos (29UL)               /*!< EP0_INT_1BUF (Bit 29)                                 */
#define USBCTRL_REGS_SIE_CTRL_EP0_INT_1BUF_Msk (0x20000000UL)       /*!< EP0_INT_1BUF (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_SIE_CTRL_EP0_INT_2BUF_Pos (28UL)               /*!< EP0_INT_2BUF (Bit 28)                                 */
#define USBCTRL_REGS_SIE_CTRL_EP0_INT_2BUF_Msk (0x10000000UL)       /*!< EP0_INT_2BUF (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_SIE_CTRL_EP0_INT_NAK_Pos (27UL)                /*!< EP0_INT_NAK (Bit 27)                                  */
#define USBCTRL_REGS_SIE_CTRL_EP0_INT_NAK_Msk (0x8000000UL)         /*!< EP0_INT_NAK (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_SIE_CTRL_DIRECT_EN_Pos (26UL)                  /*!< DIRECT_EN (Bit 26)                                    */
#define USBCTRL_REGS_SIE_CTRL_DIRECT_EN_Msk (0x4000000UL)           /*!< DIRECT_EN (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_CTRL_DIRECT_DP_Pos (25UL)                  /*!< DIRECT_DP (Bit 25)                                    */
#define USBCTRL_REGS_SIE_CTRL_DIRECT_DP_Msk (0x2000000UL)           /*!< DIRECT_DP (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_CTRL_DIRECT_DM_Pos (24UL)                  /*!< DIRECT_DM (Bit 24)                                    */
#define USBCTRL_REGS_SIE_CTRL_DIRECT_DM_Msk (0x1000000UL)           /*!< DIRECT_DM (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_CTRL_TRANSCEIVER_PD_Pos (18UL)             /*!< TRANSCEIVER_PD (Bit 18)                               */
#define USBCTRL_REGS_SIE_CTRL_TRANSCEIVER_PD_Msk (0x40000UL)        /*!< TRANSCEIVER_PD (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_SIE_CTRL_RPU_OPT_Pos (17UL)                    /*!< RPU_OPT (Bit 17)                                      */
#define USBCTRL_REGS_SIE_CTRL_RPU_OPT_Msk (0x20000UL)               /*!< RPU_OPT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_SIE_CTRL_PULLUP_EN_Pos (16UL)                  /*!< PULLUP_EN (Bit 16)                                    */
#define USBCTRL_REGS_SIE_CTRL_PULLUP_EN_Msk (0x10000UL)             /*!< PULLUP_EN (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_CTRL_PULLDOWN_EN_Pos (15UL)                /*!< PULLDOWN_EN (Bit 15)                                  */
#define USBCTRL_REGS_SIE_CTRL_PULLDOWN_EN_Msk (0x8000UL)            /*!< PULLDOWN_EN (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_SIE_CTRL_RESET_BUS_Pos (13UL)                  /*!< RESET_BUS (Bit 13)                                    */
#define USBCTRL_REGS_SIE_CTRL_RESET_BUS_Msk (0x2000UL)              /*!< RESET_BUS (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_CTRL_RESUME_Pos  (12UL)                    /*!< RESUME (Bit 12)                                       */
#define USBCTRL_REGS_SIE_CTRL_RESUME_Msk  (0x1000UL)                /*!< RESUME (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_SIE_CTRL_VBUS_EN_Pos (11UL)                    /*!< VBUS_EN (Bit 11)                                      */
#define USBCTRL_REGS_SIE_CTRL_VBUS_EN_Msk (0x800UL)                 /*!< VBUS_EN (Bitfield-Mask: 0x01)                         */
