mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define USBCTRL_REGS_SIE_CTRL_KEEP_ALIVE_EN_Pos (10UL)              /*!< KEEP_ALIVE_EN (Bit 10)                                */
#define USBCTRL_REGS_SIE_CTRL_KEEP_ALIVE_EN_Msk (0x400UL)           /*!< KEEP_ALIVE_EN (Bitfield-Mask: 0x01)                   */
#define USBCTRL_REGS_SIE_CTRL_SOF_EN_Pos  (9UL)                     /*!< SOF_EN (Bit 9)                                        */
#define USBCTRL_REGS_SIE_CTRL_SOF_EN_Msk  (0x200UL)                 /*!< SOF_EN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_SIE_CTRL_SOF_SYNC_Pos (8UL)                    /*!< SOF_SYNC (Bit 8)                                      */
#define USBCTRL_REGS_SIE_CTRL_SOF_SYNC_Msk (0x100UL)                /*!< SOF_SYNC (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_SIE_CTRL_PREAMBLE_EN_Pos (6UL)                 /*!< PREAMBLE_EN (Bit 6)                                   */
#define USBCTRL_REGS_SIE_CTRL_PREAMBLE_EN_Msk (0x40UL)              /*!< PREAMBLE_EN (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_SIE_CTRL_STOP_TRANS_Pos (4UL)                  /*!< STOP_TRANS (Bit 4)                                    */
#define USBCTRL_REGS_SIE_CTRL_STOP_TRANS_Msk (0x10UL)               /*!< STOP_TRANS (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_SIE_CTRL_RECEIVE_DATA_Pos (3UL)                /*!< RECEIVE_DATA (Bit 3)                                  */
#define USBCTRL_REGS_SIE_CTRL_RECEIVE_DATA_Msk (0x8UL)              /*!< RECEIVE_DATA (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_SIE_CTRL_SEND_DATA_Pos (2UL)                   /*!< SEND_DATA (Bit 2)                                     */
#define USBCTRL_REGS_SIE_CTRL_SEND_DATA_Msk (0x4UL)                 /*!< SEND_DATA (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_CTRL_SEND_SETUP_Pos (1UL)                  /*!< SEND_SETUP (Bit 1)                                    */
#define USBCTRL_REGS_SIE_CTRL_SEND_SETUP_Msk (0x2UL)                /*!< SEND_SETUP (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_SIE_CTRL_START_TRANS_Pos (0UL)                 /*!< START_TRANS (Bit 0)                                   */
#define USBCTRL_REGS_SIE_CTRL_START_TRANS_Msk (0x1UL)               /*!< START_TRANS (Bitfield-Mask: 0x01)                     */
/* ======================================================  SIE_STATUS  ======================================================= */
#define USBCTRL_REGS_SIE_STATUS_DATA_SEQ_ERROR_Pos (31UL)           /*!< DATA_SEQ_ERROR (Bit 31)                               */
#define USBCTRL_REGS_SIE_STATUS_DATA_SEQ_ERROR_Msk (0x80000000UL)   /*!< DATA_SEQ_ERROR (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_SIE_STATUS_ACK_REC_Pos (30UL)                  /*!< ACK_REC (Bit 30)                                      */
#define USBCTRL_REGS_SIE_STATUS_ACK_REC_Msk (0x40000000UL)          /*!< ACK_REC (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_SIE_STATUS_STALL_REC_Pos (29UL)                /*!< STALL_REC (Bit 29)                                    */
#define USBCTRL_REGS_SIE_STATUS_STALL_REC_Msk (0x20000000UL)        /*!< STALL_REC (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_STATUS_NAK_REC_Pos (28UL)                  /*!< NAK_REC (Bit 28)                                      */
#define USBCTRL_REGS_SIE_STATUS_NAK_REC_Msk (0x10000000UL)          /*!< NAK_REC (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_SIE_STATUS_RX_TIMEOUT_Pos (27UL)               /*!< RX_TIMEOUT (Bit 27)                                   */
#define USBCTRL_REGS_SIE_STATUS_RX_TIMEOUT_Msk (0x8000000UL)        /*!< RX_TIMEOUT (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_SIE_STATUS_RX_OVERFLOW_Pos (26UL)              /*!< RX_OVERFLOW (Bit 26)                                  */
#define USBCTRL_REGS_SIE_STATUS_RX_OVERFLOW_Msk (0x4000000UL)       /*!< RX_OVERFLOW (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_SIE_STATUS_BIT_STUFF_ERROR_Pos (25UL)          /*!< BIT_STUFF_ERROR (Bit 25)                              */
#define USBCTRL_REGS_SIE_STATUS_BIT_STUFF_ERROR_Msk (0x2000000UL)   /*!< BIT_STUFF_ERROR (Bitfield-Mask: 0x01)                 */
#define USBCTRL_REGS_SIE_STATUS_CRC_ERROR_Pos (24UL)                /*!< CRC_ERROR (Bit 24)                                    */
#define USBCTRL_REGS_SIE_STATUS_CRC_ERROR_Msk (0x1000000UL)         /*!< CRC_ERROR (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_STATUS_BUS_RESET_Pos (19UL)                /*!< BUS_RESET (Bit 19)                                    */
#define USBCTRL_REGS_SIE_STATUS_BUS_RESET_Msk (0x80000UL)           /*!< BUS_RESET (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_STATUS_TRANS_COMPLETE_Pos (18UL)           /*!< TRANS_COMPLETE (Bit 18)                               */
#define USBCTRL_REGS_SIE_STATUS_TRANS_COMPLETE_Msk (0x40000UL)      /*!< TRANS_COMPLETE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_SIE_STATUS_SETUP_REC_Pos (17UL)                /*!< SETUP_REC (Bit 17)                                    */
#define USBCTRL_REGS_SIE_STATUS_SETUP_REC_Msk (0x20000UL)           /*!< SETUP_REC (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_STATUS_CONNECTED_Pos (16UL)                /*!< CONNECTED (Bit 16)                                    */
#define USBCTRL_REGS_SIE_STATUS_CONNECTED_Msk (0x10000UL)           /*!< CONNECTED (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_STATUS_RESUME_Pos (11UL)                   /*!< RESUME (Bit 11)                                       */
#define USBCTRL_REGS_SIE_STATUS_RESUME_Msk (0x800UL)                /*!< RESUME (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_SIE_STATUS_VBUS_OVER_CURR_Pos (10UL)           /*!< VBUS_OVER_CURR (Bit 10)                               */
#define USBCTRL_REGS_SIE_STATUS_VBUS_OVER_CURR_Msk (0x400UL)        /*!< VBUS_OVER_CURR (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_SIE_STATUS_SPEED_Pos (8UL)                     /*!< SPEED (Bit 8)                                         */
#define USBCTRL_REGS_SIE_STATUS_SPEED_Msk (0x300UL)                 /*!< SPEED (Bitfield-Mask: 0x03)                           */
#define USBCTRL_REGS_SIE_STATUS_SUSPENDED_Pos (4UL)                 /*!< SUSPENDED (Bit 4)                                     */
#define USBCTRL_REGS_SIE_STATUS_SUSPENDED_Msk (0x10UL)              /*!< SUSPENDED (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_SIE_STATUS_LINE_STATE_Pos (2UL)                /*!< LINE_STATE (Bit 2)                                    */
#define USBCTRL_REGS_SIE_STATUS_LINE_STATE_Msk (0xcUL)              /*!< LINE_STATE (Bitfield-Mask: 0x03)                      */
#define USBCTRL_REGS_SIE_STATUS_VBUS_DETECTED_Pos (0UL)             /*!< VBUS_DETECTED (Bit 0)                                 */
#define USBCTRL_REGS_SIE_STATUS_VBUS_DETECTED_Msk (0x1UL)           /*!< VBUS_DETECTED (Bitfield-Mask: 0x01)                   */
/* ======================================================  INT_EP_CTRL  ====================================================== */
#define USBCTRL_REGS_INT_EP_CTRL_INT_EP_ACTIVE_Pos (1UL)            /*!< INT_EP_ACTIVE (Bit 1)                                 */
#define USBCTRL_REGS_INT_EP_CTRL_INT_EP_ACTIVE_Msk (0xfffeUL)       /*!< INT_EP_ACTIVE (Bitfield-Mask: 0x7fff)                 */
/* ======================================================  BUFF_STATUS  ====================================================== */
#define USBCTRL_REGS_BUFF_STATUS_EP15_OUT_Pos (31UL)                /*!< EP15_OUT (Bit 31)                                     */
#define USBCTRL_REGS_BUFF_STATUS_EP15_OUT_Msk (0x80000000UL)        /*!< EP15_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_BUFF_STATUS_EP15_IN_Pos (30UL)                 /*!< EP15_IN (Bit 30)                                      */
#define USBCTRL_REGS_BUFF_STATUS_EP15_IN_Msk (0x40000000UL)         /*!< EP15_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP14_OUT_Pos (29UL)                /*!< EP14_OUT (Bit 29)                                     */
#define USBCTRL_REGS_BUFF_STATUS_EP14_OUT_Msk (0x20000000UL)        /*!< EP14_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_BUFF_STATUS_EP14_IN_Pos (28UL)                 /*!< EP14_IN (Bit 28)                                      */
#define USBCTRL_REGS_BUFF_STATUS_EP14_IN_Msk (0x10000000UL)         /*!< EP14_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP13_OUT_Pos (27UL)                /*!< EP13_OUT (Bit 27)                                     */
#define USBCTRL_REGS_BUFF_STATUS_EP13_OUT_Msk (0x8000000UL)         /*!< EP13_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_BUFF_STATUS_EP13_IN_Pos (26UL)                 /*!< EP13_IN (Bit 26)                                      */
#define USBCTRL_REGS_BUFF_STATUS_EP13_IN_Msk (0x4000000UL)          /*!< EP13_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP12_OUT_Pos (25UL)                /*!< EP12_OUT (Bit 25)                                     */
#define USBCTRL_REGS_BUFF_STATUS_EP12_OUT_Msk (0x2000000UL)         /*!< EP12_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_BUFF_STATUS_EP12_IN_Pos (24UL)                 /*!< EP12_IN (Bit 24)                                      */
#define USBCTRL_REGS_BUFF_STATUS_EP12_IN_Msk (0x1000000UL)          /*!< EP12_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP11_OUT_Pos (23UL)                /*!< EP11_OUT (Bit 23)                                     */
#define USBCTRL_REGS_BUFF_STATUS_EP11_OUT_Msk (0x800000UL)          /*!< EP11_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_BUFF_STATUS_EP11_IN_Pos (22UL)                 /*!< EP11_IN (Bit 22)                                      */
#define USBCTRL_REGS_BUFF_STATUS_EP11_IN_Msk (0x400000UL)           /*!< EP11_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP10_OUT_Pos (21UL)                /*!< EP10_OUT (Bit 21)                                     */
#define USBCTRL_REGS_BUFF_STATUS_EP10_OUT_Msk (0x200000UL)          /*!< EP10_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_BUFF_STATUS_EP10_IN_Pos (20UL)                 /*!< EP10_IN (Bit 20)                                      */
#define USBCTRL_REGS_BUFF_STATUS_EP10_IN_Msk (0x100000UL)           /*!< EP10_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP9_OUT_Pos (19UL)                 /*!< EP9_OUT (Bit 19)                                      */
#define USBCTRL_REGS_BUFF_STATUS_EP9_OUT_Msk (0x80000UL)            /*!< EP9_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP9_IN_Pos (18UL)                  /*!< EP9_IN (Bit 18)                                       */
#define USBCTRL_REGS_BUFF_STATUS_EP9_IN_Msk (0x40000UL)             /*!< EP9_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_STATUS_EP8_OUT_Pos (17UL)                 /*!< EP8_OUT (Bit 17)                                      */
#define USBCTRL_REGS_BUFF_STATUS_EP8_OUT_Msk (0x20000UL)            /*!< EP8_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP8_IN_Pos (16UL)                  /*!< EP8_IN (Bit 16)                                       */
#define USBCTRL_REGS_BUFF_STATUS_EP8_IN_Msk (0x10000UL)             /*!< EP8_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_STATUS_EP7_OUT_Pos (15UL)                 /*!< EP7_OUT (Bit 15)                                      */
#define USBCTRL_REGS_BUFF_STATUS_EP7_OUT_Msk (0x8000UL)             /*!< EP7_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP7_IN_Pos (14UL)                  /*!< EP7_IN (Bit 14)                                       */
#define USBCTRL_REGS_BUFF_STATUS_EP7_IN_Msk (0x4000UL)              /*!< EP7_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_STATUS_EP6_OUT_Pos (13UL)                 /*!< EP6_OUT (Bit 13)                                      */
#define USBCTRL_REGS_BUFF_STATUS_EP6_OUT_Msk (0x2000UL)             /*!< EP6_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP6_IN_Pos (12UL)                  /*!< EP6_IN (Bit 12)                                       */
#define USBCTRL_REGS_BUFF_STATUS_EP6_IN_Msk (0x1000UL)              /*!< EP6_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_STATUS_EP5_OUT_Pos (11UL)                 /*!< EP5_OUT (Bit 11)                                      */
#define USBCTRL_REGS_BUFF_STATUS_EP5_OUT_Msk (0x800UL)              /*!< EP5_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP5_IN_Pos (10UL)                  /*!< EP5_IN (Bit 10)                                       */
#define USBCTRL_REGS_BUFF_STATUS_EP5_IN_Msk (0x400UL)               /*!< EP5_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_STATUS_EP4_OUT_Pos (9UL)                  /*!< EP4_OUT (Bit 9)                                       */
#define USBCTRL_REGS_BUFF_STATUS_EP4_OUT_Msk (0x200UL)              /*!< EP4_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP4_IN_Pos (8UL)                   /*!< EP4_IN (Bit 8)                                        */
#define USBCTRL_REGS_BUFF_STATUS_EP4_IN_Msk (0x100UL)               /*!< EP4_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_STATUS_EP3_OUT_Pos (7UL)                  /*!< EP3_OUT (Bit 7)                                       */
#define USBCTRL_REGS_BUFF_STATUS_EP3_OUT_Msk (0x80UL)               /*!< EP3_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP3_IN_Pos (6UL)                   /*!< EP3_IN (Bit 6)                                        */
#define USBCTRL_REGS_BUFF_STATUS_EP3_IN_Msk (0x40UL)                /*!< EP3_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_STATUS_EP2_OUT_Pos (5UL)                  /*!< EP2_OUT (Bit 5)                                       */
#define USBCTRL_REGS_BUFF_STATUS_EP2_OUT_Msk (0x20UL)               /*!< EP2_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP2_IN_Pos (4UL)                   /*!< EP2_IN (Bit 4)                                        */
#define USBCTRL_REGS_BUFF_STATUS_EP2_IN_Msk (0x10UL)                /*!< EP2_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_STATUS_EP1_OUT_Pos (3UL)                  /*!< EP1_OUT (Bit 3)                                       */
#define USBCTRL_REGS_BUFF_STATUS_EP1_OUT_Msk (0x8UL)                /*!< EP1_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP1_IN_Pos (2UL)                   /*!< EP1_IN (Bit 2)                                        */
#define USBCTRL_REGS_BUFF_STATUS_EP1_IN_Msk (0x4UL)                 /*!< EP1_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_STATUS_EP0_OUT_Pos (1UL)                  /*!< EP0_OUT (Bit 1)                                       */
#define USBCTRL_REGS_BUFF_STATUS_EP0_OUT_Msk (0x2UL)                /*!< EP0_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_STATUS_EP0_IN_Pos (0UL)                   /*!< EP0_IN (Bit 0)                                        */
#define USBCTRL_REGS_BUFF_STATUS_EP0_IN_Msk (0x1UL)                 /*!< EP0_IN (Bitfield-Mask: 0x01)                          */
/* ================================================  BUFF_CPU_SHOULD_HANDLE  ================================================= */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_Pos (31UL)     /*!< EP15_OUT (Bit 31)                                     */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP15_OUT_Msk (0x80000000UL) /*!< EP15_OUT (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP15_IN_Pos (30UL)      /*!< EP15_IN (Bit 30)                                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP15_IN_Msk (0x40000000UL) /*!< EP15_IN (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_Pos (29UL)     /*!< EP14_OUT (Bit 29)                                     */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP14_OUT_Msk (0x20000000UL) /*!< EP14_OUT (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP14_IN_Pos (28UL)      /*!< EP14_IN (Bit 28)                                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP14_IN_Msk (0x10000000UL) /*!< EP14_IN (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_Pos (27UL)     /*!< EP13_OUT (Bit 27)                                     */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP13_OUT_Msk (0x8000000UL) /*!< EP13_OUT (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP13_IN_Pos (26UL)      /*!< EP13_IN (Bit 26)                                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP13_IN_Msk (0x4000000UL) /*!< EP13_IN (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_Pos (25UL)     /*!< EP12_OUT (Bit 25)                                     */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP12_OUT_Msk (0x2000000UL) /*!< EP12_OUT (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP12_IN_Pos (24UL)      /*!< EP12_IN (Bit 24)                                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP12_IN_Msk (0x1000000UL) /*!< EP12_IN (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_Pos (23UL)     /*!< EP11_OUT (Bit 23)                                     */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP11_OUT_Msk (0x800000UL) /*!< EP11_OUT (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP11_IN_Pos (22UL)      /*!< EP11_IN (Bit 22)                                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP11_IN_Msk (0x400000UL) /*!< EP11_IN (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_Pos (21UL)     /*!< EP10_OUT (Bit 21)                                     */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP10_OUT_Msk (0x200000UL) /*!< EP10_OUT (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP10_IN_Pos (20UL)      /*!< EP10_IN (Bit 20)                                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP10_IN_Msk (0x100000UL) /*!< EP10_IN (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_Pos (19UL)      /*!< EP9_OUT (Bit 19)                                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP9_OUT_Msk (0x80000UL) /*!< EP9_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP9_IN_Pos (18UL)       /*!< EP9_IN (Bit 18)                                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP9_IN_Msk (0x40000UL)  /*!< EP9_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_Pos (17UL)      /*!< EP8_OUT (Bit 17)                                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP8_OUT_Msk (0x20000UL) /*!< EP8_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP8_IN_Pos (16UL)       /*!< EP8_IN (Bit 16)                                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP8_IN_Msk (0x10000UL)  /*!< EP8_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_Pos (15UL)      /*!< EP7_OUT (Bit 15)                                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP7_OUT_Msk (0x8000UL)  /*!< EP7_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP7_IN_Pos (14UL)       /*!< EP7_IN (Bit 14)                                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP7_IN_Msk (0x4000UL)   /*!< EP7_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_Pos (13UL)      /*!< EP6_OUT (Bit 13)                                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP6_OUT_Msk (0x2000UL)  /*!< EP6_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP6_IN_Pos (12UL)       /*!< EP6_IN (Bit 12)                                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP6_IN_Msk (0x1000UL)   /*!< EP6_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_Pos (11UL)      /*!< EP5_OUT (Bit 11)                                      */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP5_OUT_Msk (0x800UL)   /*!< EP5_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP5_IN_Pos (10UL)       /*!< EP5_IN (Bit 10)                                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP5_IN_Msk (0x400UL)    /*!< EP5_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_Pos (9UL)       /*!< EP4_OUT (Bit 9)                                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP4_OUT_Msk (0x200UL)   /*!< EP4_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP4_IN_Pos (8UL)        /*!< EP4_IN (Bit 8)                                        */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP4_IN_Msk (0x100UL)    /*!< EP4_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_Pos (7UL)       /*!< EP3_OUT (Bit 7)                                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP3_OUT_Msk (0x80UL)    /*!< EP3_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP3_IN_Pos (6UL)        /*!< EP3_IN (Bit 6)                                        */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP3_IN_Msk (0x40UL)     /*!< EP3_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_Pos (5UL)       /*!< EP2_OUT (Bit 5)                                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP2_OUT_Msk (0x20UL)    /*!< EP2_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP2_IN_Pos (4UL)        /*!< EP2_IN (Bit 4)                                        */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP2_IN_Msk (0x10UL)     /*!< EP2_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_Pos (3UL)       /*!< EP1_OUT (Bit 3)                                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP1_OUT_Msk (0x8UL)     /*!< EP1_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP1_IN_Pos (2UL)        /*!< EP1_IN (Bit 2)                                        */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP1_IN_Msk (0x4UL)      /*!< EP1_IN (Bitfield-Mask: 0x01)                          */
