mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_Pos (1UL)       /*!< EP0_OUT (Bit 1)                                       */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP0_OUT_Msk (0x2UL)     /*!< EP0_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP0_IN_Pos (0UL)        /*!< EP0_IN (Bit 0)                                        */
#define USBCTRL_REGS_BUFF_CPU_SHOULD_HANDLE_EP0_IN_Msk (0x1UL)      /*!< EP0_IN (Bitfield-Mask: 0x01)                          */
/* =======================================================  EP_ABORT  ======================================================== */
#define USBCTRL_REGS_EP_ABORT_EP15_OUT_Pos (31UL)                   /*!< EP15_OUT (Bit 31)                                     */
#define USBCTRL_REGS_EP_ABORT_EP15_OUT_Msk (0x80000000UL)           /*!< EP15_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_EP15_IN_Pos (30UL)                    /*!< EP15_IN (Bit 30)                                      */
#define USBCTRL_REGS_EP_ABORT_EP15_IN_Msk (0x40000000UL)            /*!< EP15_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP14_OUT_Pos (29UL)                   /*!< EP14_OUT (Bit 29)                                     */
#define USBCTRL_REGS_EP_ABORT_EP14_OUT_Msk (0x20000000UL)           /*!< EP14_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_EP14_IN_Pos (28UL)                    /*!< EP14_IN (Bit 28)                                      */
#define USBCTRL_REGS_EP_ABORT_EP14_IN_Msk (0x10000000UL)            /*!< EP14_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP13_OUT_Pos (27UL)                   /*!< EP13_OUT (Bit 27)                                     */
#define USBCTRL_REGS_EP_ABORT_EP13_OUT_Msk (0x8000000UL)            /*!< EP13_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_EP13_IN_Pos (26UL)                    /*!< EP13_IN (Bit 26)                                      */
#define USBCTRL_REGS_EP_ABORT_EP13_IN_Msk (0x4000000UL)             /*!< EP13_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP12_OUT_Pos (25UL)                   /*!< EP12_OUT (Bit 25)                                     */
#define USBCTRL_REGS_EP_ABORT_EP12_OUT_Msk (0x2000000UL)            /*!< EP12_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_EP12_IN_Pos (24UL)                    /*!< EP12_IN (Bit 24)                                      */
#define USBCTRL_REGS_EP_ABORT_EP12_IN_Msk (0x1000000UL)             /*!< EP12_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP11_OUT_Pos (23UL)                   /*!< EP11_OUT (Bit 23)                                     */
#define USBCTRL_REGS_EP_ABORT_EP11_OUT_Msk (0x800000UL)             /*!< EP11_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_EP11_IN_Pos (22UL)                    /*!< EP11_IN (Bit 22)                                      */
#define USBCTRL_REGS_EP_ABORT_EP11_IN_Msk (0x400000UL)              /*!< EP11_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP10_OUT_Pos (21UL)                   /*!< EP10_OUT (Bit 21)                                     */
#define USBCTRL_REGS_EP_ABORT_EP10_OUT_Msk (0x200000UL)             /*!< EP10_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_EP10_IN_Pos (20UL)                    /*!< EP10_IN (Bit 20)                                      */
#define USBCTRL_REGS_EP_ABORT_EP10_IN_Msk (0x100000UL)              /*!< EP10_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP9_OUT_Pos (19UL)                    /*!< EP9_OUT (Bit 19)                                      */
#define USBCTRL_REGS_EP_ABORT_EP9_OUT_Msk (0x80000UL)               /*!< EP9_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP9_IN_Pos  (18UL)                    /*!< EP9_IN (Bit 18)                                       */
#define USBCTRL_REGS_EP_ABORT_EP9_IN_Msk  (0x40000UL)               /*!< EP9_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_EP8_OUT_Pos (17UL)                    /*!< EP8_OUT (Bit 17)                                      */
#define USBCTRL_REGS_EP_ABORT_EP8_OUT_Msk (0x20000UL)               /*!< EP8_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP8_IN_Pos  (16UL)                    /*!< EP8_IN (Bit 16)                                       */
#define USBCTRL_REGS_EP_ABORT_EP8_IN_Msk  (0x10000UL)               /*!< EP8_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_EP7_OUT_Pos (15UL)                    /*!< EP7_OUT (Bit 15)                                      */
#define USBCTRL_REGS_EP_ABORT_EP7_OUT_Msk (0x8000UL)                /*!< EP7_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP7_IN_Pos  (14UL)                    /*!< EP7_IN (Bit 14)                                       */
#define USBCTRL_REGS_EP_ABORT_EP7_IN_Msk  (0x4000UL)                /*!< EP7_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_EP6_OUT_Pos (13UL)                    /*!< EP6_OUT (Bit 13)                                      */
#define USBCTRL_REGS_EP_ABORT_EP6_OUT_Msk (0x2000UL)                /*!< EP6_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP6_IN_Pos  (12UL)                    /*!< EP6_IN (Bit 12)                                       */
#define USBCTRL_REGS_EP_ABORT_EP6_IN_Msk  (0x1000UL)                /*!< EP6_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_EP5_OUT_Pos (11UL)                    /*!< EP5_OUT (Bit 11)                                      */
#define USBCTRL_REGS_EP_ABORT_EP5_OUT_Msk (0x800UL)                 /*!< EP5_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP5_IN_Pos  (10UL)                    /*!< EP5_IN (Bit 10)                                       */
#define USBCTRL_REGS_EP_ABORT_EP5_IN_Msk  (0x400UL)                 /*!< EP5_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_EP4_OUT_Pos (9UL)                     /*!< EP4_OUT (Bit 9)                                       */
#define USBCTRL_REGS_EP_ABORT_EP4_OUT_Msk (0x200UL)                 /*!< EP4_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP4_IN_Pos  (8UL)                     /*!< EP4_IN (Bit 8)                                        */
#define USBCTRL_REGS_EP_ABORT_EP4_IN_Msk  (0x100UL)                 /*!< EP4_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_EP3_OUT_Pos (7UL)                     /*!< EP3_OUT (Bit 7)                                       */
#define USBCTRL_REGS_EP_ABORT_EP3_OUT_Msk (0x80UL)                  /*!< EP3_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP3_IN_Pos  (6UL)                     /*!< EP3_IN (Bit 6)                                        */
#define USBCTRL_REGS_EP_ABORT_EP3_IN_Msk  (0x40UL)                  /*!< EP3_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_EP2_OUT_Pos (5UL)                     /*!< EP2_OUT (Bit 5)                                       */
#define USBCTRL_REGS_EP_ABORT_EP2_OUT_Msk (0x20UL)                  /*!< EP2_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP2_IN_Pos  (4UL)                     /*!< EP2_IN (Bit 4)                                        */
#define USBCTRL_REGS_EP_ABORT_EP2_IN_Msk  (0x10UL)                  /*!< EP2_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_EP1_OUT_Pos (3UL)                     /*!< EP1_OUT (Bit 3)                                       */
#define USBCTRL_REGS_EP_ABORT_EP1_OUT_Msk (0x8UL)                   /*!< EP1_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP1_IN_Pos  (2UL)                     /*!< EP1_IN (Bit 2)                                        */
#define USBCTRL_REGS_EP_ABORT_EP1_IN_Msk  (0x4UL)                   /*!< EP1_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_EP0_OUT_Pos (1UL)                     /*!< EP0_OUT (Bit 1)                                       */
#define USBCTRL_REGS_EP_ABORT_EP0_OUT_Msk (0x2UL)                   /*!< EP0_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_EP0_IN_Pos  (0UL)                     /*!< EP0_IN (Bit 0)                                        */
#define USBCTRL_REGS_EP_ABORT_EP0_IN_Msk  (0x1UL)                   /*!< EP0_IN (Bitfield-Mask: 0x01)                          */
/* =====================================================  EP_ABORT_DONE  ===================================================== */
#define USBCTRL_REGS_EP_ABORT_DONE_EP15_OUT_Pos (31UL)              /*!< EP15_OUT (Bit 31)                                     */
#define USBCTRL_REGS_EP_ABORT_DONE_EP15_OUT_Msk (0x80000000UL)      /*!< EP15_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_DONE_EP15_IN_Pos (30UL)               /*!< EP15_IN (Bit 30)                                      */
#define USBCTRL_REGS_EP_ABORT_DONE_EP15_IN_Msk (0x40000000UL)       /*!< EP15_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP14_OUT_Pos (29UL)              /*!< EP14_OUT (Bit 29)                                     */
#define USBCTRL_REGS_EP_ABORT_DONE_EP14_OUT_Msk (0x20000000UL)      /*!< EP14_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_DONE_EP14_IN_Pos (28UL)               /*!< EP14_IN (Bit 28)                                      */
#define USBCTRL_REGS_EP_ABORT_DONE_EP14_IN_Msk (0x10000000UL)       /*!< EP14_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP13_OUT_Pos (27UL)              /*!< EP13_OUT (Bit 27)                                     */
#define USBCTRL_REGS_EP_ABORT_DONE_EP13_OUT_Msk (0x8000000UL)       /*!< EP13_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_DONE_EP13_IN_Pos (26UL)               /*!< EP13_IN (Bit 26)                                      */
#define USBCTRL_REGS_EP_ABORT_DONE_EP13_IN_Msk (0x4000000UL)        /*!< EP13_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP12_OUT_Pos (25UL)              /*!< EP12_OUT (Bit 25)                                     */
#define USBCTRL_REGS_EP_ABORT_DONE_EP12_OUT_Msk (0x2000000UL)       /*!< EP12_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_DONE_EP12_IN_Pos (24UL)               /*!< EP12_IN (Bit 24)                                      */
#define USBCTRL_REGS_EP_ABORT_DONE_EP12_IN_Msk (0x1000000UL)        /*!< EP12_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP11_OUT_Pos (23UL)              /*!< EP11_OUT (Bit 23)                                     */
#define USBCTRL_REGS_EP_ABORT_DONE_EP11_OUT_Msk (0x800000UL)        /*!< EP11_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_DONE_EP11_IN_Pos (22UL)               /*!< EP11_IN (Bit 22)                                      */
#define USBCTRL_REGS_EP_ABORT_DONE_EP11_IN_Msk (0x400000UL)         /*!< EP11_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP10_OUT_Pos (21UL)              /*!< EP10_OUT (Bit 21)                                     */
#define USBCTRL_REGS_EP_ABORT_DONE_EP10_OUT_Msk (0x200000UL)        /*!< EP10_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_ABORT_DONE_EP10_IN_Pos (20UL)               /*!< EP10_IN (Bit 20)                                      */
#define USBCTRL_REGS_EP_ABORT_DONE_EP10_IN_Msk (0x100000UL)         /*!< EP10_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP9_OUT_Pos (19UL)               /*!< EP9_OUT (Bit 19)                                      */
#define USBCTRL_REGS_EP_ABORT_DONE_EP9_OUT_Msk (0x80000UL)          /*!< EP9_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP9_IN_Pos (18UL)                /*!< EP9_IN (Bit 18)                                       */
#define USBCTRL_REGS_EP_ABORT_DONE_EP9_IN_Msk (0x40000UL)           /*!< EP9_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_DONE_EP8_OUT_Pos (17UL)               /*!< EP8_OUT (Bit 17)                                      */
#define USBCTRL_REGS_EP_ABORT_DONE_EP8_OUT_Msk (0x20000UL)          /*!< EP8_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP8_IN_Pos (16UL)                /*!< EP8_IN (Bit 16)                                       */
#define USBCTRL_REGS_EP_ABORT_DONE_EP8_IN_Msk (0x10000UL)           /*!< EP8_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_DONE_EP7_OUT_Pos (15UL)               /*!< EP7_OUT (Bit 15)                                      */
#define USBCTRL_REGS_EP_ABORT_DONE_EP7_OUT_Msk (0x8000UL)           /*!< EP7_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP7_IN_Pos (14UL)                /*!< EP7_IN (Bit 14)                                       */
#define USBCTRL_REGS_EP_ABORT_DONE_EP7_IN_Msk (0x4000UL)            /*!< EP7_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_DONE_EP6_OUT_Pos (13UL)               /*!< EP6_OUT (Bit 13)                                      */
#define USBCTRL_REGS_EP_ABORT_DONE_EP6_OUT_Msk (0x2000UL)           /*!< EP6_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP6_IN_Pos (12UL)                /*!< EP6_IN (Bit 12)                                       */
#define USBCTRL_REGS_EP_ABORT_DONE_EP6_IN_Msk (0x1000UL)            /*!< EP6_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_DONE_EP5_OUT_Pos (11UL)               /*!< EP5_OUT (Bit 11)                                      */
#define USBCTRL_REGS_EP_ABORT_DONE_EP5_OUT_Msk (0x800UL)            /*!< EP5_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP5_IN_Pos (10UL)                /*!< EP5_IN (Bit 10)                                       */
#define USBCTRL_REGS_EP_ABORT_DONE_EP5_IN_Msk (0x400UL)             /*!< EP5_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_DONE_EP4_OUT_Pos (9UL)                /*!< EP4_OUT (Bit 9)                                       */
#define USBCTRL_REGS_EP_ABORT_DONE_EP4_OUT_Msk (0x200UL)            /*!< EP4_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP4_IN_Pos (8UL)                 /*!< EP4_IN (Bit 8)                                        */
#define USBCTRL_REGS_EP_ABORT_DONE_EP4_IN_Msk (0x100UL)             /*!< EP4_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_DONE_EP3_OUT_Pos (7UL)                /*!< EP3_OUT (Bit 7)                                       */
#define USBCTRL_REGS_EP_ABORT_DONE_EP3_OUT_Msk (0x80UL)             /*!< EP3_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP3_IN_Pos (6UL)                 /*!< EP3_IN (Bit 6)                                        */
#define USBCTRL_REGS_EP_ABORT_DONE_EP3_IN_Msk (0x40UL)              /*!< EP3_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_DONE_EP2_OUT_Pos (5UL)                /*!< EP2_OUT (Bit 5)                                       */
#define USBCTRL_REGS_EP_ABORT_DONE_EP2_OUT_Msk (0x20UL)             /*!< EP2_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP2_IN_Pos (4UL)                 /*!< EP2_IN (Bit 4)                                        */
#define USBCTRL_REGS_EP_ABORT_DONE_EP2_IN_Msk (0x10UL)              /*!< EP2_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_DONE_EP1_OUT_Pos (3UL)                /*!< EP1_OUT (Bit 3)                                       */
#define USBCTRL_REGS_EP_ABORT_DONE_EP1_OUT_Msk (0x8UL)              /*!< EP1_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP1_IN_Pos (2UL)                 /*!< EP1_IN (Bit 2)                                        */
#define USBCTRL_REGS_EP_ABORT_DONE_EP1_IN_Msk (0x4UL)               /*!< EP1_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_ABORT_DONE_EP0_OUT_Pos (1UL)                /*!< EP0_OUT (Bit 1)                                       */
#define USBCTRL_REGS_EP_ABORT_DONE_EP0_OUT_Msk (0x2UL)              /*!< EP0_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_ABORT_DONE_EP0_IN_Pos (0UL)                 /*!< EP0_IN (Bit 0)                                        */
#define USBCTRL_REGS_EP_ABORT_DONE_EP0_IN_Msk (0x1UL)               /*!< EP0_IN (Bitfield-Mask: 0x01)                          */
/* =====================================================  EP_STALL_ARM  ====================================================== */
#define USBCTRL_REGS_EP_STALL_ARM_EP0_OUT_Pos (1UL)                 /*!< EP0_OUT (Bit 1)                                       */
#define USBCTRL_REGS_EP_STALL_ARM_EP0_OUT_Msk (0x2UL)               /*!< EP0_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STALL_ARM_EP0_IN_Pos (0UL)                  /*!< EP0_IN (Bit 0)                                        */
#define USBCTRL_REGS_EP_STALL_ARM_EP0_IN_Msk (0x1UL)                /*!< EP0_IN (Bitfield-Mask: 0x01)                          */
/* =======================================================  NAK_POLL  ======================================================== */
#define USBCTRL_REGS_NAK_POLL_DELAY_FS_Pos (16UL)                   /*!< DELAY_FS (Bit 16)                                     */
#define USBCTRL_REGS_NAK_POLL_DELAY_FS_Msk (0x3ff0000UL)            /*!< DELAY_FS (Bitfield-Mask: 0x3ff)                       */
#define USBCTRL_REGS_NAK_POLL_DELAY_LS_Pos (0UL)                    /*!< DELAY_LS (Bit 0)                                      */
#define USBCTRL_REGS_NAK_POLL_DELAY_LS_Msk (0x3ffUL)                /*!< DELAY_LS (Bitfield-Mask: 0x3ff)                       */
/* ==================================================  EP_STATUS_STALL_NAK  ================================================== */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP15_OUT_Pos (31UL)        /*!< EP15_OUT (Bit 31)                                     */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP15_OUT_Msk (0x80000000UL) /*!< EP15_OUT (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP15_IN_Pos (30UL)         /*!< EP15_IN (Bit 30)                                      */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP15_IN_Msk (0x40000000UL) /*!< EP15_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP14_OUT_Pos (29UL)        /*!< EP14_OUT (Bit 29)                                     */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP14_OUT_Msk (0x20000000UL) /*!< EP14_OUT (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP14_IN_Pos (28UL)         /*!< EP14_IN (Bit 28)                                      */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP14_IN_Msk (0x10000000UL) /*!< EP14_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP13_OUT_Pos (27UL)        /*!< EP13_OUT (Bit 27)                                     */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP13_OUT_Msk (0x8000000UL) /*!< EP13_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP13_IN_Pos (26UL)         /*!< EP13_IN (Bit 26)                                      */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP13_IN_Msk (0x4000000UL)  /*!< EP13_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP12_OUT_Pos (25UL)        /*!< EP12_OUT (Bit 25)                                     */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP12_OUT_Msk (0x2000000UL) /*!< EP12_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP12_IN_Pos (24UL)         /*!< EP12_IN (Bit 24)                                      */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP12_IN_Msk (0x1000000UL)  /*!< EP12_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP11_OUT_Pos (23UL)        /*!< EP11_OUT (Bit 23)                                     */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP11_OUT_Msk (0x800000UL)  /*!< EP11_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP11_IN_Pos (22UL)         /*!< EP11_IN (Bit 22)                                      */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP11_IN_Msk (0x400000UL)   /*!< EP11_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP10_OUT_Pos (21UL)        /*!< EP10_OUT (Bit 21)                                     */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP10_OUT_Msk (0x200000UL)  /*!< EP10_OUT (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP10_IN_Pos (20UL)         /*!< EP10_IN (Bit 20)                                      */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP10_IN_Msk (0x100000UL)   /*!< EP10_IN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP9_OUT_Pos (19UL)         /*!< EP9_OUT (Bit 19)                                      */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP9_OUT_Msk (0x80000UL)    /*!< EP9_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP9_IN_Pos (18UL)          /*!< EP9_IN (Bit 18)                                       */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP9_IN_Msk (0x40000UL)     /*!< EP9_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP8_OUT_Pos (17UL)         /*!< EP8_OUT (Bit 17)                                      */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP8_OUT_Msk (0x20000UL)    /*!< EP8_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP8_IN_Pos (16UL)          /*!< EP8_IN (Bit 16)                                       */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP8_IN_Msk (0x10000UL)     /*!< EP8_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP7_OUT_Pos (15UL)         /*!< EP7_OUT (Bit 15)                                      */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP7_OUT_Msk (0x8000UL)     /*!< EP7_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP7_IN_Pos (14UL)          /*!< EP7_IN (Bit 14)                                       */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP7_IN_Msk (0x4000UL)      /*!< EP7_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP6_OUT_Pos (13UL)         /*!< EP6_OUT (Bit 13)                                      */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP6_OUT_Msk (0x2000UL)     /*!< EP6_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP6_IN_Pos (12UL)          /*!< EP6_IN (Bit 12)                                       */
