mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP6_IN_Msk (0x1000UL)      /*!< EP6_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP5_OUT_Pos (11UL)         /*!< EP5_OUT (Bit 11)                                      */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP5_OUT_Msk (0x800UL)      /*!< EP5_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP5_IN_Pos (10UL)          /*!< EP5_IN (Bit 10)                                       */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP5_IN_Msk (0x400UL)       /*!< EP5_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP4_OUT_Pos (9UL)          /*!< EP4_OUT (Bit 9)                                       */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP4_OUT_Msk (0x200UL)      /*!< EP4_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP4_IN_Pos (8UL)           /*!< EP4_IN (Bit 8)                                        */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP4_IN_Msk (0x100UL)       /*!< EP4_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP3_OUT_Pos (7UL)          /*!< EP3_OUT (Bit 7)                                       */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP3_OUT_Msk (0x80UL)       /*!< EP3_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP3_IN_Pos (6UL)           /*!< EP3_IN (Bit 6)                                        */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP3_IN_Msk (0x40UL)        /*!< EP3_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP2_OUT_Pos (5UL)          /*!< EP2_OUT (Bit 5)                                       */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP2_OUT_Msk (0x20UL)       /*!< EP2_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP2_IN_Pos (4UL)           /*!< EP2_IN (Bit 4)                                        */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP2_IN_Msk (0x10UL)        /*!< EP2_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP1_OUT_Pos (3UL)          /*!< EP1_OUT (Bit 3)                                       */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP1_OUT_Msk (0x8UL)        /*!< EP1_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP1_IN_Pos (2UL)           /*!< EP1_IN (Bit 2)                                        */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP1_IN_Msk (0x4UL)         /*!< EP1_IN (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP0_OUT_Pos (1UL)          /*!< EP0_OUT (Bit 1)                                       */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP0_OUT_Msk (0x2UL)        /*!< EP0_OUT (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP0_IN_Pos (0UL)           /*!< EP0_IN (Bit 0)                                        */
#define USBCTRL_REGS_EP_STATUS_STALL_NAK_EP0_IN_Msk (0x1UL)         /*!< EP0_IN (Bitfield-Mask: 0x01)                          */
/* ======================================================  USB_MUXING  ======================================================= */
#define USBCTRL_REGS_USB_MUXING_SOFTCON_Pos (3UL)                   /*!< SOFTCON (Bit 3)                                       */
#define USBCTRL_REGS_USB_MUXING_SOFTCON_Msk (0x8UL)                 /*!< SOFTCON (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_USB_MUXING_TO_DIGITAL_PAD_Pos (2UL)            /*!< TO_DIGITAL_PAD (Bit 2)                                */
#define USBCTRL_REGS_USB_MUXING_TO_DIGITAL_PAD_Msk (0x4UL)          /*!< TO_DIGITAL_PAD (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_USB_MUXING_TO_EXTPHY_Pos (1UL)                 /*!< TO_EXTPHY (Bit 1)                                     */
#define USBCTRL_REGS_USB_MUXING_TO_EXTPHY_Msk (0x2UL)               /*!< TO_EXTPHY (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_USB_MUXING_TO_PHY_Pos (0UL)                    /*!< TO_PHY (Bit 0)                                        */
#define USBCTRL_REGS_USB_MUXING_TO_PHY_Msk (0x1UL)                  /*!< TO_PHY (Bitfield-Mask: 0x01)                          */
/* ========================================================  USB_PWR  ======================================================== */
#define USBCTRL_REGS_USB_PWR_OVERCURR_DETECT_EN_Pos (5UL)           /*!< OVERCURR_DETECT_EN (Bit 5)                            */
#define USBCTRL_REGS_USB_PWR_OVERCURR_DETECT_EN_Msk (0x20UL)        /*!< OVERCURR_DETECT_EN (Bitfield-Mask: 0x01)              */
#define USBCTRL_REGS_USB_PWR_OVERCURR_DETECT_Pos (4UL)              /*!< OVERCURR_DETECT (Bit 4)                               */
#define USBCTRL_REGS_USB_PWR_OVERCURR_DETECT_Msk (0x10UL)           /*!< OVERCURR_DETECT (Bitfield-Mask: 0x01)                 */
#define USBCTRL_REGS_USB_PWR_VBUS_DETECT_OVERRIDE_EN_Pos (3UL)      /*!< VBUS_DETECT_OVERRIDE_EN (Bit 3)                       */
#define USBCTRL_REGS_USB_PWR_VBUS_DETECT_OVERRIDE_EN_Msk (0x8UL)    /*!< VBUS_DETECT_OVERRIDE_EN (Bitfield-Mask: 0x01)         */
#define USBCTRL_REGS_USB_PWR_VBUS_DETECT_Pos (2UL)                  /*!< VBUS_DETECT (Bit 2)                                   */
#define USBCTRL_REGS_USB_PWR_VBUS_DETECT_Msk (0x4UL)                /*!< VBUS_DETECT (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_USB_PWR_VBUS_EN_OVERRIDE_EN_Pos (1UL)          /*!< VBUS_EN_OVERRIDE_EN (Bit 1)                           */
#define USBCTRL_REGS_USB_PWR_VBUS_EN_OVERRIDE_EN_Msk (0x2UL)        /*!< VBUS_EN_OVERRIDE_EN (Bitfield-Mask: 0x01)             */
#define USBCTRL_REGS_USB_PWR_VBUS_EN_Pos  (0UL)                     /*!< VBUS_EN (Bit 0)                                       */
#define USBCTRL_REGS_USB_PWR_VBUS_EN_Msk  (0x1UL)                   /*!< VBUS_EN (Bitfield-Mask: 0x01)                         */
/* =====================================================  USBPHY_DIRECT  ===================================================== */
#define USBCTRL_REGS_USBPHY_DIRECT_DM_OVV_Pos (22UL)                /*!< DM_OVV (Bit 22)                                       */
#define USBCTRL_REGS_USBPHY_DIRECT_DM_OVV_Msk (0x400000UL)          /*!< DM_OVV (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_USBPHY_DIRECT_DP_OVV_Pos (21UL)                /*!< DP_OVV (Bit 21)                                       */
#define USBCTRL_REGS_USBPHY_DIRECT_DP_OVV_Msk (0x200000UL)          /*!< DP_OVV (Bitfield-Mask: 0x01)                          */
#define USBCTRL_REGS_USBPHY_DIRECT_DM_OVCN_Pos (20UL)               /*!< DM_OVCN (Bit 20)                                      */
#define USBCTRL_REGS_USBPHY_DIRECT_DM_OVCN_Msk (0x100000UL)         /*!< DM_OVCN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_USBPHY_DIRECT_DP_OVCN_Pos (19UL)               /*!< DP_OVCN (Bit 19)                                      */
#define USBCTRL_REGS_USBPHY_DIRECT_DP_OVCN_Msk (0x80000UL)          /*!< DP_OVCN (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_USBPHY_DIRECT_RX_DM_Pos (18UL)                 /*!< RX_DM (Bit 18)                                        */
#define USBCTRL_REGS_USBPHY_DIRECT_RX_DM_Msk (0x40000UL)            /*!< RX_DM (Bitfield-Mask: 0x01)                           */
#define USBCTRL_REGS_USBPHY_DIRECT_RX_DP_Pos (17UL)                 /*!< RX_DP (Bit 17)                                        */
#define USBCTRL_REGS_USBPHY_DIRECT_RX_DP_Msk (0x20000UL)            /*!< RX_DP (Bitfield-Mask: 0x01)                           */
#define USBCTRL_REGS_USBPHY_DIRECT_RX_DD_Pos (16UL)                 /*!< RX_DD (Bit 16)                                        */
#define USBCTRL_REGS_USBPHY_DIRECT_RX_DD_Msk (0x10000UL)            /*!< RX_DD (Bitfield-Mask: 0x01)                           */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_DIFFMODE_Pos (15UL)           /*!< TX_DIFFMODE (Bit 15)                                  */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_DIFFMODE_Msk (0x8000UL)       /*!< TX_DIFFMODE (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_FSSLEW_Pos (14UL)             /*!< TX_FSSLEW (Bit 14)                                    */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_FSSLEW_Msk (0x4000UL)         /*!< TX_FSSLEW (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_PD_Pos (13UL)                 /*!< TX_PD (Bit 13)                                        */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_PD_Msk (0x2000UL)             /*!< TX_PD (Bitfield-Mask: 0x01)                           */
#define USBCTRL_REGS_USBPHY_DIRECT_RX_PD_Pos (12UL)                 /*!< RX_PD (Bit 12)                                        */
#define USBCTRL_REGS_USBPHY_DIRECT_RX_PD_Msk (0x1000UL)             /*!< RX_PD (Bitfield-Mask: 0x01)                           */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_DM_Pos (11UL)                 /*!< TX_DM (Bit 11)                                        */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_DM_Msk (0x800UL)              /*!< TX_DM (Bitfield-Mask: 0x01)                           */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_DP_Pos (10UL)                 /*!< TX_DP (Bit 10)                                        */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_DP_Msk (0x400UL)              /*!< TX_DP (Bitfield-Mask: 0x01)                           */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_DM_OE_Pos (9UL)               /*!< TX_DM_OE (Bit 9)                                      */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_DM_OE_Msk (0x200UL)           /*!< TX_DM_OE (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_DP_OE_Pos (8UL)               /*!< TX_DP_OE (Bit 8)                                      */
#define USBCTRL_REGS_USBPHY_DIRECT_TX_DP_OE_Msk (0x100UL)           /*!< TX_DP_OE (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_USBPHY_DIRECT_DM_PULLDN_EN_Pos (6UL)           /*!< DM_PULLDN_EN (Bit 6)                                  */
#define USBCTRL_REGS_USBPHY_DIRECT_DM_PULLDN_EN_Msk (0x40UL)        /*!< DM_PULLDN_EN (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_USBPHY_DIRECT_DM_PULLUP_EN_Pos (5UL)           /*!< DM_PULLUP_EN (Bit 5)                                  */
#define USBCTRL_REGS_USBPHY_DIRECT_DM_PULLUP_EN_Msk (0x20UL)        /*!< DM_PULLUP_EN (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_USBPHY_DIRECT_DM_PULLUP_HISEL_Pos (4UL)        /*!< DM_PULLUP_HISEL (Bit 4)                               */
#define USBCTRL_REGS_USBPHY_DIRECT_DM_PULLUP_HISEL_Msk (0x10UL)     /*!< DM_PULLUP_HISEL (Bitfield-Mask: 0x01)                 */
#define USBCTRL_REGS_USBPHY_DIRECT_DP_PULLDN_EN_Pos (2UL)           /*!< DP_PULLDN_EN (Bit 2)                                  */
#define USBCTRL_REGS_USBPHY_DIRECT_DP_PULLDN_EN_Msk (0x4UL)         /*!< DP_PULLDN_EN (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_USBPHY_DIRECT_DP_PULLUP_EN_Pos (1UL)           /*!< DP_PULLUP_EN (Bit 1)                                  */
#define USBCTRL_REGS_USBPHY_DIRECT_DP_PULLUP_EN_Msk (0x2UL)         /*!< DP_PULLUP_EN (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_USBPHY_DIRECT_DP_PULLUP_HISEL_Pos (0UL)        /*!< DP_PULLUP_HISEL (Bit 0)                               */
#define USBCTRL_REGS_USBPHY_DIRECT_DP_PULLUP_HISEL_Msk (0x1UL)      /*!< DP_PULLUP_HISEL (Bitfield-Mask: 0x01)                 */
/* ================================================  USBPHY_DIRECT_OVERRIDE  ================================================= */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN_Pos (15UL) /*!< TX_DIFFMODE_OVERRIDE_EN (Bit 15)           */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DIFFMODE_OVERRIDE_EN_Msk (0x8000UL) /*!< TX_DIFFMODE_OVERRIDE_EN (Bitfield-Mask: 0x01) */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN_Pos (12UL) /*!< DM_PULLUP_OVERRIDE_EN (Bit 12)               */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_OVERRIDE_EN_Msk (0x1000UL) /*!< DM_PULLUP_OVERRIDE_EN (Bitfield-Mask: 0x01) */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN_Pos (11UL) /*!< TX_FSSLEW_OVERRIDE_EN (Bit 11)               */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_FSSLEW_OVERRIDE_EN_Msk (0x800UL) /*!< TX_FSSLEW_OVERRIDE_EN (Bitfield-Mask: 0x01) */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN_Pos (10UL) /*!< TX_PD_OVERRIDE_EN (Bit 10)                       */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_PD_OVERRIDE_EN_Msk (0x400UL) /*!< TX_PD_OVERRIDE_EN (Bitfield-Mask: 0x01)       */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN_Pos (9UL) /*!< RX_PD_OVERRIDE_EN (Bit 9)                         */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_RX_PD_OVERRIDE_EN_Msk (0x200UL) /*!< RX_PD_OVERRIDE_EN (Bitfield-Mask: 0x01)       */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_Pos (8UL) /*!< TX_DM_OVERRIDE_EN (Bit 8)                         */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_Msk (0x100UL) /*!< TX_DM_OVERRIDE_EN (Bitfield-Mask: 0x01)       */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_Pos (7UL) /*!< TX_DP_OVERRIDE_EN (Bit 7)                         */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_Msk (0x80UL) /*!< TX_DP_OVERRIDE_EN (Bitfield-Mask: 0x01)        */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_Pos (6UL) /*!< TX_DM_OE_OVERRIDE_EN (Bit 6)                   */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_Msk (0x40UL) /*!< TX_DM_OE_OVERRIDE_EN (Bitfield-Mask: 0x01)  */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_Pos (5UL) /*!< TX_DP_OE_OVERRIDE_EN (Bit 5)                   */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_Msk (0x20UL) /*!< TX_DP_OE_OVERRIDE_EN (Bitfield-Mask: 0x01)  */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_Pos (4UL) /*!< DM_PULLDN_EN_OVERRIDE_EN (Bit 4)           */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_Msk (0x10UL) /*!< DM_PULLDN_EN_OVERRIDE_EN (Bitfield-Mask: 0x01) */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_Pos (3UL) /*!< DP_PULLDN_EN_OVERRIDE_EN (Bit 3)           */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_Msk (0x8UL) /*!< DP_PULLDN_EN_OVERRIDE_EN (Bitfield-Mask: 0x01) */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_Pos (2UL) /*!< DP_PULLUP_EN_OVERRIDE_EN (Bit 2)           */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_Msk (0x4UL) /*!< DP_PULLUP_EN_OVERRIDE_EN (Bitfield-Mask: 0x01) */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_Pos (1UL) /*!< DM_PULLUP_HISEL_OVERRIDE_EN (Bit 1)     */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_Msk (0x2UL) /*!< DM_PULLUP_HISEL_OVERRIDE_EN (Bitfield-Mask: 0x01) */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_Pos (0UL) /*!< DP_PULLUP_HISEL_OVERRIDE_EN (Bit 0)     */
#define USBCTRL_REGS_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_Msk (0x1UL) /*!< DP_PULLUP_HISEL_OVERRIDE_EN (Bitfield-Mask: 0x01) */
/* ======================================================  USBPHY_TRIM  ====================================================== */
#define USBCTRL_REGS_USBPHY_TRIM_DM_PULLDN_TRIM_Pos (8UL)           /*!< DM_PULLDN_TRIM (Bit 8)                                */
#define USBCTRL_REGS_USBPHY_TRIM_DM_PULLDN_TRIM_Msk (0x1f00UL)      /*!< DM_PULLDN_TRIM (Bitfield-Mask: 0x1f)                  */
#define USBCTRL_REGS_USBPHY_TRIM_DP_PULLDN_TRIM_Pos (0UL)           /*!< DP_PULLDN_TRIM (Bit 0)                                */
#define USBCTRL_REGS_USBPHY_TRIM_DP_PULLDN_TRIM_Msk (0x1fUL)        /*!< DP_PULLDN_TRIM (Bitfield-Mask: 0x1f)                  */
/* =========================================================  INTR  ========================================================== */
#define USBCTRL_REGS_INTR_EP_STALL_NAK_Pos (19UL)                   /*!< EP_STALL_NAK (Bit 19)                                 */
#define USBCTRL_REGS_INTR_EP_STALL_NAK_Msk (0x80000UL)              /*!< EP_STALL_NAK (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_INTR_ABORT_DONE_Pos  (18UL)                    /*!< ABORT_DONE (Bit 18)                                   */
#define USBCTRL_REGS_INTR_ABORT_DONE_Msk  (0x40000UL)               /*!< ABORT_DONE (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_INTR_DEV_SOF_Pos     (17UL)                    /*!< DEV_SOF (Bit 17)                                      */
#define USBCTRL_REGS_INTR_DEV_SOF_Msk     (0x20000UL)               /*!< DEV_SOF (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_INTR_SETUP_REQ_Pos   (16UL)                    /*!< SETUP_REQ (Bit 16)                                    */
#define USBCTRL_REGS_INTR_SETUP_REQ_Msk   (0x10000UL)               /*!< SETUP_REQ (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTR_DEV_RESUME_FROM_HOST_Pos (15UL)           /*!< DEV_RESUME_FROM_HOST (Bit 15)                         */
#define USBCTRL_REGS_INTR_DEV_RESUME_FROM_HOST_Msk (0x8000UL)       /*!< DEV_RESUME_FROM_HOST (Bitfield-Mask: 0x01)            */
#define USBCTRL_REGS_INTR_DEV_SUSPEND_Pos (14UL)                    /*!< DEV_SUSPEND (Bit 14)                                  */
#define USBCTRL_REGS_INTR_DEV_SUSPEND_Msk (0x4000UL)                /*!< DEV_SUSPEND (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTR_DEV_CONN_DIS_Pos (13UL)                   /*!< DEV_CONN_DIS (Bit 13)                                 */
#define USBCTRL_REGS_INTR_DEV_CONN_DIS_Msk (0x2000UL)               /*!< DEV_CONN_DIS (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_INTR_BUS_RESET_Pos   (12UL)                    /*!< BUS_RESET (Bit 12)                                    */
#define USBCTRL_REGS_INTR_BUS_RESET_Msk   (0x1000UL)                /*!< BUS_RESET (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTR_VBUS_DETECT_Pos (11UL)                    /*!< VBUS_DETECT (Bit 11)                                  */
#define USBCTRL_REGS_INTR_VBUS_DETECT_Msk (0x800UL)                 /*!< VBUS_DETECT (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTR_STALL_Pos       (10UL)                    /*!< STALL (Bit 10)                                        */
#define USBCTRL_REGS_INTR_STALL_Msk       (0x400UL)                 /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBCTRL_REGS_INTR_ERROR_CRC_Pos   (9UL)                     /*!< ERROR_CRC (Bit 9)                                     */
#define USBCTRL_REGS_INTR_ERROR_CRC_Msk   (0x200UL)                 /*!< ERROR_CRC (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTR_ERROR_BIT_STUFF_Pos (8UL)                 /*!< ERROR_BIT_STUFF (Bit 8)                               */
#define USBCTRL_REGS_INTR_ERROR_BIT_STUFF_Msk (0x100UL)             /*!< ERROR_BIT_STUFF (Bitfield-Mask: 0x01)                 */
#define USBCTRL_REGS_INTR_ERROR_RX_OVERFLOW_Pos (7UL)               /*!< ERROR_RX_OVERFLOW (Bit 7)                             */
#define USBCTRL_REGS_INTR_ERROR_RX_OVERFLOW_Msk (0x80UL)            /*!< ERROR_RX_OVERFLOW (Bitfield-Mask: 0x01)               */
#define USBCTRL_REGS_INTR_ERROR_RX_TIMEOUT_Pos (6UL)                /*!< ERROR_RX_TIMEOUT (Bit 6)                              */
#define USBCTRL_REGS_INTR_ERROR_RX_TIMEOUT_Msk (0x40UL)             /*!< ERROR_RX_TIMEOUT (Bitfield-Mask: 0x01)                */
#define USBCTRL_REGS_INTR_ERROR_DATA_SEQ_Pos (5UL)                  /*!< ERROR_DATA_SEQ (Bit 5)                                */
#define USBCTRL_REGS_INTR_ERROR_DATA_SEQ_Msk (0x20UL)               /*!< ERROR_DATA_SEQ (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_INTR_BUFF_STATUS_Pos (4UL)                     /*!< BUFF_STATUS (Bit 4)                                   */
#define USBCTRL_REGS_INTR_BUFF_STATUS_Msk (0x10UL)                  /*!< BUFF_STATUS (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTR_TRANS_COMPLETE_Pos (3UL)                  /*!< TRANS_COMPLETE (Bit 3)                                */
#define USBCTRL_REGS_INTR_TRANS_COMPLETE_Msk (0x8UL)                /*!< TRANS_COMPLETE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_INTR_HOST_SOF_Pos    (2UL)                     /*!< HOST_SOF (Bit 2)                                      */
#define USBCTRL_REGS_INTR_HOST_SOF_Msk    (0x4UL)                   /*!< HOST_SOF (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_INTR_HOST_RESUME_Pos (1UL)                     /*!< HOST_RESUME (Bit 1)                                   */
#define USBCTRL_REGS_INTR_HOST_RESUME_Msk (0x2UL)                   /*!< HOST_RESUME (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTR_HOST_CONN_DIS_Pos (0UL)                   /*!< HOST_CONN_DIS (Bit 0)                                 */
#define USBCTRL_REGS_INTR_HOST_CONN_DIS_Msk (0x1UL)                 /*!< HOST_CONN_DIS (Bitfield-Mask: 0x01)                   */
/* =========================================================  INTE  ========================================================== */
#define USBCTRL_REGS_INTE_EP_STALL_NAK_Pos (19UL)                   /*!< EP_STALL_NAK (Bit 19)                                 */
#define USBCTRL_REGS_INTE_EP_STALL_NAK_Msk (0x80000UL)              /*!< EP_STALL_NAK (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_INTE_ABORT_DONE_Pos  (18UL)                    /*!< ABORT_DONE (Bit 18)                                   */
#define USBCTRL_REGS_INTE_ABORT_DONE_Msk  (0x40000UL)               /*!< ABORT_DONE (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_INTE_DEV_SOF_Pos     (17UL)                    /*!< DEV_SOF (Bit 17)                                      */
#define USBCTRL_REGS_INTE_DEV_SOF_Msk     (0x20000UL)               /*!< DEV_SOF (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_INTE_SETUP_REQ_Pos   (16UL)                    /*!< SETUP_REQ (Bit 16)                                    */
#define USBCTRL_REGS_INTE_SETUP_REQ_Msk   (0x10000UL)               /*!< SETUP_REQ (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTE_DEV_RESUME_FROM_HOST_Pos (15UL)           /*!< DEV_RESUME_FROM_HOST (Bit 15)                         */
#define USBCTRL_REGS_INTE_DEV_RESUME_FROM_HOST_Msk (0x8000UL)       /*!< DEV_RESUME_FROM_HOST (Bitfield-Mask: 0x01)            */
#define USBCTRL_REGS_INTE_DEV_SUSPEND_Pos (14UL)                    /*!< DEV_SUSPEND (Bit 14)                                  */
#define USBCTRL_REGS_INTE_DEV_SUSPEND_Msk (0x4000UL)                /*!< DEV_SUSPEND (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTE_DEV_CONN_DIS_Pos (13UL)                   /*!< DEV_CONN_DIS (Bit 13)                                 */
#define USBCTRL_REGS_INTE_DEV_CONN_DIS_Msk (0x2000UL)               /*!< DEV_CONN_DIS (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_INTE_BUS_RESET_Pos   (12UL)                    /*!< BUS_RESET (Bit 12)                                    */
#define USBCTRL_REGS_INTE_BUS_RESET_Msk   (0x1000UL)                /*!< BUS_RESET (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTE_VBUS_DETECT_Pos (11UL)                    /*!< VBUS_DETECT (Bit 11)                                  */
#define USBCTRL_REGS_INTE_VBUS_DETECT_Msk (0x800UL)                 /*!< VBUS_DETECT (Bitfield-Mask: 0x01)                     */
