mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define USBCTRL_REGS_INTE_STALL_Pos       (10UL)                    /*!< STALL (Bit 10)                                        */
#define USBCTRL_REGS_INTE_STALL_Msk       (0x400UL)                 /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBCTRL_REGS_INTE_ERROR_CRC_Pos   (9UL)                     /*!< ERROR_CRC (Bit 9)                                     */
#define USBCTRL_REGS_INTE_ERROR_CRC_Msk   (0x200UL)                 /*!< ERROR_CRC (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTE_ERROR_BIT_STUFF_Pos (8UL)                 /*!< ERROR_BIT_STUFF (Bit 8)                               */
#define USBCTRL_REGS_INTE_ERROR_BIT_STUFF_Msk (0x100UL)             /*!< ERROR_BIT_STUFF (Bitfield-Mask: 0x01)                 */
#define USBCTRL_REGS_INTE_ERROR_RX_OVERFLOW_Pos (7UL)               /*!< ERROR_RX_OVERFLOW (Bit 7)                             */
#define USBCTRL_REGS_INTE_ERROR_RX_OVERFLOW_Msk (0x80UL)            /*!< ERROR_RX_OVERFLOW (Bitfield-Mask: 0x01)               */
#define USBCTRL_REGS_INTE_ERROR_RX_TIMEOUT_Pos (6UL)                /*!< ERROR_RX_TIMEOUT (Bit 6)                              */
#define USBCTRL_REGS_INTE_ERROR_RX_TIMEOUT_Msk (0x40UL)             /*!< ERROR_RX_TIMEOUT (Bitfield-Mask: 0x01)                */
#define USBCTRL_REGS_INTE_ERROR_DATA_SEQ_Pos (5UL)                  /*!< ERROR_DATA_SEQ (Bit 5)                                */
#define USBCTRL_REGS_INTE_ERROR_DATA_SEQ_Msk (0x20UL)               /*!< ERROR_DATA_SEQ (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_INTE_BUFF_STATUS_Pos (4UL)                     /*!< BUFF_STATUS (Bit 4)                                   */
#define USBCTRL_REGS_INTE_BUFF_STATUS_Msk (0x10UL)                  /*!< BUFF_STATUS (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTE_TRANS_COMPLETE_Pos (3UL)                  /*!< TRANS_COMPLETE (Bit 3)                                */
#define USBCTRL_REGS_INTE_TRANS_COMPLETE_Msk (0x8UL)                /*!< TRANS_COMPLETE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_INTE_HOST_SOF_Pos    (2UL)                     /*!< HOST_SOF (Bit 2)                                      */
#define USBCTRL_REGS_INTE_HOST_SOF_Msk    (0x4UL)                   /*!< HOST_SOF (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_INTE_HOST_RESUME_Pos (1UL)                     /*!< HOST_RESUME (Bit 1)                                   */
#define USBCTRL_REGS_INTE_HOST_RESUME_Msk (0x2UL)                   /*!< HOST_RESUME (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTE_HOST_CONN_DIS_Pos (0UL)                   /*!< HOST_CONN_DIS (Bit 0)                                 */
#define USBCTRL_REGS_INTE_HOST_CONN_DIS_Msk (0x1UL)                 /*!< HOST_CONN_DIS (Bitfield-Mask: 0x01)                   */
/* =========================================================  INTF  ========================================================== */
#define USBCTRL_REGS_INTF_EP_STALL_NAK_Pos (19UL)                   /*!< EP_STALL_NAK (Bit 19)                                 */
#define USBCTRL_REGS_INTF_EP_STALL_NAK_Msk (0x80000UL)              /*!< EP_STALL_NAK (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_INTF_ABORT_DONE_Pos  (18UL)                    /*!< ABORT_DONE (Bit 18)                                   */
#define USBCTRL_REGS_INTF_ABORT_DONE_Msk  (0x40000UL)               /*!< ABORT_DONE (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_INTF_DEV_SOF_Pos     (17UL)                    /*!< DEV_SOF (Bit 17)                                      */
#define USBCTRL_REGS_INTF_DEV_SOF_Msk     (0x20000UL)               /*!< DEV_SOF (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_INTF_SETUP_REQ_Pos   (16UL)                    /*!< SETUP_REQ (Bit 16)                                    */
#define USBCTRL_REGS_INTF_SETUP_REQ_Msk   (0x10000UL)               /*!< SETUP_REQ (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTF_DEV_RESUME_FROM_HOST_Pos (15UL)           /*!< DEV_RESUME_FROM_HOST (Bit 15)                         */
#define USBCTRL_REGS_INTF_DEV_RESUME_FROM_HOST_Msk (0x8000UL)       /*!< DEV_RESUME_FROM_HOST (Bitfield-Mask: 0x01)            */
#define USBCTRL_REGS_INTF_DEV_SUSPEND_Pos (14UL)                    /*!< DEV_SUSPEND (Bit 14)                                  */
#define USBCTRL_REGS_INTF_DEV_SUSPEND_Msk (0x4000UL)                /*!< DEV_SUSPEND (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTF_DEV_CONN_DIS_Pos (13UL)                   /*!< DEV_CONN_DIS (Bit 13)                                 */
#define USBCTRL_REGS_INTF_DEV_CONN_DIS_Msk (0x2000UL)               /*!< DEV_CONN_DIS (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_INTF_BUS_RESET_Pos   (12UL)                    /*!< BUS_RESET (Bit 12)                                    */
#define USBCTRL_REGS_INTF_BUS_RESET_Msk   (0x1000UL)                /*!< BUS_RESET (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTF_VBUS_DETECT_Pos (11UL)                    /*!< VBUS_DETECT (Bit 11)                                  */
#define USBCTRL_REGS_INTF_VBUS_DETECT_Msk (0x800UL)                 /*!< VBUS_DETECT (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTF_STALL_Pos       (10UL)                    /*!< STALL (Bit 10)                                        */
#define USBCTRL_REGS_INTF_STALL_Msk       (0x400UL)                 /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBCTRL_REGS_INTF_ERROR_CRC_Pos   (9UL)                     /*!< ERROR_CRC (Bit 9)                                     */
#define USBCTRL_REGS_INTF_ERROR_CRC_Msk   (0x200UL)                 /*!< ERROR_CRC (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTF_ERROR_BIT_STUFF_Pos (8UL)                 /*!< ERROR_BIT_STUFF (Bit 8)                               */
#define USBCTRL_REGS_INTF_ERROR_BIT_STUFF_Msk (0x100UL)             /*!< ERROR_BIT_STUFF (Bitfield-Mask: 0x01)                 */
#define USBCTRL_REGS_INTF_ERROR_RX_OVERFLOW_Pos (7UL)               /*!< ERROR_RX_OVERFLOW (Bit 7)                             */
#define USBCTRL_REGS_INTF_ERROR_RX_OVERFLOW_Msk (0x80UL)            /*!< ERROR_RX_OVERFLOW (Bitfield-Mask: 0x01)               */
#define USBCTRL_REGS_INTF_ERROR_RX_TIMEOUT_Pos (6UL)                /*!< ERROR_RX_TIMEOUT (Bit 6)                              */
#define USBCTRL_REGS_INTF_ERROR_RX_TIMEOUT_Msk (0x40UL)             /*!< ERROR_RX_TIMEOUT (Bitfield-Mask: 0x01)                */
#define USBCTRL_REGS_INTF_ERROR_DATA_SEQ_Pos (5UL)                  /*!< ERROR_DATA_SEQ (Bit 5)                                */
#define USBCTRL_REGS_INTF_ERROR_DATA_SEQ_Msk (0x20UL)               /*!< ERROR_DATA_SEQ (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_INTF_BUFF_STATUS_Pos (4UL)                     /*!< BUFF_STATUS (Bit 4)                                   */
#define USBCTRL_REGS_INTF_BUFF_STATUS_Msk (0x10UL)                  /*!< BUFF_STATUS (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTF_TRANS_COMPLETE_Pos (3UL)                  /*!< TRANS_COMPLETE (Bit 3)                                */
#define USBCTRL_REGS_INTF_TRANS_COMPLETE_Msk (0x8UL)                /*!< TRANS_COMPLETE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_INTF_HOST_SOF_Pos    (2UL)                     /*!< HOST_SOF (Bit 2)                                      */
#define USBCTRL_REGS_INTF_HOST_SOF_Msk    (0x4UL)                   /*!< HOST_SOF (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_INTF_HOST_RESUME_Pos (1UL)                     /*!< HOST_RESUME (Bit 1)                                   */
#define USBCTRL_REGS_INTF_HOST_RESUME_Msk (0x2UL)                   /*!< HOST_RESUME (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTF_HOST_CONN_DIS_Pos (0UL)                   /*!< HOST_CONN_DIS (Bit 0)                                 */
#define USBCTRL_REGS_INTF_HOST_CONN_DIS_Msk (0x1UL)                 /*!< HOST_CONN_DIS (Bitfield-Mask: 0x01)                   */
/* =========================================================  INTS  ========================================================== */
#define USBCTRL_REGS_INTS_EP_STALL_NAK_Pos (19UL)                   /*!< EP_STALL_NAK (Bit 19)                                 */
#define USBCTRL_REGS_INTS_EP_STALL_NAK_Msk (0x80000UL)              /*!< EP_STALL_NAK (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_INTS_ABORT_DONE_Pos  (18UL)                    /*!< ABORT_DONE (Bit 18)                                   */
#define USBCTRL_REGS_INTS_ABORT_DONE_Msk  (0x40000UL)               /*!< ABORT_DONE (Bitfield-Mask: 0x01)                      */
#define USBCTRL_REGS_INTS_DEV_SOF_Pos     (17UL)                    /*!< DEV_SOF (Bit 17)                                      */
#define USBCTRL_REGS_INTS_DEV_SOF_Msk     (0x20000UL)               /*!< DEV_SOF (Bitfield-Mask: 0x01)                         */
#define USBCTRL_REGS_INTS_SETUP_REQ_Pos   (16UL)                    /*!< SETUP_REQ (Bit 16)                                    */
#define USBCTRL_REGS_INTS_SETUP_REQ_Msk   (0x10000UL)               /*!< SETUP_REQ (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTS_DEV_RESUME_FROM_HOST_Pos (15UL)           /*!< DEV_RESUME_FROM_HOST (Bit 15)                         */
#define USBCTRL_REGS_INTS_DEV_RESUME_FROM_HOST_Msk (0x8000UL)       /*!< DEV_RESUME_FROM_HOST (Bitfield-Mask: 0x01)            */
#define USBCTRL_REGS_INTS_DEV_SUSPEND_Pos (14UL)                    /*!< DEV_SUSPEND (Bit 14)                                  */
#define USBCTRL_REGS_INTS_DEV_SUSPEND_Msk (0x4000UL)                /*!< DEV_SUSPEND (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTS_DEV_CONN_DIS_Pos (13UL)                   /*!< DEV_CONN_DIS (Bit 13)                                 */
#define USBCTRL_REGS_INTS_DEV_CONN_DIS_Msk (0x2000UL)               /*!< DEV_CONN_DIS (Bitfield-Mask: 0x01)                    */
#define USBCTRL_REGS_INTS_BUS_RESET_Pos   (12UL)                    /*!< BUS_RESET (Bit 12)                                    */
#define USBCTRL_REGS_INTS_BUS_RESET_Msk   (0x1000UL)                /*!< BUS_RESET (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTS_VBUS_DETECT_Pos (11UL)                    /*!< VBUS_DETECT (Bit 11)                                  */
#define USBCTRL_REGS_INTS_VBUS_DETECT_Msk (0x800UL)                 /*!< VBUS_DETECT (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTS_STALL_Pos       (10UL)                    /*!< STALL (Bit 10)                                        */
#define USBCTRL_REGS_INTS_STALL_Msk       (0x400UL)                 /*!< STALL (Bitfield-Mask: 0x01)                           */
#define USBCTRL_REGS_INTS_ERROR_CRC_Pos   (9UL)                     /*!< ERROR_CRC (Bit 9)                                     */
#define USBCTRL_REGS_INTS_ERROR_CRC_Msk   (0x200UL)                 /*!< ERROR_CRC (Bitfield-Mask: 0x01)                       */
#define USBCTRL_REGS_INTS_ERROR_BIT_STUFF_Pos (8UL)                 /*!< ERROR_BIT_STUFF (Bit 8)                               */
#define USBCTRL_REGS_INTS_ERROR_BIT_STUFF_Msk (0x100UL)             /*!< ERROR_BIT_STUFF (Bitfield-Mask: 0x01)                 */
#define USBCTRL_REGS_INTS_ERROR_RX_OVERFLOW_Pos (7UL)               /*!< ERROR_RX_OVERFLOW (Bit 7)                             */
#define USBCTRL_REGS_INTS_ERROR_RX_OVERFLOW_Msk (0x80UL)            /*!< ERROR_RX_OVERFLOW (Bitfield-Mask: 0x01)               */
#define USBCTRL_REGS_INTS_ERROR_RX_TIMEOUT_Pos (6UL)                /*!< ERROR_RX_TIMEOUT (Bit 6)                              */
#define USBCTRL_REGS_INTS_ERROR_RX_TIMEOUT_Msk (0x40UL)             /*!< ERROR_RX_TIMEOUT (Bitfield-Mask: 0x01)                */
#define USBCTRL_REGS_INTS_ERROR_DATA_SEQ_Pos (5UL)                  /*!< ERROR_DATA_SEQ (Bit 5)                                */
#define USBCTRL_REGS_INTS_ERROR_DATA_SEQ_Msk (0x20UL)               /*!< ERROR_DATA_SEQ (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_INTS_BUFF_STATUS_Pos (4UL)                     /*!< BUFF_STATUS (Bit 4)                                   */
#define USBCTRL_REGS_INTS_BUFF_STATUS_Msk (0x10UL)                  /*!< BUFF_STATUS (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTS_TRANS_COMPLETE_Pos (3UL)                  /*!< TRANS_COMPLETE (Bit 3)                                */
#define USBCTRL_REGS_INTS_TRANS_COMPLETE_Msk (0x8UL)                /*!< TRANS_COMPLETE (Bitfield-Mask: 0x01)                  */
#define USBCTRL_REGS_INTS_HOST_SOF_Pos    (2UL)                     /*!< HOST_SOF (Bit 2)                                      */
#define USBCTRL_REGS_INTS_HOST_SOF_Msk    (0x4UL)                   /*!< HOST_SOF (Bitfield-Mask: 0x01)                        */
#define USBCTRL_REGS_INTS_HOST_RESUME_Pos (1UL)                     /*!< HOST_RESUME (Bit 1)                                   */
#define USBCTRL_REGS_INTS_HOST_RESUME_Msk (0x2UL)                   /*!< HOST_RESUME (Bitfield-Mask: 0x01)                     */
#define USBCTRL_REGS_INTS_HOST_CONN_DIS_Pos (0UL)                   /*!< HOST_CONN_DIS (Bit 0)                                 */
#define USBCTRL_REGS_INTS_HOST_CONN_DIS_Msk (0x1UL)                 /*!< HOST_CONN_DIS (Bitfield-Mask: 0x01)                   */


/* =========================================================================================================================== */
/* ================                                           PIO0                                            ================ */
/* =========================================================================================================================== */

