mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =========================================================  CTRL  ========================================================== */
#define PIO0_CTRL_CLKDIV_RESTART_Pos      (8UL)                     /*!< CLKDIV_RESTART (Bit 8)                                */
#define PIO0_CTRL_CLKDIV_RESTART_Msk      (0xf00UL)                 /*!< CLKDIV_RESTART (Bitfield-Mask: 0x0f)                  */
#define PIO0_CTRL_SM_RESTART_Pos          (4UL)                     /*!< SM_RESTART (Bit 4)                                    */
#define PIO0_CTRL_SM_RESTART_Msk          (0xf0UL)                  /*!< SM_RESTART (Bitfield-Mask: 0x0f)                      */
#define PIO0_CTRL_SM_ENABLE_Pos           (0UL)                     /*!< SM_ENABLE (Bit 0)                                     */
#define PIO0_CTRL_SM_ENABLE_Msk           (0xfUL)                   /*!< SM_ENABLE (Bitfield-Mask: 0x0f)                       */
/* =========================================================  FSTAT  ========================================================= */
#define PIO0_FSTAT_TXEMPTY_Pos            (24UL)                    /*!< TXEMPTY (Bit 24)                                      */
#define PIO0_FSTAT_TXEMPTY_Msk            (0xf000000UL)             /*!< TXEMPTY (Bitfield-Mask: 0x0f)                         */
#define PIO0_FSTAT_TXFULL_Pos             (16UL)                    /*!< TXFULL (Bit 16)                                       */
#define PIO0_FSTAT_TXFULL_Msk             (0xf0000UL)               /*!< TXFULL (Bitfield-Mask: 0x0f)                          */
#define PIO0_FSTAT_RXEMPTY_Pos            (8UL)                     /*!< RXEMPTY (Bit 8)                                       */
#define PIO0_FSTAT_RXEMPTY_Msk            (0xf00UL)                 /*!< RXEMPTY (Bitfield-Mask: 0x0f)                         */
#define PIO0_FSTAT_RXFULL_Pos             (0UL)                     /*!< RXFULL (Bit 0)                                        */
#define PIO0_FSTAT_RXFULL_Msk             (0xfUL)                   /*!< RXFULL (Bitfield-Mask: 0x0f)                          */
/* ========================================================  FDEBUG  ========================================================= */
#define PIO0_FDEBUG_TXSTALL_Pos           (24UL)                    /*!< TXSTALL (Bit 24)                                      */
#define PIO0_FDEBUG_TXSTALL_Msk           (0xf000000UL)             /*!< TXSTALL (Bitfield-Mask: 0x0f)                         */
#define PIO0_FDEBUG_TXOVER_Pos            (16UL)                    /*!< TXOVER (Bit 16)                                       */
#define PIO0_FDEBUG_TXOVER_Msk            (0xf0000UL)               /*!< TXOVER (Bitfield-Mask: 0x0f)                          */
#define PIO0_FDEBUG_RXUNDER_Pos           (8UL)                     /*!< RXUNDER (Bit 8)                                       */
#define PIO0_FDEBUG_RXUNDER_Msk           (0xf00UL)                 /*!< RXUNDER (Bitfield-Mask: 0x0f)                         */
#define PIO0_FDEBUG_RXSTALL_Pos           (0UL)                     /*!< RXSTALL (Bit 0)                                       */
#define PIO0_FDEBUG_RXSTALL_Msk           (0xfUL)                   /*!< RXSTALL (Bitfield-Mask: 0x0f)                         */
/* ========================================================  FLEVEL  ========================================================= */
#define PIO0_FLEVEL_RX3_Pos               (28UL)                    /*!< RX3 (Bit 28)                                          */
#define PIO0_FLEVEL_RX3_Msk               (0xf0000000UL)            /*!< RX3 (Bitfield-Mask: 0x0f)                             */
#define PIO0_FLEVEL_TX3_Pos               (24UL)                    /*!< TX3 (Bit 24)                                          */
#define PIO0_FLEVEL_TX3_Msk               (0xf000000UL)             /*!< TX3 (Bitfield-Mask: 0x0f)                             */
#define PIO0_FLEVEL_RX2_Pos               (20UL)                    /*!< RX2 (Bit 20)                                          */
#define PIO0_FLEVEL_RX2_Msk               (0xf00000UL)              /*!< RX2 (Bitfield-Mask: 0x0f)                             */
#define PIO0_FLEVEL_TX2_Pos               (16UL)                    /*!< TX2 (Bit 16)                                          */
#define PIO0_FLEVEL_TX2_Msk               (0xf0000UL)               /*!< TX2 (Bitfield-Mask: 0x0f)                             */
#define PIO0_FLEVEL_RX1_Pos               (12UL)                    /*!< RX1 (Bit 12)                                          */
#define PIO0_FLEVEL_RX1_Msk               (0xf000UL)                /*!< RX1 (Bitfield-Mask: 0x0f)                             */
#define PIO0_FLEVEL_TX1_Pos               (8UL)                     /*!< TX1 (Bit 8)                                           */
#define PIO0_FLEVEL_TX1_Msk               (0xf00UL)                 /*!< TX1 (Bitfield-Mask: 0x0f)                             */
#define PIO0_FLEVEL_RX0_Pos               (4UL)                     /*!< RX0 (Bit 4)                                           */
#define PIO0_FLEVEL_RX0_Msk               (0xf0UL)                  /*!< RX0 (Bitfield-Mask: 0x0f)                             */
#define PIO0_FLEVEL_TX0_Pos               (0UL)                     /*!< TX0 (Bit 0)                                           */
#define PIO0_FLEVEL_TX0_Msk               (0xfUL)                   /*!< TX0 (Bitfield-Mask: 0x0f)                             */
/* =========================================================  TXF0  ========================================================== */
/* =========================================================  TXF1  ========================================================== */
/* =========================================================  TXF2  ========================================================== */
/* =========================================================  TXF3  ========================================================== */
/* =========================================================  RXF0  ========================================================== */
/* =========================================================  RXF1  ========================================================== */
/* =========================================================  RXF2  ========================================================== */
/* =========================================================  RXF3  ========================================================== */
/* ==========================================================  IRQ  ========================================================== */
#define PIO0_IRQ_IRQ_Pos                  (0UL)                     /*!< IRQ (Bit 0)                                           */
#define PIO0_IRQ_IRQ_Msk                  (0xffUL)                  /*!< IRQ (Bitfield-Mask: 0xff)                             */
/* =======================================================  IRQ_FORCE  ======================================================= */
#define PIO0_IRQ_FORCE_IRQ_FORCE_Pos      (0UL)                     /*!< IRQ_FORCE (Bit 0)                                     */
#define PIO0_IRQ_FORCE_IRQ_FORCE_Msk      (0xffUL)                  /*!< IRQ_FORCE (Bitfield-Mask: 0xff)                       */
/* ===================================================  INPUT_SYNC_BYPASS  =================================================== */
/* ======================================================  DBG_PADOUT  ======================================================= */
/* =======================================================  DBG_PADOE  ======================================================= */
/* ======================================================  DBG_CFGINFO  ====================================================== */
#define PIO0_DBG_CFGINFO_IMEM_SIZE_Pos    (16UL)                    /*!< IMEM_SIZE (Bit 16)                                    */
#define PIO0_DBG_CFGINFO_IMEM_SIZE_Msk    (0x3f0000UL)              /*!< IMEM_SIZE (Bitfield-Mask: 0x3f)                       */
#define PIO0_DBG_CFGINFO_SM_COUNT_Pos     (8UL)                     /*!< SM_COUNT (Bit 8)                                      */
#define PIO0_DBG_CFGINFO_SM_COUNT_Msk     (0xf00UL)                 /*!< SM_COUNT (Bitfield-Mask: 0x0f)                        */
#define PIO0_DBG_CFGINFO_FIFO_DEPTH_Pos   (0UL)                     /*!< FIFO_DEPTH (Bit 0)                                    */
#define PIO0_DBG_CFGINFO_FIFO_DEPTH_Msk   (0x3fUL)                  /*!< FIFO_DEPTH (Bitfield-Mask: 0x3f)                      */
/* ======================================================  INSTR_MEM0  ======================================================= */
#define PIO0_INSTR_MEM0_INSTR_MEM0_Pos    (0UL)                     /*!< INSTR_MEM0 (Bit 0)                                    */
#define PIO0_INSTR_MEM0_INSTR_MEM0_Msk    (0xffffUL)                /*!< INSTR_MEM0 (Bitfield-Mask: 0xffff)                    */
/* ======================================================  INSTR_MEM1  ======================================================= */
#define PIO0_INSTR_MEM1_INSTR_MEM1_Pos    (0UL)                     /*!< INSTR_MEM1 (Bit 0)                                    */
#define PIO0_INSTR_MEM1_INSTR_MEM1_Msk    (0xffffUL)                /*!< INSTR_MEM1 (Bitfield-Mask: 0xffff)                    */
/* ======================================================  INSTR_MEM2  ======================================================= */
#define PIO0_INSTR_MEM2_INSTR_MEM2_Pos    (0UL)                     /*!< INSTR_MEM2 (Bit 0)                                    */
#define PIO0_INSTR_MEM2_INSTR_MEM2_Msk    (0xffffUL)                /*!< INSTR_MEM2 (Bitfield-Mask: 0xffff)                    */
/* ======================================================  INSTR_MEM3  ======================================================= */
#define PIO0_INSTR_MEM3_INSTR_MEM3_Pos    (0UL)                     /*!< INSTR_MEM3 (Bit 0)                                    */
#define PIO0_INSTR_MEM3_INSTR_MEM3_Msk    (0xffffUL)                /*!< INSTR_MEM3 (Bitfield-Mask: 0xffff)                    */
/* ======================================================  INSTR_MEM4  ======================================================= */
#define PIO0_INSTR_MEM4_INSTR_MEM4_Pos    (0UL)                     /*!< INSTR_MEM4 (Bit 0)                                    */
#define PIO0_INSTR_MEM4_INSTR_MEM4_Msk    (0xffffUL)                /*!< INSTR_MEM4 (Bitfield-Mask: 0xffff)                    */
/* ======================================================  INSTR_MEM5  ======================================================= */
#define PIO0_INSTR_MEM5_INSTR_MEM5_Pos    (0UL)                     /*!< INSTR_MEM5 (Bit 0)                                    */
#define PIO0_INSTR_MEM5_INSTR_MEM5_Msk    (0xffffUL)                /*!< INSTR_MEM5 (Bitfield-Mask: 0xffff)                    */
/* ======================================================  INSTR_MEM6  ======================================================= */
#define PIO0_INSTR_MEM6_INSTR_MEM6_Pos    (0UL)                     /*!< INSTR_MEM6 (Bit 0)                                    */
#define PIO0_INSTR_MEM6_INSTR_MEM6_Msk    (0xffffUL)                /*!< INSTR_MEM6 (Bitfield-Mask: 0xffff)                    */
/* ======================================================  INSTR_MEM7  ======================================================= */
#define PIO0_INSTR_MEM7_INSTR_MEM7_Pos    (0UL)                     /*!< INSTR_MEM7 (Bit 0)                                    */
#define PIO0_INSTR_MEM7_INSTR_MEM7_Msk    (0xffffUL)                /*!< INSTR_MEM7 (Bitfield-Mask: 0xffff)                    */
/* ======================================================  INSTR_MEM8  ======================================================= */
#define PIO0_INSTR_MEM8_INSTR_MEM8_Pos    (0UL)                     /*!< INSTR_MEM8 (Bit 0)                                    */
#define PIO0_INSTR_MEM8_INSTR_MEM8_Msk    (0xffffUL)                /*!< INSTR_MEM8 (Bitfield-Mask: 0xffff)                    */
/* ======================================================  INSTR_MEM9  ======================================================= */
#define PIO0_INSTR_MEM9_INSTR_MEM9_Pos    (0UL)                     /*!< INSTR_MEM9 (Bit 0)                                    */
#define PIO0_INSTR_MEM9_INSTR_MEM9_Msk    (0xffffUL)                /*!< INSTR_MEM9 (Bitfield-Mask: 0xffff)                    */
/* ======================================================  INSTR_MEM10  ====================================================== */
#define PIO0_INSTR_MEM10_INSTR_MEM10_Pos  (0UL)                     /*!< INSTR_MEM10 (Bit 0)                                   */
#define PIO0_INSTR_MEM10_INSTR_MEM10_Msk  (0xffffUL)                /*!< INSTR_MEM10 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM11  ====================================================== */
#define PIO0_INSTR_MEM11_INSTR_MEM11_Pos  (0UL)                     /*!< INSTR_MEM11 (Bit 0)                                   */
#define PIO0_INSTR_MEM11_INSTR_MEM11_Msk  (0xffffUL)                /*!< INSTR_MEM11 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM12  ====================================================== */
#define PIO0_INSTR_MEM12_INSTR_MEM12_Pos  (0UL)                     /*!< INSTR_MEM12 (Bit 0)                                   */
#define PIO0_INSTR_MEM12_INSTR_MEM12_Msk  (0xffffUL)                /*!< INSTR_MEM12 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM13  ====================================================== */
#define PIO0_INSTR_MEM13_INSTR_MEM13_Pos  (0UL)                     /*!< INSTR_MEM13 (Bit 0)                                   */
#define PIO0_INSTR_MEM13_INSTR_MEM13_Msk  (0xffffUL)                /*!< INSTR_MEM13 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM14  ====================================================== */
#define PIO0_INSTR_MEM14_INSTR_MEM14_Pos  (0UL)                     /*!< INSTR_MEM14 (Bit 0)                                   */
#define PIO0_INSTR_MEM14_INSTR_MEM14_Msk  (0xffffUL)                /*!< INSTR_MEM14 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM15  ====================================================== */
#define PIO0_INSTR_MEM15_INSTR_MEM15_Pos  (0UL)                     /*!< INSTR_MEM15 (Bit 0)                                   */
#define PIO0_INSTR_MEM15_INSTR_MEM15_Msk  (0xffffUL)                /*!< INSTR_MEM15 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM16  ====================================================== */
#define PIO0_INSTR_MEM16_INSTR_MEM16_Pos  (0UL)                     /*!< INSTR_MEM16 (Bit 0)                                   */
#define PIO0_INSTR_MEM16_INSTR_MEM16_Msk  (0xffffUL)                /*!< INSTR_MEM16 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM17  ====================================================== */
#define PIO0_INSTR_MEM17_INSTR_MEM17_Pos  (0UL)                     /*!< INSTR_MEM17 (Bit 0)                                   */
#define PIO0_INSTR_MEM17_INSTR_MEM17_Msk  (0xffffUL)                /*!< INSTR_MEM17 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM18  ====================================================== */
#define PIO0_INSTR_MEM18_INSTR_MEM18_Pos  (0UL)                     /*!< INSTR_MEM18 (Bit 0)                                   */
#define PIO0_INSTR_MEM18_INSTR_MEM18_Msk  (0xffffUL)                /*!< INSTR_MEM18 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM19  ====================================================== */
#define PIO0_INSTR_MEM19_INSTR_MEM19_Pos  (0UL)                     /*!< INSTR_MEM19 (Bit 0)                                   */
#define PIO0_INSTR_MEM19_INSTR_MEM19_Msk  (0xffffUL)                /*!< INSTR_MEM19 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM20  ====================================================== */
#define PIO0_INSTR_MEM20_INSTR_MEM20_Pos  (0UL)                     /*!< INSTR_MEM20 (Bit 0)                                   */
#define PIO0_INSTR_MEM20_INSTR_MEM20_Msk  (0xffffUL)                /*!< INSTR_MEM20 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM21  ====================================================== */
#define PIO0_INSTR_MEM21_INSTR_MEM21_Pos  (0UL)                     /*!< INSTR_MEM21 (Bit 0)                                   */
#define PIO0_INSTR_MEM21_INSTR_MEM21_Msk  (0xffffUL)                /*!< INSTR_MEM21 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM22  ====================================================== */
#define PIO0_INSTR_MEM22_INSTR_MEM22_Pos  (0UL)                     /*!< INSTR_MEM22 (Bit 0)                                   */
#define PIO0_INSTR_MEM22_INSTR_MEM22_Msk  (0xffffUL)                /*!< INSTR_MEM22 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM23  ====================================================== */
#define PIO0_INSTR_MEM23_INSTR_MEM23_Pos  (0UL)                     /*!< INSTR_MEM23 (Bit 0)                                   */
#define PIO0_INSTR_MEM23_INSTR_MEM23_Msk  (0xffffUL)                /*!< INSTR_MEM23 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM24  ====================================================== */
#define PIO0_INSTR_MEM24_INSTR_MEM24_Pos  (0UL)                     /*!< INSTR_MEM24 (Bit 0)                                   */
#define PIO0_INSTR_MEM24_INSTR_MEM24_Msk  (0xffffUL)                /*!< INSTR_MEM24 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM25  ====================================================== */
#define PIO0_INSTR_MEM25_INSTR_MEM25_Pos  (0UL)                     /*!< INSTR_MEM25 (Bit 0)                                   */
#define PIO0_INSTR_MEM25_INSTR_MEM25_Msk  (0xffffUL)                /*!< INSTR_MEM25 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM26  ====================================================== */
#define PIO0_INSTR_MEM26_INSTR_MEM26_Pos  (0UL)                     /*!< INSTR_MEM26 (Bit 0)                                   */
#define PIO0_INSTR_MEM26_INSTR_MEM26_Msk  (0xffffUL)                /*!< INSTR_MEM26 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM27  ====================================================== */
#define PIO0_INSTR_MEM27_INSTR_MEM27_Pos  (0UL)                     /*!< INSTR_MEM27 (Bit 0)                                   */
#define PIO0_INSTR_MEM27_INSTR_MEM27_Msk  (0xffffUL)                /*!< INSTR_MEM27 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM28  ====================================================== */
#define PIO0_INSTR_MEM28_INSTR_MEM28_Pos  (0UL)                     /*!< INSTR_MEM28 (Bit 0)                                   */
#define PIO0_INSTR_MEM28_INSTR_MEM28_Msk  (0xffffUL)                /*!< INSTR_MEM28 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM29  ====================================================== */
#define PIO0_INSTR_MEM29_INSTR_MEM29_Pos  (0UL)                     /*!< INSTR_MEM29 (Bit 0)                                   */
#define PIO0_INSTR_MEM29_INSTR_MEM29_Msk  (0xffffUL)                /*!< INSTR_MEM29 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM30  ====================================================== */
#define PIO0_INSTR_MEM30_INSTR_MEM30_Pos  (0UL)                     /*!< INSTR_MEM30 (Bit 0)                                   */
#define PIO0_INSTR_MEM30_INSTR_MEM30_Msk  (0xffffUL)                /*!< INSTR_MEM30 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  INSTR_MEM31  ====================================================== */
#define PIO0_INSTR_MEM31_INSTR_MEM31_Pos  (0UL)                     /*!< INSTR_MEM31 (Bit 0)                                   */
#define PIO0_INSTR_MEM31_INSTR_MEM31_Msk  (0xffffUL)                /*!< INSTR_MEM31 (Bitfield-Mask: 0xffff)                   */
/* ======================================================  SM0_CLKDIV  ======================================================= */
#define PIO0_SM0_CLKDIV_INT_Pos           (16UL)                    /*!< INT (Bit 16)                                          */
#define PIO0_SM0_CLKDIV_INT_Msk           (0xffff0000UL)            /*!< INT (Bitfield-Mask: 0xffff)                           */
#define PIO0_SM0_CLKDIV_FRAC_Pos          (8UL)                     /*!< FRAC (Bit 8)                                          */
#define PIO0_SM0_CLKDIV_FRAC_Msk          (0xff00UL)                /*!< FRAC (Bitfield-Mask: 0xff)                            */
/* =====================================================  SM0_EXECCTRL  ====================================================== */
#define PIO0_SM0_EXECCTRL_EXEC_STALLED_Pos (31UL)                   /*!< EXEC_STALLED (Bit 31)                                 */
#define PIO0_SM0_EXECCTRL_EXEC_STALLED_Msk (0x80000000UL)           /*!< EXEC_STALLED (Bitfield-Mask: 0x01)                    */
#define PIO0_SM0_EXECCTRL_SIDE_EN_Pos     (30UL)                    /*!< SIDE_EN (Bit 30)                                      */
#define PIO0_SM0_EXECCTRL_SIDE_EN_Msk     (0x40000000UL)            /*!< SIDE_EN (Bitfield-Mask: 0x01)                         */
#define PIO0_SM0_EXECCTRL_SIDE_PINDIR_Pos (29UL)                    /*!< SIDE_PINDIR (Bit 29)                                  */
#define PIO0_SM0_EXECCTRL_SIDE_PINDIR_Msk (0x20000000UL)            /*!< SIDE_PINDIR (Bitfield-Mask: 0x01)                     */
#define PIO0_SM0_EXECCTRL_JMP_PIN_Pos     (24UL)                    /*!< JMP_PIN (Bit 24)                                      */
#define PIO0_SM0_EXECCTRL_JMP_PIN_Msk     (0x1f000000UL)            /*!< JMP_PIN (Bitfield-Mask: 0x1f)                         */
#define PIO0_SM0_EXECCTRL_OUT_EN_SEL_Pos  (19UL)                    /*!< OUT_EN_SEL (Bit 19)                                   */
#define PIO0_SM0_EXECCTRL_OUT_EN_SEL_Msk  (0xf80000UL)              /*!< OUT_EN_SEL (Bitfield-Mask: 0x1f)                      */
#define PIO0_SM0_EXECCTRL_INLINE_OUT_EN_Pos (18UL)                  /*!< INLINE_OUT_EN (Bit 18)                                */
#define PIO0_SM0_EXECCTRL_INLINE_OUT_EN_Msk (0x40000UL)             /*!< INLINE_OUT_EN (Bitfield-Mask: 0x01)                   */
#define PIO0_SM0_EXECCTRL_OUT_STICKY_Pos  (17UL)                    /*!< OUT_STICKY (Bit 17)                                   */
#define PIO0_SM0_EXECCTRL_OUT_STICKY_Msk  (0x20000UL)               /*!< OUT_STICKY (Bitfield-Mask: 0x01)                      */
#define PIO0_SM0_EXECCTRL_WRAP_TOP_Pos    (12UL)                    /*!< WRAP_TOP (Bit 12)                                     */
#define PIO0_SM0_EXECCTRL_WRAP_TOP_Msk    (0x1f000UL)               /*!< WRAP_TOP (Bitfield-Mask: 0x1f)                        */
