mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define PIO0_SM0_EXECCTRL_WRAP_BOTTOM_Pos (7UL)                     /*!< WRAP_BOTTOM (Bit 7)                                   */
#define PIO0_SM0_EXECCTRL_WRAP_BOTTOM_Msk (0xf80UL)                 /*!< WRAP_BOTTOM (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM0_EXECCTRL_STATUS_SEL_Pos  (4UL)                     /*!< STATUS_SEL (Bit 4)                                    */
#define PIO0_SM0_EXECCTRL_STATUS_SEL_Msk  (0x10UL)                  /*!< STATUS_SEL (Bitfield-Mask: 0x01)                      */
#define PIO0_SM0_EXECCTRL_STATUS_N_Pos    (0UL)                     /*!< STATUS_N (Bit 0)                                      */
#define PIO0_SM0_EXECCTRL_STATUS_N_Msk    (0xfUL)                   /*!< STATUS_N (Bitfield-Mask: 0x0f)                        */
/* =====================================================  SM0_SHIFTCTRL  ===================================================== */
#define PIO0_SM0_SHIFTCTRL_FJOIN_RX_Pos   (31UL)                    /*!< FJOIN_RX (Bit 31)                                     */
#define PIO0_SM0_SHIFTCTRL_FJOIN_RX_Msk   (0x80000000UL)            /*!< FJOIN_RX (Bitfield-Mask: 0x01)                        */
#define PIO0_SM0_SHIFTCTRL_FJOIN_TX_Pos   (30UL)                    /*!< FJOIN_TX (Bit 30)                                     */
#define PIO0_SM0_SHIFTCTRL_FJOIN_TX_Msk   (0x40000000UL)            /*!< FJOIN_TX (Bitfield-Mask: 0x01)                        */
#define PIO0_SM0_SHIFTCTRL_PULL_THRESH_Pos (25UL)                   /*!< PULL_THRESH (Bit 25)                                  */
#define PIO0_SM0_SHIFTCTRL_PULL_THRESH_Msk (0x3e000000UL)           /*!< PULL_THRESH (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM0_SHIFTCTRL_PUSH_THRESH_Pos (20UL)                   /*!< PUSH_THRESH (Bit 20)                                  */
#define PIO0_SM0_SHIFTCTRL_PUSH_THRESH_Msk (0x1f00000UL)            /*!< PUSH_THRESH (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM0_SHIFTCTRL_OUT_SHIFTDIR_Pos (19UL)                  /*!< OUT_SHIFTDIR (Bit 19)                                 */
#define PIO0_SM0_SHIFTCTRL_OUT_SHIFTDIR_Msk (0x80000UL)             /*!< OUT_SHIFTDIR (Bitfield-Mask: 0x01)                    */
#define PIO0_SM0_SHIFTCTRL_IN_SHIFTDIR_Pos (18UL)                   /*!< IN_SHIFTDIR (Bit 18)                                  */
#define PIO0_SM0_SHIFTCTRL_IN_SHIFTDIR_Msk (0x40000UL)              /*!< IN_SHIFTDIR (Bitfield-Mask: 0x01)                     */
#define PIO0_SM0_SHIFTCTRL_AUTOPULL_Pos   (17UL)                    /*!< AUTOPULL (Bit 17)                                     */
#define PIO0_SM0_SHIFTCTRL_AUTOPULL_Msk   (0x20000UL)               /*!< AUTOPULL (Bitfield-Mask: 0x01)                        */
#define PIO0_SM0_SHIFTCTRL_AUTOPUSH_Pos   (16UL)                    /*!< AUTOPUSH (Bit 16)                                     */
#define PIO0_SM0_SHIFTCTRL_AUTOPUSH_Msk   (0x10000UL)               /*!< AUTOPUSH (Bitfield-Mask: 0x01)                        */
/* =======================================================  SM0_ADDR  ======================================================== */
#define PIO0_SM0_ADDR_SM0_ADDR_Pos        (0UL)                     /*!< SM0_ADDR (Bit 0)                                      */
#define PIO0_SM0_ADDR_SM0_ADDR_Msk        (0x1fUL)                  /*!< SM0_ADDR (Bitfield-Mask: 0x1f)                        */
/* =======================================================  SM0_INSTR  ======================================================= */
#define PIO0_SM0_INSTR_SM0_INSTR_Pos      (0UL)                     /*!< SM0_INSTR (Bit 0)                                     */
#define PIO0_SM0_INSTR_SM0_INSTR_Msk      (0xffffUL)                /*!< SM0_INSTR (Bitfield-Mask: 0xffff)                     */
/* ======================================================  SM0_PINCTRL  ====================================================== */
#define PIO0_SM0_PINCTRL_SIDESET_COUNT_Pos (29UL)                   /*!< SIDESET_COUNT (Bit 29)                                */
#define PIO0_SM0_PINCTRL_SIDESET_COUNT_Msk (0xe0000000UL)           /*!< SIDESET_COUNT (Bitfield-Mask: 0x07)                   */
#define PIO0_SM0_PINCTRL_SET_COUNT_Pos    (26UL)                    /*!< SET_COUNT (Bit 26)                                    */
#define PIO0_SM0_PINCTRL_SET_COUNT_Msk    (0x1c000000UL)            /*!< SET_COUNT (Bitfield-Mask: 0x07)                       */
#define PIO0_SM0_PINCTRL_OUT_COUNT_Pos    (20UL)                    /*!< OUT_COUNT (Bit 20)                                    */
#define PIO0_SM0_PINCTRL_OUT_COUNT_Msk    (0x3f00000UL)             /*!< OUT_COUNT (Bitfield-Mask: 0x3f)                       */
#define PIO0_SM0_PINCTRL_IN_BASE_Pos      (15UL)                    /*!< IN_BASE (Bit 15)                                      */
#define PIO0_SM0_PINCTRL_IN_BASE_Msk      (0xf8000UL)               /*!< IN_BASE (Bitfield-Mask: 0x1f)                         */
#define PIO0_SM0_PINCTRL_SIDESET_BASE_Pos (10UL)                    /*!< SIDESET_BASE (Bit 10)                                 */
#define PIO0_SM0_PINCTRL_SIDESET_BASE_Msk (0x7c00UL)                /*!< SIDESET_BASE (Bitfield-Mask: 0x1f)                    */
#define PIO0_SM0_PINCTRL_SET_BASE_Pos     (5UL)                     /*!< SET_BASE (Bit 5)                                      */
#define PIO0_SM0_PINCTRL_SET_BASE_Msk     (0x3e0UL)                 /*!< SET_BASE (Bitfield-Mask: 0x1f)                        */
#define PIO0_SM0_PINCTRL_OUT_BASE_Pos     (0UL)                     /*!< OUT_BASE (Bit 0)                                      */
#define PIO0_SM0_PINCTRL_OUT_BASE_Msk     (0x1fUL)                  /*!< OUT_BASE (Bitfield-Mask: 0x1f)                        */
/* ======================================================  SM1_CLKDIV  ======================================================= */
#define PIO0_SM1_CLKDIV_INT_Pos           (16UL)                    /*!< INT (Bit 16)                                          */
#define PIO0_SM1_CLKDIV_INT_Msk           (0xffff0000UL)            /*!< INT (Bitfield-Mask: 0xffff)                           */
#define PIO0_SM1_CLKDIV_FRAC_Pos          (8UL)                     /*!< FRAC (Bit 8)                                          */
#define PIO0_SM1_CLKDIV_FRAC_Msk          (0xff00UL)                /*!< FRAC (Bitfield-Mask: 0xff)                            */
/* =====================================================  SM1_EXECCTRL  ====================================================== */
#define PIO0_SM1_EXECCTRL_EXEC_STALLED_Pos (31UL)                   /*!< EXEC_STALLED (Bit 31)                                 */
#define PIO0_SM1_EXECCTRL_EXEC_STALLED_Msk (0x80000000UL)           /*!< EXEC_STALLED (Bitfield-Mask: 0x01)                    */
#define PIO0_SM1_EXECCTRL_SIDE_EN_Pos     (30UL)                    /*!< SIDE_EN (Bit 30)                                      */
#define PIO0_SM1_EXECCTRL_SIDE_EN_Msk     (0x40000000UL)            /*!< SIDE_EN (Bitfield-Mask: 0x01)                         */
#define PIO0_SM1_EXECCTRL_SIDE_PINDIR_Pos (29UL)                    /*!< SIDE_PINDIR (Bit 29)                                  */
#define PIO0_SM1_EXECCTRL_SIDE_PINDIR_Msk (0x20000000UL)            /*!< SIDE_PINDIR (Bitfield-Mask: 0x01)                     */
#define PIO0_SM1_EXECCTRL_JMP_PIN_Pos     (24UL)                    /*!< JMP_PIN (Bit 24)                                      */
#define PIO0_SM1_EXECCTRL_JMP_PIN_Msk     (0x1f000000UL)            /*!< JMP_PIN (Bitfield-Mask: 0x1f)                         */
#define PIO0_SM1_EXECCTRL_OUT_EN_SEL_Pos  (19UL)                    /*!< OUT_EN_SEL (Bit 19)                                   */
#define PIO0_SM1_EXECCTRL_OUT_EN_SEL_Msk  (0xf80000UL)              /*!< OUT_EN_SEL (Bitfield-Mask: 0x1f)                      */
#define PIO0_SM1_EXECCTRL_INLINE_OUT_EN_Pos (18UL)                  /*!< INLINE_OUT_EN (Bit 18)                                */
#define PIO0_SM1_EXECCTRL_INLINE_OUT_EN_Msk (0x40000UL)             /*!< INLINE_OUT_EN (Bitfield-Mask: 0x01)                   */
#define PIO0_SM1_EXECCTRL_OUT_STICKY_Pos  (17UL)                    /*!< OUT_STICKY (Bit 17)                                   */
#define PIO0_SM1_EXECCTRL_OUT_STICKY_Msk  (0x20000UL)               /*!< OUT_STICKY (Bitfield-Mask: 0x01)                      */
#define PIO0_SM1_EXECCTRL_WRAP_TOP_Pos    (12UL)                    /*!< WRAP_TOP (Bit 12)                                     */
#define PIO0_SM1_EXECCTRL_WRAP_TOP_Msk    (0x1f000UL)               /*!< WRAP_TOP (Bitfield-Mask: 0x1f)                        */
#define PIO0_SM1_EXECCTRL_WRAP_BOTTOM_Pos (7UL)                     /*!< WRAP_BOTTOM (Bit 7)                                   */
#define PIO0_SM1_EXECCTRL_WRAP_BOTTOM_Msk (0xf80UL)                 /*!< WRAP_BOTTOM (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM1_EXECCTRL_STATUS_SEL_Pos  (4UL)                     /*!< STATUS_SEL (Bit 4)                                    */
#define PIO0_SM1_EXECCTRL_STATUS_SEL_Msk  (0x10UL)                  /*!< STATUS_SEL (Bitfield-Mask: 0x01)                      */
#define PIO0_SM1_EXECCTRL_STATUS_N_Pos    (0UL)                     /*!< STATUS_N (Bit 0)                                      */
#define PIO0_SM1_EXECCTRL_STATUS_N_Msk    (0xfUL)                   /*!< STATUS_N (Bitfield-Mask: 0x0f)                        */
/* =====================================================  SM1_SHIFTCTRL  ===================================================== */
#define PIO0_SM1_SHIFTCTRL_FJOIN_RX_Pos   (31UL)                    /*!< FJOIN_RX (Bit 31)                                     */
#define PIO0_SM1_SHIFTCTRL_FJOIN_RX_Msk   (0x80000000UL)            /*!< FJOIN_RX (Bitfield-Mask: 0x01)                        */
#define PIO0_SM1_SHIFTCTRL_FJOIN_TX_Pos   (30UL)                    /*!< FJOIN_TX (Bit 30)                                     */
#define PIO0_SM1_SHIFTCTRL_FJOIN_TX_Msk   (0x40000000UL)            /*!< FJOIN_TX (Bitfield-Mask: 0x01)                        */
#define PIO0_SM1_SHIFTCTRL_PULL_THRESH_Pos (25UL)                   /*!< PULL_THRESH (Bit 25)                                  */
#define PIO0_SM1_SHIFTCTRL_PULL_THRESH_Msk (0x3e000000UL)           /*!< PULL_THRESH (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM1_SHIFTCTRL_PUSH_THRESH_Pos (20UL)                   /*!< PUSH_THRESH (Bit 20)                                  */
#define PIO0_SM1_SHIFTCTRL_PUSH_THRESH_Msk (0x1f00000UL)            /*!< PUSH_THRESH (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM1_SHIFTCTRL_OUT_SHIFTDIR_Pos (19UL)                  /*!< OUT_SHIFTDIR (Bit 19)                                 */
#define PIO0_SM1_SHIFTCTRL_OUT_SHIFTDIR_Msk (0x80000UL)             /*!< OUT_SHIFTDIR (Bitfield-Mask: 0x01)                    */
#define PIO0_SM1_SHIFTCTRL_IN_SHIFTDIR_Pos (18UL)                   /*!< IN_SHIFTDIR (Bit 18)                                  */
#define PIO0_SM1_SHIFTCTRL_IN_SHIFTDIR_Msk (0x40000UL)              /*!< IN_SHIFTDIR (Bitfield-Mask: 0x01)                     */
#define PIO0_SM1_SHIFTCTRL_AUTOPULL_Pos   (17UL)                    /*!< AUTOPULL (Bit 17)                                     */
#define PIO0_SM1_SHIFTCTRL_AUTOPULL_Msk   (0x20000UL)               /*!< AUTOPULL (Bitfield-Mask: 0x01)                        */
#define PIO0_SM1_SHIFTCTRL_AUTOPUSH_Pos   (16UL)                    /*!< AUTOPUSH (Bit 16)                                     */
#define PIO0_SM1_SHIFTCTRL_AUTOPUSH_Msk   (0x10000UL)               /*!< AUTOPUSH (Bitfield-Mask: 0x01)                        */
/* =======================================================  SM1_ADDR  ======================================================== */
#define PIO0_SM1_ADDR_SM1_ADDR_Pos        (0UL)                     /*!< SM1_ADDR (Bit 0)                                      */
#define PIO0_SM1_ADDR_SM1_ADDR_Msk        (0x1fUL)                  /*!< SM1_ADDR (Bitfield-Mask: 0x1f)                        */
/* =======================================================  SM1_INSTR  ======================================================= */
#define PIO0_SM1_INSTR_SM1_INSTR_Pos      (0UL)                     /*!< SM1_INSTR (Bit 0)                                     */
#define PIO0_SM1_INSTR_SM1_INSTR_Msk      (0xffffUL)                /*!< SM1_INSTR (Bitfield-Mask: 0xffff)                     */
/* ======================================================  SM1_PINCTRL  ====================================================== */
#define PIO0_SM1_PINCTRL_SIDESET_COUNT_Pos (29UL)                   /*!< SIDESET_COUNT (Bit 29)                                */
#define PIO0_SM1_PINCTRL_SIDESET_COUNT_Msk (0xe0000000UL)           /*!< SIDESET_COUNT (Bitfield-Mask: 0x07)                   */
#define PIO0_SM1_PINCTRL_SET_COUNT_Pos    (26UL)                    /*!< SET_COUNT (Bit 26)                                    */
#define PIO0_SM1_PINCTRL_SET_COUNT_Msk    (0x1c000000UL)            /*!< SET_COUNT (Bitfield-Mask: 0x07)                       */
#define PIO0_SM1_PINCTRL_OUT_COUNT_Pos    (20UL)                    /*!< OUT_COUNT (Bit 20)                                    */
#define PIO0_SM1_PINCTRL_OUT_COUNT_Msk    (0x3f00000UL)             /*!< OUT_COUNT (Bitfield-Mask: 0x3f)                       */
#define PIO0_SM1_PINCTRL_IN_BASE_Pos      (15UL)                    /*!< IN_BASE (Bit 15)                                      */
#define PIO0_SM1_PINCTRL_IN_BASE_Msk      (0xf8000UL)               /*!< IN_BASE (Bitfield-Mask: 0x1f)                         */
#define PIO0_SM1_PINCTRL_SIDESET_BASE_Pos (10UL)                    /*!< SIDESET_BASE (Bit 10)                                 */
#define PIO0_SM1_PINCTRL_SIDESET_BASE_Msk (0x7c00UL)                /*!< SIDESET_BASE (Bitfield-Mask: 0x1f)                    */
#define PIO0_SM1_PINCTRL_SET_BASE_Pos     (5UL)                     /*!< SET_BASE (Bit 5)                                      */
#define PIO0_SM1_PINCTRL_SET_BASE_Msk     (0x3e0UL)                 /*!< SET_BASE (Bitfield-Mask: 0x1f)                        */
#define PIO0_SM1_PINCTRL_OUT_BASE_Pos     (0UL)                     /*!< OUT_BASE (Bit 0)                                      */
#define PIO0_SM1_PINCTRL_OUT_BASE_Msk     (0x1fUL)                  /*!< OUT_BASE (Bitfield-Mask: 0x1f)                        */
/* ======================================================  SM2_CLKDIV  ======================================================= */
#define PIO0_SM2_CLKDIV_INT_Pos           (16UL)                    /*!< INT (Bit 16)                                          */
#define PIO0_SM2_CLKDIV_INT_Msk           (0xffff0000UL)            /*!< INT (Bitfield-Mask: 0xffff)                           */
#define PIO0_SM2_CLKDIV_FRAC_Pos          (8UL)                     /*!< FRAC (Bit 8)                                          */
#define PIO0_SM2_CLKDIV_FRAC_Msk          (0xff00UL)                /*!< FRAC (Bitfield-Mask: 0xff)                            */
/* =====================================================  SM2_EXECCTRL  ====================================================== */
#define PIO0_SM2_EXECCTRL_EXEC_STALLED_Pos (31UL)                   /*!< EXEC_STALLED (Bit 31)                                 */
#define PIO0_SM2_EXECCTRL_EXEC_STALLED_Msk (0x80000000UL)           /*!< EXEC_STALLED (Bitfield-Mask: 0x01)                    */
#define PIO0_SM2_EXECCTRL_SIDE_EN_Pos     (30UL)                    /*!< SIDE_EN (Bit 30)                                      */
#define PIO0_SM2_EXECCTRL_SIDE_EN_Msk     (0x40000000UL)            /*!< SIDE_EN (Bitfield-Mask: 0x01)                         */
#define PIO0_SM2_EXECCTRL_SIDE_PINDIR_Pos (29UL)                    /*!< SIDE_PINDIR (Bit 29)                                  */
#define PIO0_SM2_EXECCTRL_SIDE_PINDIR_Msk (0x20000000UL)            /*!< SIDE_PINDIR (Bitfield-Mask: 0x01)                     */
#define PIO0_SM2_EXECCTRL_JMP_PIN_Pos     (24UL)                    /*!< JMP_PIN (Bit 24)                                      */
#define PIO0_SM2_EXECCTRL_JMP_PIN_Msk     (0x1f000000UL)            /*!< JMP_PIN (Bitfield-Mask: 0x1f)                         */
#define PIO0_SM2_EXECCTRL_OUT_EN_SEL_Pos  (19UL)                    /*!< OUT_EN_SEL (Bit 19)                                   */
#define PIO0_SM2_EXECCTRL_OUT_EN_SEL_Msk  (0xf80000UL)              /*!< OUT_EN_SEL (Bitfield-Mask: 0x1f)                      */
#define PIO0_SM2_EXECCTRL_INLINE_OUT_EN_Pos (18UL)                  /*!< INLINE_OUT_EN (Bit 18)                                */
#define PIO0_SM2_EXECCTRL_INLINE_OUT_EN_Msk (0x40000UL)             /*!< INLINE_OUT_EN (Bitfield-Mask: 0x01)                   */
#define PIO0_SM2_EXECCTRL_OUT_STICKY_Pos  (17UL)                    /*!< OUT_STICKY (Bit 17)                                   */
#define PIO0_SM2_EXECCTRL_OUT_STICKY_Msk  (0x20000UL)               /*!< OUT_STICKY (Bitfield-Mask: 0x01)                      */
#define PIO0_SM2_EXECCTRL_WRAP_TOP_Pos    (12UL)                    /*!< WRAP_TOP (Bit 12)                                     */
#define PIO0_SM2_EXECCTRL_WRAP_TOP_Msk    (0x1f000UL)               /*!< WRAP_TOP (Bitfield-Mask: 0x1f)                        */
#define PIO0_SM2_EXECCTRL_WRAP_BOTTOM_Pos (7UL)                     /*!< WRAP_BOTTOM (Bit 7)                                   */
#define PIO0_SM2_EXECCTRL_WRAP_BOTTOM_Msk (0xf80UL)                 /*!< WRAP_BOTTOM (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM2_EXECCTRL_STATUS_SEL_Pos  (4UL)                     /*!< STATUS_SEL (Bit 4)                                    */
#define PIO0_SM2_EXECCTRL_STATUS_SEL_Msk  (0x10UL)                  /*!< STATUS_SEL (Bitfield-Mask: 0x01)                      */
#define PIO0_SM2_EXECCTRL_STATUS_N_Pos    (0UL)                     /*!< STATUS_N (Bit 0)                                      */
#define PIO0_SM2_EXECCTRL_STATUS_N_Msk    (0xfUL)                   /*!< STATUS_N (Bitfield-Mask: 0x0f)                        */
/* =====================================================  SM2_SHIFTCTRL  ===================================================== */
#define PIO0_SM2_SHIFTCTRL_FJOIN_RX_Pos   (31UL)                    /*!< FJOIN_RX (Bit 31)                                     */
#define PIO0_SM2_SHIFTCTRL_FJOIN_RX_Msk   (0x80000000UL)            /*!< FJOIN_RX (Bitfield-Mask: 0x01)                        */
#define PIO0_SM2_SHIFTCTRL_FJOIN_TX_Pos   (30UL)                    /*!< FJOIN_TX (Bit 30)                                     */
#define PIO0_SM2_SHIFTCTRL_FJOIN_TX_Msk   (0x40000000UL)            /*!< FJOIN_TX (Bitfield-Mask: 0x01)                        */
#define PIO0_SM2_SHIFTCTRL_PULL_THRESH_Pos (25UL)                   /*!< PULL_THRESH (Bit 25)                                  */
#define PIO0_SM2_SHIFTCTRL_PULL_THRESH_Msk (0x3e000000UL)           /*!< PULL_THRESH (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM2_SHIFTCTRL_PUSH_THRESH_Pos (20UL)                   /*!< PUSH_THRESH (Bit 20)                                  */
#define PIO0_SM2_SHIFTCTRL_PUSH_THRESH_Msk (0x1f00000UL)            /*!< PUSH_THRESH (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM2_SHIFTCTRL_OUT_SHIFTDIR_Pos (19UL)                  /*!< OUT_SHIFTDIR (Bit 19)                                 */
#define PIO0_SM2_SHIFTCTRL_OUT_SHIFTDIR_Msk (0x80000UL)             /*!< OUT_SHIFTDIR (Bitfield-Mask: 0x01)                    */
#define PIO0_SM2_SHIFTCTRL_IN_SHIFTDIR_Pos (18UL)                   /*!< IN_SHIFTDIR (Bit 18)                                  */
#define PIO0_SM2_SHIFTCTRL_IN_SHIFTDIR_Msk (0x40000UL)              /*!< IN_SHIFTDIR (Bitfield-Mask: 0x01)                     */
#define PIO0_SM2_SHIFTCTRL_AUTOPULL_Pos   (17UL)                    /*!< AUTOPULL (Bit 17)                                     */
#define PIO0_SM2_SHIFTCTRL_AUTOPULL_Msk   (0x20000UL)               /*!< AUTOPULL (Bitfield-Mask: 0x01)                        */
#define PIO0_SM2_SHIFTCTRL_AUTOPUSH_Pos   (16UL)                    /*!< AUTOPUSH (Bit 16)                                     */
#define PIO0_SM2_SHIFTCTRL_AUTOPUSH_Msk   (0x10000UL)               /*!< AUTOPUSH (Bitfield-Mask: 0x01)                        */
/* =======================================================  SM2_ADDR  ======================================================== */
#define PIO0_SM2_ADDR_SM2_ADDR_Pos        (0UL)                     /*!< SM2_ADDR (Bit 0)                                      */
#define PIO0_SM2_ADDR_SM2_ADDR_Msk        (0x1fUL)                  /*!< SM2_ADDR (Bitfield-Mask: 0x1f)                        */
/* =======================================================  SM2_INSTR  ======================================================= */
#define PIO0_SM2_INSTR_SM2_INSTR_Pos      (0UL)                     /*!< SM2_INSTR (Bit 0)                                     */
#define PIO0_SM2_INSTR_SM2_INSTR_Msk      (0xffffUL)                /*!< SM2_INSTR (Bitfield-Mask: 0xffff)                     */
/* ======================================================  SM2_PINCTRL  ====================================================== */
#define PIO0_SM2_PINCTRL_SIDESET_COUNT_Pos (29UL)                   /*!< SIDESET_COUNT (Bit 29)                                */
#define PIO0_SM2_PINCTRL_SIDESET_COUNT_Msk (0xe0000000UL)           /*!< SIDESET_COUNT (Bitfield-Mask: 0x07)                   */
#define PIO0_SM2_PINCTRL_SET_COUNT_Pos    (26UL)                    /*!< SET_COUNT (Bit 26)                                    */
#define PIO0_SM2_PINCTRL_SET_COUNT_Msk    (0x1c000000UL)            /*!< SET_COUNT (Bitfield-Mask: 0x07)                       */
#define PIO0_SM2_PINCTRL_OUT_COUNT_Pos    (20UL)                    /*!< OUT_COUNT (Bit 20)                                    */
#define PIO0_SM2_PINCTRL_OUT_COUNT_Msk    (0x3f00000UL)             /*!< OUT_COUNT (Bitfield-Mask: 0x3f)                       */
#define PIO0_SM2_PINCTRL_IN_BASE_Pos      (15UL)                    /*!< IN_BASE (Bit 15)                                      */
#define PIO0_SM2_PINCTRL_IN_BASE_Msk      (0xf8000UL)               /*!< IN_BASE (Bitfield-Mask: 0x1f)                         */
#define PIO0_SM2_PINCTRL_SIDESET_BASE_Pos (10UL)                    /*!< SIDESET_BASE (Bit 10)                                 */
#define PIO0_SM2_PINCTRL_SIDESET_BASE_Msk (0x7c00UL)                /*!< SIDESET_BASE (Bitfield-Mask: 0x1f)                    */
#define PIO0_SM2_PINCTRL_SET_BASE_Pos     (5UL)                     /*!< SET_BASE (Bit 5)                                      */
#define PIO0_SM2_PINCTRL_SET_BASE_Msk     (0x3e0UL)                 /*!< SET_BASE (Bitfield-Mask: 0x1f)                        */
#define PIO0_SM2_PINCTRL_OUT_BASE_Pos     (0UL)                     /*!< OUT_BASE (Bit 0)                                      */
#define PIO0_SM2_PINCTRL_OUT_BASE_Msk     (0x1fUL)                  /*!< OUT_BASE (Bitfield-Mask: 0x1f)                        */
/* ======================================================  SM3_CLKDIV  ======================================================= */
#define PIO0_SM3_CLKDIV_INT_Pos           (16UL)                    /*!< INT (Bit 16)                                          */
#define PIO0_SM3_CLKDIV_INT_Msk           (0xffff0000UL)            /*!< INT (Bitfield-Mask: 0xffff)                           */
#define PIO0_SM3_CLKDIV_FRAC_Pos          (8UL)                     /*!< FRAC (Bit 8)                                          */
#define PIO0_SM3_CLKDIV_FRAC_Msk          (0xff00UL)                /*!< FRAC (Bitfield-Mask: 0xff)                            */
/* =====================================================  SM3_EXECCTRL  ====================================================== */
#define PIO0_SM3_EXECCTRL_EXEC_STALLED_Pos (31UL)                   /*!< EXEC_STALLED (Bit 31)                                 */
#define PIO0_SM3_EXECCTRL_EXEC_STALLED_Msk (0x80000000UL)           /*!< EXEC_STALLED (Bitfield-Mask: 0x01)                    */
