mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define PIO0_SM3_EXECCTRL_SIDE_EN_Pos     (30UL)                    /*!< SIDE_EN (Bit 30)                                      */
#define PIO0_SM3_EXECCTRL_SIDE_EN_Msk     (0x40000000UL)            /*!< SIDE_EN (Bitfield-Mask: 0x01)                         */
#define PIO0_SM3_EXECCTRL_SIDE_PINDIR_Pos (29UL)                    /*!< SIDE_PINDIR (Bit 29)                                  */
#define PIO0_SM3_EXECCTRL_SIDE_PINDIR_Msk (0x20000000UL)            /*!< SIDE_PINDIR (Bitfield-Mask: 0x01)                     */
#define PIO0_SM3_EXECCTRL_JMP_PIN_Pos     (24UL)                    /*!< JMP_PIN (Bit 24)                                      */
#define PIO0_SM3_EXECCTRL_JMP_PIN_Msk     (0x1f000000UL)            /*!< JMP_PIN (Bitfield-Mask: 0x1f)                         */
#define PIO0_SM3_EXECCTRL_OUT_EN_SEL_Pos  (19UL)                    /*!< OUT_EN_SEL (Bit 19)                                   */
#define PIO0_SM3_EXECCTRL_OUT_EN_SEL_Msk  (0xf80000UL)              /*!< OUT_EN_SEL (Bitfield-Mask: 0x1f)                      */
#define PIO0_SM3_EXECCTRL_INLINE_OUT_EN_Pos (18UL)                  /*!< INLINE_OUT_EN (Bit 18)                                */
#define PIO0_SM3_EXECCTRL_INLINE_OUT_EN_Msk (0x40000UL)             /*!< INLINE_OUT_EN (Bitfield-Mask: 0x01)                   */
#define PIO0_SM3_EXECCTRL_OUT_STICKY_Pos  (17UL)                    /*!< OUT_STICKY (Bit 17)                                   */
#define PIO0_SM3_EXECCTRL_OUT_STICKY_Msk  (0x20000UL)               /*!< OUT_STICKY (Bitfield-Mask: 0x01)                      */
#define PIO0_SM3_EXECCTRL_WRAP_TOP_Pos    (12UL)                    /*!< WRAP_TOP (Bit 12)                                     */
#define PIO0_SM3_EXECCTRL_WRAP_TOP_Msk    (0x1f000UL)               /*!< WRAP_TOP (Bitfield-Mask: 0x1f)                        */
#define PIO0_SM3_EXECCTRL_WRAP_BOTTOM_Pos (7UL)                     /*!< WRAP_BOTTOM (Bit 7)                                   */
#define PIO0_SM3_EXECCTRL_WRAP_BOTTOM_Msk (0xf80UL)                 /*!< WRAP_BOTTOM (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM3_EXECCTRL_STATUS_SEL_Pos  (4UL)                     /*!< STATUS_SEL (Bit 4)                                    */
#define PIO0_SM3_EXECCTRL_STATUS_SEL_Msk  (0x10UL)                  /*!< STATUS_SEL (Bitfield-Mask: 0x01)                      */
#define PIO0_SM3_EXECCTRL_STATUS_N_Pos    (0UL)                     /*!< STATUS_N (Bit 0)                                      */
#define PIO0_SM3_EXECCTRL_STATUS_N_Msk    (0xfUL)                   /*!< STATUS_N (Bitfield-Mask: 0x0f)                        */
/* =====================================================  SM3_SHIFTCTRL  ===================================================== */
#define PIO0_SM3_SHIFTCTRL_FJOIN_RX_Pos   (31UL)                    /*!< FJOIN_RX (Bit 31)                                     */
#define PIO0_SM3_SHIFTCTRL_FJOIN_RX_Msk   (0x80000000UL)            /*!< FJOIN_RX (Bitfield-Mask: 0x01)                        */
#define PIO0_SM3_SHIFTCTRL_FJOIN_TX_Pos   (30UL)                    /*!< FJOIN_TX (Bit 30)                                     */
#define PIO0_SM3_SHIFTCTRL_FJOIN_TX_Msk   (0x40000000UL)            /*!< FJOIN_TX (Bitfield-Mask: 0x01)                        */
#define PIO0_SM3_SHIFTCTRL_PULL_THRESH_Pos (25UL)                   /*!< PULL_THRESH (Bit 25)                                  */
#define PIO0_SM3_SHIFTCTRL_PULL_THRESH_Msk (0x3e000000UL)           /*!< PULL_THRESH (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM3_SHIFTCTRL_PUSH_THRESH_Pos (20UL)                   /*!< PUSH_THRESH (Bit 20)                                  */
#define PIO0_SM3_SHIFTCTRL_PUSH_THRESH_Msk (0x1f00000UL)            /*!< PUSH_THRESH (Bitfield-Mask: 0x1f)                     */
#define PIO0_SM3_SHIFTCTRL_OUT_SHIFTDIR_Pos (19UL)                  /*!< OUT_SHIFTDIR (Bit 19)                                 */
#define PIO0_SM3_SHIFTCTRL_OUT_SHIFTDIR_Msk (0x80000UL)             /*!< OUT_SHIFTDIR (Bitfield-Mask: 0x01)                    */
#define PIO0_SM3_SHIFTCTRL_IN_SHIFTDIR_Pos (18UL)                   /*!< IN_SHIFTDIR (Bit 18)                                  */
#define PIO0_SM3_SHIFTCTRL_IN_SHIFTDIR_Msk (0x40000UL)              /*!< IN_SHIFTDIR (Bitfield-Mask: 0x01)                     */
#define PIO0_SM3_SHIFTCTRL_AUTOPULL_Pos   (17UL)                    /*!< AUTOPULL (Bit 17)                                     */
#define PIO0_SM3_SHIFTCTRL_AUTOPULL_Msk   (0x20000UL)               /*!< AUTOPULL (Bitfield-Mask: 0x01)                        */
#define PIO0_SM3_SHIFTCTRL_AUTOPUSH_Pos   (16UL)                    /*!< AUTOPUSH (Bit 16)                                     */
#define PIO0_SM3_SHIFTCTRL_AUTOPUSH_Msk   (0x10000UL)               /*!< AUTOPUSH (Bitfield-Mask: 0x01)                        */
/* =======================================================  SM3_ADDR  ======================================================== */
#define PIO0_SM3_ADDR_SM3_ADDR_Pos        (0UL)                     /*!< SM3_ADDR (Bit 0)                                      */
#define PIO0_SM3_ADDR_SM3_ADDR_Msk        (0x1fUL)                  /*!< SM3_ADDR (Bitfield-Mask: 0x1f)                        */
/* =======================================================  SM3_INSTR  ======================================================= */
#define PIO0_SM3_INSTR_SM3_INSTR_Pos      (0UL)                     /*!< SM3_INSTR (Bit 0)                                     */
#define PIO0_SM3_INSTR_SM3_INSTR_Msk      (0xffffUL)                /*!< SM3_INSTR (Bitfield-Mask: 0xffff)                     */
/* ======================================================  SM3_PINCTRL  ====================================================== */
#define PIO0_SM3_PINCTRL_SIDESET_COUNT_Pos (29UL)                   /*!< SIDESET_COUNT (Bit 29)                                */
#define PIO0_SM3_PINCTRL_SIDESET_COUNT_Msk (0xe0000000UL)           /*!< SIDESET_COUNT (Bitfield-Mask: 0x07)                   */
#define PIO0_SM3_PINCTRL_SET_COUNT_Pos    (26UL)                    /*!< SET_COUNT (Bit 26)                                    */
#define PIO0_SM3_PINCTRL_SET_COUNT_Msk    (0x1c000000UL)            /*!< SET_COUNT (Bitfield-Mask: 0x07)                       */
#define PIO0_SM3_PINCTRL_OUT_COUNT_Pos    (20UL)                    /*!< OUT_COUNT (Bit 20)                                    */
#define PIO0_SM3_PINCTRL_OUT_COUNT_Msk    (0x3f00000UL)             /*!< OUT_COUNT (Bitfield-Mask: 0x3f)                       */
#define PIO0_SM3_PINCTRL_IN_BASE_Pos      (15UL)                    /*!< IN_BASE (Bit 15)                                      */
#define PIO0_SM3_PINCTRL_IN_BASE_Msk      (0xf8000UL)               /*!< IN_BASE (Bitfield-Mask: 0x1f)                         */
#define PIO0_SM3_PINCTRL_SIDESET_BASE_Pos (10UL)                    /*!< SIDESET_BASE (Bit 10)                                 */
#define PIO0_SM3_PINCTRL_SIDESET_BASE_Msk (0x7c00UL)                /*!< SIDESET_BASE (Bitfield-Mask: 0x1f)                    */
#define PIO0_SM3_PINCTRL_SET_BASE_Pos     (5UL)                     /*!< SET_BASE (Bit 5)                                      */
#define PIO0_SM3_PINCTRL_SET_BASE_Msk     (0x3e0UL)                 /*!< SET_BASE (Bitfield-Mask: 0x1f)                        */
#define PIO0_SM3_PINCTRL_OUT_BASE_Pos     (0UL)                     /*!< OUT_BASE (Bit 0)                                      */
#define PIO0_SM3_PINCTRL_OUT_BASE_Msk     (0x1fUL)                  /*!< OUT_BASE (Bitfield-Mask: 0x1f)                        */
/* =========================================================  INTR  ========================================================== */
#define PIO0_INTR_SM3_Pos                 (11UL)                    /*!< SM3 (Bit 11)                                          */
#define PIO0_INTR_SM3_Msk                 (0x800UL)                 /*!< SM3 (Bitfield-Mask: 0x01)                             */
#define PIO0_INTR_SM2_Pos                 (10UL)                    /*!< SM2 (Bit 10)                                          */
#define PIO0_INTR_SM2_Msk                 (0x400UL)                 /*!< SM2 (Bitfield-Mask: 0x01)                             */
#define PIO0_INTR_SM1_Pos                 (9UL)                     /*!< SM1 (Bit 9)                                           */
#define PIO0_INTR_SM1_Msk                 (0x200UL)                 /*!< SM1 (Bitfield-Mask: 0x01)                             */
#define PIO0_INTR_SM0_Pos                 (8UL)                     /*!< SM0 (Bit 8)                                           */
#define PIO0_INTR_SM0_Msk                 (0x100UL)                 /*!< SM0 (Bitfield-Mask: 0x01)                             */
#define PIO0_INTR_SM3_TXNFULL_Pos         (7UL)                     /*!< SM3_TXNFULL (Bit 7)                                   */
#define PIO0_INTR_SM3_TXNFULL_Msk         (0x80UL)                  /*!< SM3_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_INTR_SM2_TXNFULL_Pos         (6UL)                     /*!< SM2_TXNFULL (Bit 6)                                   */
#define PIO0_INTR_SM2_TXNFULL_Msk         (0x40UL)                  /*!< SM2_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_INTR_SM1_TXNFULL_Pos         (5UL)                     /*!< SM1_TXNFULL (Bit 5)                                   */
#define PIO0_INTR_SM1_TXNFULL_Msk         (0x20UL)                  /*!< SM1_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_INTR_SM0_TXNFULL_Pos         (4UL)                     /*!< SM0_TXNFULL (Bit 4)                                   */
#define PIO0_INTR_SM0_TXNFULL_Msk         (0x10UL)                  /*!< SM0_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_INTR_SM3_RXNEMPTY_Pos        (3UL)                     /*!< SM3_RXNEMPTY (Bit 3)                                  */
#define PIO0_INTR_SM3_RXNEMPTY_Msk        (0x8UL)                   /*!< SM3_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_INTR_SM2_RXNEMPTY_Pos        (2UL)                     /*!< SM2_RXNEMPTY (Bit 2)                                  */
#define PIO0_INTR_SM2_RXNEMPTY_Msk        (0x4UL)                   /*!< SM2_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_INTR_SM1_RXNEMPTY_Pos        (1UL)                     /*!< SM1_RXNEMPTY (Bit 1)                                  */
#define PIO0_INTR_SM1_RXNEMPTY_Msk        (0x2UL)                   /*!< SM1_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_INTR_SM0_RXNEMPTY_Pos        (0UL)                     /*!< SM0_RXNEMPTY (Bit 0)                                  */
#define PIO0_INTR_SM0_RXNEMPTY_Msk        (0x1UL)                   /*!< SM0_RXNEMPTY (Bitfield-Mask: 0x01)                    */
/* =======================================================  IRQ0_INTE  ======================================================= */
#define PIO0_IRQ0_INTE_SM3_Pos            (11UL)                    /*!< SM3 (Bit 11)                                          */
#define PIO0_IRQ0_INTE_SM3_Msk            (0x800UL)                 /*!< SM3 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTE_SM2_Pos            (10UL)                    /*!< SM2 (Bit 10)                                          */
#define PIO0_IRQ0_INTE_SM2_Msk            (0x400UL)                 /*!< SM2 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTE_SM1_Pos            (9UL)                     /*!< SM1 (Bit 9)                                           */
#define PIO0_IRQ0_INTE_SM1_Msk            (0x200UL)                 /*!< SM1 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTE_SM0_Pos            (8UL)                     /*!< SM0 (Bit 8)                                           */
#define PIO0_IRQ0_INTE_SM0_Msk            (0x100UL)                 /*!< SM0 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTE_SM3_TXNFULL_Pos    (7UL)                     /*!< SM3_TXNFULL (Bit 7)                                   */
#define PIO0_IRQ0_INTE_SM3_TXNFULL_Msk    (0x80UL)                  /*!< SM3_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTE_SM2_TXNFULL_Pos    (6UL)                     /*!< SM2_TXNFULL (Bit 6)                                   */
#define PIO0_IRQ0_INTE_SM2_TXNFULL_Msk    (0x40UL)                  /*!< SM2_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTE_SM1_TXNFULL_Pos    (5UL)                     /*!< SM1_TXNFULL (Bit 5)                                   */
#define PIO0_IRQ0_INTE_SM1_TXNFULL_Msk    (0x20UL)                  /*!< SM1_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTE_SM0_TXNFULL_Pos    (4UL)                     /*!< SM0_TXNFULL (Bit 4)                                   */
#define PIO0_IRQ0_INTE_SM0_TXNFULL_Msk    (0x10UL)                  /*!< SM0_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTE_SM3_RXNEMPTY_Pos   (3UL)                     /*!< SM3_RXNEMPTY (Bit 3)                                  */
#define PIO0_IRQ0_INTE_SM3_RXNEMPTY_Msk   (0x8UL)                   /*!< SM3_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ0_INTE_SM2_RXNEMPTY_Pos   (2UL)                     /*!< SM2_RXNEMPTY (Bit 2)                                  */
#define PIO0_IRQ0_INTE_SM2_RXNEMPTY_Msk   (0x4UL)                   /*!< SM2_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ0_INTE_SM1_RXNEMPTY_Pos   (1UL)                     /*!< SM1_RXNEMPTY (Bit 1)                                  */
#define PIO0_IRQ0_INTE_SM1_RXNEMPTY_Msk   (0x2UL)                   /*!< SM1_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ0_INTE_SM0_RXNEMPTY_Pos   (0UL)                     /*!< SM0_RXNEMPTY (Bit 0)                                  */
#define PIO0_IRQ0_INTE_SM0_RXNEMPTY_Msk   (0x1UL)                   /*!< SM0_RXNEMPTY (Bitfield-Mask: 0x01)                    */
/* =======================================================  IRQ0_INTF  ======================================================= */
#define PIO0_IRQ0_INTF_SM3_Pos            (11UL)                    /*!< SM3 (Bit 11)                                          */
#define PIO0_IRQ0_INTF_SM3_Msk            (0x800UL)                 /*!< SM3 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTF_SM2_Pos            (10UL)                    /*!< SM2 (Bit 10)                                          */
#define PIO0_IRQ0_INTF_SM2_Msk            (0x400UL)                 /*!< SM2 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTF_SM1_Pos            (9UL)                     /*!< SM1 (Bit 9)                                           */
#define PIO0_IRQ0_INTF_SM1_Msk            (0x200UL)                 /*!< SM1 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTF_SM0_Pos            (8UL)                     /*!< SM0 (Bit 8)                                           */
#define PIO0_IRQ0_INTF_SM0_Msk            (0x100UL)                 /*!< SM0 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTF_SM3_TXNFULL_Pos    (7UL)                     /*!< SM3_TXNFULL (Bit 7)                                   */
#define PIO0_IRQ0_INTF_SM3_TXNFULL_Msk    (0x80UL)                  /*!< SM3_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTF_SM2_TXNFULL_Pos    (6UL)                     /*!< SM2_TXNFULL (Bit 6)                                   */
#define PIO0_IRQ0_INTF_SM2_TXNFULL_Msk    (0x40UL)                  /*!< SM2_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTF_SM1_TXNFULL_Pos    (5UL)                     /*!< SM1_TXNFULL (Bit 5)                                   */
#define PIO0_IRQ0_INTF_SM1_TXNFULL_Msk    (0x20UL)                  /*!< SM1_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTF_SM0_TXNFULL_Pos    (4UL)                     /*!< SM0_TXNFULL (Bit 4)                                   */
#define PIO0_IRQ0_INTF_SM0_TXNFULL_Msk    (0x10UL)                  /*!< SM0_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTF_SM3_RXNEMPTY_Pos   (3UL)                     /*!< SM3_RXNEMPTY (Bit 3)                                  */
#define PIO0_IRQ0_INTF_SM3_RXNEMPTY_Msk   (0x8UL)                   /*!< SM3_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ0_INTF_SM2_RXNEMPTY_Pos   (2UL)                     /*!< SM2_RXNEMPTY (Bit 2)                                  */
#define PIO0_IRQ0_INTF_SM2_RXNEMPTY_Msk   (0x4UL)                   /*!< SM2_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ0_INTF_SM1_RXNEMPTY_Pos   (1UL)                     /*!< SM1_RXNEMPTY (Bit 1)                                  */
#define PIO0_IRQ0_INTF_SM1_RXNEMPTY_Msk   (0x2UL)                   /*!< SM1_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ0_INTF_SM0_RXNEMPTY_Pos   (0UL)                     /*!< SM0_RXNEMPTY (Bit 0)                                  */
#define PIO0_IRQ0_INTF_SM0_RXNEMPTY_Msk   (0x1UL)                   /*!< SM0_RXNEMPTY (Bitfield-Mask: 0x01)                    */
/* =======================================================  IRQ0_INTS  ======================================================= */
#define PIO0_IRQ0_INTS_SM3_Pos            (11UL)                    /*!< SM3 (Bit 11)                                          */
#define PIO0_IRQ0_INTS_SM3_Msk            (0x800UL)                 /*!< SM3 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTS_SM2_Pos            (10UL)                    /*!< SM2 (Bit 10)                                          */
#define PIO0_IRQ0_INTS_SM2_Msk            (0x400UL)                 /*!< SM2 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTS_SM1_Pos            (9UL)                     /*!< SM1 (Bit 9)                                           */
#define PIO0_IRQ0_INTS_SM1_Msk            (0x200UL)                 /*!< SM1 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTS_SM0_Pos            (8UL)                     /*!< SM0 (Bit 8)                                           */
#define PIO0_IRQ0_INTS_SM0_Msk            (0x100UL)                 /*!< SM0 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ0_INTS_SM3_TXNFULL_Pos    (7UL)                     /*!< SM3_TXNFULL (Bit 7)                                   */
#define PIO0_IRQ0_INTS_SM3_TXNFULL_Msk    (0x80UL)                  /*!< SM3_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTS_SM2_TXNFULL_Pos    (6UL)                     /*!< SM2_TXNFULL (Bit 6)                                   */
#define PIO0_IRQ0_INTS_SM2_TXNFULL_Msk    (0x40UL)                  /*!< SM2_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTS_SM1_TXNFULL_Pos    (5UL)                     /*!< SM1_TXNFULL (Bit 5)                                   */
#define PIO0_IRQ0_INTS_SM1_TXNFULL_Msk    (0x20UL)                  /*!< SM1_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTS_SM0_TXNFULL_Pos    (4UL)                     /*!< SM0_TXNFULL (Bit 4)                                   */
#define PIO0_IRQ0_INTS_SM0_TXNFULL_Msk    (0x10UL)                  /*!< SM0_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ0_INTS_SM3_RXNEMPTY_Pos   (3UL)                     /*!< SM3_RXNEMPTY (Bit 3)                                  */
#define PIO0_IRQ0_INTS_SM3_RXNEMPTY_Msk   (0x8UL)                   /*!< SM3_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ0_INTS_SM2_RXNEMPTY_Pos   (2UL)                     /*!< SM2_RXNEMPTY (Bit 2)                                  */
#define PIO0_IRQ0_INTS_SM2_RXNEMPTY_Msk   (0x4UL)                   /*!< SM2_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ0_INTS_SM1_RXNEMPTY_Pos   (1UL)                     /*!< SM1_RXNEMPTY (Bit 1)                                  */
#define PIO0_IRQ0_INTS_SM1_RXNEMPTY_Msk   (0x2UL)                   /*!< SM1_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ0_INTS_SM0_RXNEMPTY_Pos   (0UL)                     /*!< SM0_RXNEMPTY (Bit 0)                                  */
#define PIO0_IRQ0_INTS_SM0_RXNEMPTY_Msk   (0x1UL)                   /*!< SM0_RXNEMPTY (Bitfield-Mask: 0x01)                    */
/* =======================================================  IRQ1_INTE  ======================================================= */
#define PIO0_IRQ1_INTE_SM3_Pos            (11UL)                    /*!< SM3 (Bit 11)                                          */
#define PIO0_IRQ1_INTE_SM3_Msk            (0x800UL)                 /*!< SM3 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTE_SM2_Pos            (10UL)                    /*!< SM2 (Bit 10)                                          */
#define PIO0_IRQ1_INTE_SM2_Msk            (0x400UL)                 /*!< SM2 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTE_SM1_Pos            (9UL)                     /*!< SM1 (Bit 9)                                           */
#define PIO0_IRQ1_INTE_SM1_Msk            (0x200UL)                 /*!< SM1 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTE_SM0_Pos            (8UL)                     /*!< SM0 (Bit 8)                                           */
#define PIO0_IRQ1_INTE_SM0_Msk            (0x100UL)                 /*!< SM0 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTE_SM3_TXNFULL_Pos    (7UL)                     /*!< SM3_TXNFULL (Bit 7)                                   */
#define PIO0_IRQ1_INTE_SM3_TXNFULL_Msk    (0x80UL)                  /*!< SM3_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTE_SM2_TXNFULL_Pos    (6UL)                     /*!< SM2_TXNFULL (Bit 6)                                   */
#define PIO0_IRQ1_INTE_SM2_TXNFULL_Msk    (0x40UL)                  /*!< SM2_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTE_SM1_TXNFULL_Pos    (5UL)                     /*!< SM1_TXNFULL (Bit 5)                                   */
#define PIO0_IRQ1_INTE_SM1_TXNFULL_Msk    (0x20UL)                  /*!< SM1_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTE_SM0_TXNFULL_Pos    (4UL)                     /*!< SM0_TXNFULL (Bit 4)                                   */
#define PIO0_IRQ1_INTE_SM0_TXNFULL_Msk    (0x10UL)                  /*!< SM0_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTE_SM3_RXNEMPTY_Pos   (3UL)                     /*!< SM3_RXNEMPTY (Bit 3)                                  */
#define PIO0_IRQ1_INTE_SM3_RXNEMPTY_Msk   (0x8UL)                   /*!< SM3_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ1_INTE_SM2_RXNEMPTY_Pos   (2UL)                     /*!< SM2_RXNEMPTY (Bit 2)                                  */
#define PIO0_IRQ1_INTE_SM2_RXNEMPTY_Msk   (0x4UL)                   /*!< SM2_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ1_INTE_SM1_RXNEMPTY_Pos   (1UL)                     /*!< SM1_RXNEMPTY (Bit 1)                                  */
#define PIO0_IRQ1_INTE_SM1_RXNEMPTY_Msk   (0x2UL)                   /*!< SM1_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ1_INTE_SM0_RXNEMPTY_Pos   (0UL)                     /*!< SM0_RXNEMPTY (Bit 0)                                  */
#define PIO0_IRQ1_INTE_SM0_RXNEMPTY_Msk   (0x1UL)                   /*!< SM0_RXNEMPTY (Bitfield-Mask: 0x01)                    */
/* =======================================================  IRQ1_INTF  ======================================================= */
