mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define PIO0_IRQ1_INTF_SM3_Pos            (11UL)                    /*!< SM3 (Bit 11)                                          */
#define PIO0_IRQ1_INTF_SM3_Msk            (0x800UL)                 /*!< SM3 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTF_SM2_Pos            (10UL)                    /*!< SM2 (Bit 10)                                          */
#define PIO0_IRQ1_INTF_SM2_Msk            (0x400UL)                 /*!< SM2 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTF_SM1_Pos            (9UL)                     /*!< SM1 (Bit 9)                                           */
#define PIO0_IRQ1_INTF_SM1_Msk            (0x200UL)                 /*!< SM1 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTF_SM0_Pos            (8UL)                     /*!< SM0 (Bit 8)                                           */
#define PIO0_IRQ1_INTF_SM0_Msk            (0x100UL)                 /*!< SM0 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTF_SM3_TXNFULL_Pos    (7UL)                     /*!< SM3_TXNFULL (Bit 7)                                   */
#define PIO0_IRQ1_INTF_SM3_TXNFULL_Msk    (0x80UL)                  /*!< SM3_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTF_SM2_TXNFULL_Pos    (6UL)                     /*!< SM2_TXNFULL (Bit 6)                                   */
#define PIO0_IRQ1_INTF_SM2_TXNFULL_Msk    (0x40UL)                  /*!< SM2_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTF_SM1_TXNFULL_Pos    (5UL)                     /*!< SM1_TXNFULL (Bit 5)                                   */
#define PIO0_IRQ1_INTF_SM1_TXNFULL_Msk    (0x20UL)                  /*!< SM1_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTF_SM0_TXNFULL_Pos    (4UL)                     /*!< SM0_TXNFULL (Bit 4)                                   */
#define PIO0_IRQ1_INTF_SM0_TXNFULL_Msk    (0x10UL)                  /*!< SM0_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTF_SM3_RXNEMPTY_Pos   (3UL)                     /*!< SM3_RXNEMPTY (Bit 3)                                  */
#define PIO0_IRQ1_INTF_SM3_RXNEMPTY_Msk   (0x8UL)                   /*!< SM3_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ1_INTF_SM2_RXNEMPTY_Pos   (2UL)                     /*!< SM2_RXNEMPTY (Bit 2)                                  */
#define PIO0_IRQ1_INTF_SM2_RXNEMPTY_Msk   (0x4UL)                   /*!< SM2_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ1_INTF_SM1_RXNEMPTY_Pos   (1UL)                     /*!< SM1_RXNEMPTY (Bit 1)                                  */
#define PIO0_IRQ1_INTF_SM1_RXNEMPTY_Msk   (0x2UL)                   /*!< SM1_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ1_INTF_SM0_RXNEMPTY_Pos   (0UL)                     /*!< SM0_RXNEMPTY (Bit 0)                                  */
#define PIO0_IRQ1_INTF_SM0_RXNEMPTY_Msk   (0x1UL)                   /*!< SM0_RXNEMPTY (Bitfield-Mask: 0x01)                    */
/* =======================================================  IRQ1_INTS  ======================================================= */
#define PIO0_IRQ1_INTS_SM3_Pos            (11UL)                    /*!< SM3 (Bit 11)                                          */
#define PIO0_IRQ1_INTS_SM3_Msk            (0x800UL)                 /*!< SM3 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTS_SM2_Pos            (10UL)                    /*!< SM2 (Bit 10)                                          */
#define PIO0_IRQ1_INTS_SM2_Msk            (0x400UL)                 /*!< SM2 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTS_SM1_Pos            (9UL)                     /*!< SM1 (Bit 9)                                           */
#define PIO0_IRQ1_INTS_SM1_Msk            (0x200UL)                 /*!< SM1 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTS_SM0_Pos            (8UL)                     /*!< SM0 (Bit 8)                                           */
#define PIO0_IRQ1_INTS_SM0_Msk            (0x100UL)                 /*!< SM0 (Bitfield-Mask: 0x01)                             */
#define PIO0_IRQ1_INTS_SM3_TXNFULL_Pos    (7UL)                     /*!< SM3_TXNFULL (Bit 7)                                   */
#define PIO0_IRQ1_INTS_SM3_TXNFULL_Msk    (0x80UL)                  /*!< SM3_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTS_SM2_TXNFULL_Pos    (6UL)                     /*!< SM2_TXNFULL (Bit 6)                                   */
#define PIO0_IRQ1_INTS_SM2_TXNFULL_Msk    (0x40UL)                  /*!< SM2_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTS_SM1_TXNFULL_Pos    (5UL)                     /*!< SM1_TXNFULL (Bit 5)                                   */
#define PIO0_IRQ1_INTS_SM1_TXNFULL_Msk    (0x20UL)                  /*!< SM1_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTS_SM0_TXNFULL_Pos    (4UL)                     /*!< SM0_TXNFULL (Bit 4)                                   */
#define PIO0_IRQ1_INTS_SM0_TXNFULL_Msk    (0x10UL)                  /*!< SM0_TXNFULL (Bitfield-Mask: 0x01)                     */
#define PIO0_IRQ1_INTS_SM3_RXNEMPTY_Pos   (3UL)                     /*!< SM3_RXNEMPTY (Bit 3)                                  */
#define PIO0_IRQ1_INTS_SM3_RXNEMPTY_Msk   (0x8UL)                   /*!< SM3_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ1_INTS_SM2_RXNEMPTY_Pos   (2UL)                     /*!< SM2_RXNEMPTY (Bit 2)                                  */
#define PIO0_IRQ1_INTS_SM2_RXNEMPTY_Msk   (0x4UL)                   /*!< SM2_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ1_INTS_SM1_RXNEMPTY_Pos   (1UL)                     /*!< SM1_RXNEMPTY (Bit 1)                                  */
#define PIO0_IRQ1_INTS_SM1_RXNEMPTY_Msk   (0x2UL)                   /*!< SM1_RXNEMPTY (Bitfield-Mask: 0x01)                    */
#define PIO0_IRQ1_INTS_SM0_RXNEMPTY_Pos   (0UL)                     /*!< SM0_RXNEMPTY (Bit 0)                                  */
#define PIO0_IRQ1_INTS_SM0_RXNEMPTY_Msk   (0x1UL)                   /*!< SM0_RXNEMPTY (Bitfield-Mask: 0x01)                    */


/* =========================================================================================================================== */
/* ================                                            SIO                                            ================ */
/* =========================================================================================================================== */

