mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =========================================================  CPUID  ========================================================= */
/* ========================================================  GPIO_IN  ======================================================== */
#define SIO_GPIO_IN_GPIO_IN_Pos           (0UL)                     /*!< GPIO_IN (Bit 0)                                       */
#define SIO_GPIO_IN_GPIO_IN_Msk           (0x3fffffffUL)            /*!< GPIO_IN (Bitfield-Mask: 0x3fffffff)                   */
/* ======================================================  GPIO_HI_IN  ======================================================= */
#define SIO_GPIO_HI_IN_GPIO_HI_IN_Pos     (0UL)                     /*!< GPIO_HI_IN (Bit 0)                                    */
#define SIO_GPIO_HI_IN_GPIO_HI_IN_Msk     (0x3fUL)                  /*!< GPIO_HI_IN (Bitfield-Mask: 0x3f)                      */
/* =======================================================  GPIO_OUT  ======================================================== */
#define SIO_GPIO_OUT_GPIO_OUT_Pos         (0UL)                     /*!< GPIO_OUT (Bit 0)                                      */
#define SIO_GPIO_OUT_GPIO_OUT_Msk         (0x3fffffffUL)            /*!< GPIO_OUT (Bitfield-Mask: 0x3fffffff)                  */
/* =====================================================  GPIO_OUT_SET  ====================================================== */
#define SIO_GPIO_OUT_SET_GPIO_OUT_SET_Pos (0UL)                     /*!< GPIO_OUT_SET (Bit 0)                                  */
#define SIO_GPIO_OUT_SET_GPIO_OUT_SET_Msk (0x3fffffffUL)            /*!< GPIO_OUT_SET (Bitfield-Mask: 0x3fffffff)              */
/* =====================================================  GPIO_OUT_CLR  ====================================================== */
#define SIO_GPIO_OUT_CLR_GPIO_OUT_CLR_Pos (0UL)                     /*!< GPIO_OUT_CLR (Bit 0)                                  */
#define SIO_GPIO_OUT_CLR_GPIO_OUT_CLR_Msk (0x3fffffffUL)            /*!< GPIO_OUT_CLR (Bitfield-Mask: 0x3fffffff)              */
/* =====================================================  GPIO_OUT_XOR  ====================================================== */
#define SIO_GPIO_OUT_XOR_GPIO_OUT_XOR_Pos (0UL)                     /*!< GPIO_OUT_XOR (Bit 0)                                  */
#define SIO_GPIO_OUT_XOR_GPIO_OUT_XOR_Msk (0x3fffffffUL)            /*!< GPIO_OUT_XOR (Bitfield-Mask: 0x3fffffff)              */
/* ========================================================  GPIO_OE  ======================================================== */
#define SIO_GPIO_OE_GPIO_OE_Pos           (0UL)                     /*!< GPIO_OE (Bit 0)                                       */
#define SIO_GPIO_OE_GPIO_OE_Msk           (0x3fffffffUL)            /*!< GPIO_OE (Bitfield-Mask: 0x3fffffff)                   */
/* ======================================================  GPIO_OE_SET  ====================================================== */
#define SIO_GPIO_OE_SET_GPIO_OE_SET_Pos   (0UL)                     /*!< GPIO_OE_SET (Bit 0)                                   */
#define SIO_GPIO_OE_SET_GPIO_OE_SET_Msk   (0x3fffffffUL)            /*!< GPIO_OE_SET (Bitfield-Mask: 0x3fffffff)               */
/* ======================================================  GPIO_OE_CLR  ====================================================== */
#define SIO_GPIO_OE_CLR_GPIO_OE_CLR_Pos   (0UL)                     /*!< GPIO_OE_CLR (Bit 0)                                   */
#define SIO_GPIO_OE_CLR_GPIO_OE_CLR_Msk   (0x3fffffffUL)            /*!< GPIO_OE_CLR (Bitfield-Mask: 0x3fffffff)               */
/* ======================================================  GPIO_OE_XOR  ====================================================== */
#define SIO_GPIO_OE_XOR_GPIO_OE_XOR_Pos   (0UL)                     /*!< GPIO_OE_XOR (Bit 0)                                   */
#define SIO_GPIO_OE_XOR_GPIO_OE_XOR_Msk   (0x3fffffffUL)            /*!< GPIO_OE_XOR (Bitfield-Mask: 0x3fffffff)               */
/* ======================================================  GPIO_HI_OUT  ====================================================== */
#define SIO_GPIO_HI_OUT_GPIO_HI_OUT_Pos   (0UL)                     /*!< GPIO_HI_OUT (Bit 0)                                   */
#define SIO_GPIO_HI_OUT_GPIO_HI_OUT_Msk   (0x3fUL)                  /*!< GPIO_HI_OUT (Bitfield-Mask: 0x3f)                     */
/* ====================================================  GPIO_HI_OUT_SET  ==================================================== */
#define SIO_GPIO_HI_OUT_SET_GPIO_HI_OUT_SET_Pos (0UL)               /*!< GPIO_HI_OUT_SET (Bit 0)                               */
#define SIO_GPIO_HI_OUT_SET_GPIO_HI_OUT_SET_Msk (0x3fUL)            /*!< GPIO_HI_OUT_SET (Bitfield-Mask: 0x3f)                 */
/* ====================================================  GPIO_HI_OUT_CLR  ==================================================== */
#define SIO_GPIO_HI_OUT_CLR_GPIO_HI_OUT_CLR_Pos (0UL)               /*!< GPIO_HI_OUT_CLR (Bit 0)                               */
#define SIO_GPIO_HI_OUT_CLR_GPIO_HI_OUT_CLR_Msk (0x3fUL)            /*!< GPIO_HI_OUT_CLR (Bitfield-Mask: 0x3f)                 */
/* ====================================================  GPIO_HI_OUT_XOR  ==================================================== */
#define SIO_GPIO_HI_OUT_XOR_GPIO_HI_OUT_XOR_Pos (0UL)               /*!< GPIO_HI_OUT_XOR (Bit 0)                               */
#define SIO_GPIO_HI_OUT_XOR_GPIO_HI_OUT_XOR_Msk (0x3fUL)            /*!< GPIO_HI_OUT_XOR (Bitfield-Mask: 0x3f)                 */
/* ======================================================  GPIO_HI_OE  ======================================================= */
#define SIO_GPIO_HI_OE_GPIO_HI_OE_Pos     (0UL)                     /*!< GPIO_HI_OE (Bit 0)                                    */
#define SIO_GPIO_HI_OE_GPIO_HI_OE_Msk     (0x3fUL)                  /*!< GPIO_HI_OE (Bitfield-Mask: 0x3f)                      */
/* ====================================================  GPIO_HI_OE_SET  ===================================================== */
#define SIO_GPIO_HI_OE_SET_GPIO_HI_OE_SET_Pos (0UL)                 /*!< GPIO_HI_OE_SET (Bit 0)                                */
#define SIO_GPIO_HI_OE_SET_GPIO_HI_OE_SET_Msk (0x3fUL)              /*!< GPIO_HI_OE_SET (Bitfield-Mask: 0x3f)                  */
/* ====================================================  GPIO_HI_OE_CLR  ===================================================== */
#define SIO_GPIO_HI_OE_CLR_GPIO_HI_OE_CLR_Pos (0UL)                 /*!< GPIO_HI_OE_CLR (Bit 0)                                */
#define SIO_GPIO_HI_OE_CLR_GPIO_HI_OE_CLR_Msk (0x3fUL)              /*!< GPIO_HI_OE_CLR (Bitfield-Mask: 0x3f)                  */
/* ====================================================  GPIO_HI_OE_XOR  ===================================================== */
#define SIO_GPIO_HI_OE_XOR_GPIO_HI_OE_XOR_Pos (0UL)                 /*!< GPIO_HI_OE_XOR (Bit 0)                                */
#define SIO_GPIO_HI_OE_XOR_GPIO_HI_OE_XOR_Msk (0x3fUL)              /*!< GPIO_HI_OE_XOR (Bitfield-Mask: 0x3f)                  */
/* ========================================================  FIFO_ST  ======================================================== */
#define SIO_FIFO_ST_ROE_Pos               (3UL)                     /*!< ROE (Bit 3)                                           */
#define SIO_FIFO_ST_ROE_Msk               (0x8UL)                   /*!< ROE (Bitfield-Mask: 0x01)                             */
#define SIO_FIFO_ST_WOF_Pos               (2UL)                     /*!< WOF (Bit 2)                                           */
#define SIO_FIFO_ST_WOF_Msk               (0x4UL)                   /*!< WOF (Bitfield-Mask: 0x01)                             */
#define SIO_FIFO_ST_RDY_Pos               (1UL)                     /*!< RDY (Bit 1)                                           */
#define SIO_FIFO_ST_RDY_Msk               (0x2UL)                   /*!< RDY (Bitfield-Mask: 0x01)                             */
#define SIO_FIFO_ST_VLD_Pos               (0UL)                     /*!< VLD (Bit 0)                                           */
#define SIO_FIFO_ST_VLD_Msk               (0x1UL)                   /*!< VLD (Bitfield-Mask: 0x01)                             */
/* ========================================================  FIFO_WR  ======================================================== */
/* ========================================================  FIFO_RD  ======================================================== */
/* ======================================================  SPINLOCK_ST  ====================================================== */
/* =====================================================  DIV_UDIVIDEND  ===================================================== */
/* =====================================================  DIV_UDIVISOR  ====================================================== */
/* =====================================================  DIV_SDIVIDEND  ===================================================== */
/* =====================================================  DIV_SDIVISOR  ====================================================== */
/* =====================================================  DIV_QUOTIENT  ====================================================== */
/* =====================================================  DIV_REMAINDER  ===================================================== */
/* ========================================================  DIV_CSR  ======================================================== */
#define SIO_DIV_CSR_DIRTY_Pos             (1UL)                     /*!< DIRTY (Bit 1)                                         */
#define SIO_DIV_CSR_DIRTY_Msk             (0x2UL)                   /*!< DIRTY (Bitfield-Mask: 0x01)                           */
#define SIO_DIV_CSR_READY_Pos             (0UL)                     /*!< READY (Bit 0)                                         */
#define SIO_DIV_CSR_READY_Msk             (0x1UL)                   /*!< READY (Bitfield-Mask: 0x01)                           */
/* ====================================================  INTERP0_ACCUM0  ===================================================== */
/* ====================================================  INTERP0_ACCUM1  ===================================================== */
/* =====================================================  INTERP0_BASE0  ===================================================== */
/* =====================================================  INTERP0_BASE1  ===================================================== */
/* =====================================================  INTERP0_BASE2  ===================================================== */
/* ===================================================  INTERP0_POP_LANE0  =================================================== */
/* ===================================================  INTERP0_POP_LANE1  =================================================== */
/* ===================================================  INTERP0_POP_FULL  ==================================================== */
/* ==================================================  INTERP0_PEEK_LANE0  =================================================== */
/* ==================================================  INTERP0_PEEK_LANE1  =================================================== */
/* ===================================================  INTERP0_PEEK_FULL  =================================================== */
/* ==================================================  INTERP0_CTRL_LANE0  =================================================== */
#define SIO_INTERP0_CTRL_LANE0_OVERF_Pos  (25UL)                    /*!< OVERF (Bit 25)                                        */
#define SIO_INTERP0_CTRL_LANE0_OVERF_Msk  (0x2000000UL)             /*!< OVERF (Bitfield-Mask: 0x01)                           */
#define SIO_INTERP0_CTRL_LANE0_OVERF1_Pos (24UL)                    /*!< OVERF1 (Bit 24)                                       */
#define SIO_INTERP0_CTRL_LANE0_OVERF1_Msk (0x1000000UL)             /*!< OVERF1 (Bitfield-Mask: 0x01)                          */
#define SIO_INTERP0_CTRL_LANE0_OVERF0_Pos (23UL)                    /*!< OVERF0 (Bit 23)                                       */
#define SIO_INTERP0_CTRL_LANE0_OVERF0_Msk (0x800000UL)              /*!< OVERF0 (Bitfield-Mask: 0x01)                          */
#define SIO_INTERP0_CTRL_LANE0_BLEND_Pos  (21UL)                    /*!< BLEND (Bit 21)                                        */
#define SIO_INTERP0_CTRL_LANE0_BLEND_Msk  (0x200000UL)              /*!< BLEND (Bitfield-Mask: 0x01)                           */
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_Pos (19UL)                 /*!< FORCE_MSB (Bit 19)                                    */
#define SIO_INTERP0_CTRL_LANE0_FORCE_MSB_Msk (0x180000UL)           /*!< FORCE_MSB (Bitfield-Mask: 0x03)                       */
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_Pos (18UL)                   /*!< ADD_RAW (Bit 18)                                      */
#define SIO_INTERP0_CTRL_LANE0_ADD_RAW_Msk (0x40000UL)              /*!< ADD_RAW (Bitfield-Mask: 0x01)                         */
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_Pos (17UL)              /*!< CROSS_RESULT (Bit 17)                                 */
#define SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_Msk (0x20000UL)         /*!< CROSS_RESULT (Bitfield-Mask: 0x01)                    */
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_Pos (16UL)               /*!< CROSS_INPUT (Bit 16)                                  */
#define SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_Msk (0x10000UL)          /*!< CROSS_INPUT (Bitfield-Mask: 0x01)                     */
#define SIO_INTERP0_CTRL_LANE0_SIGNED_Pos (15UL)                    /*!< SIGNED (Bit 15)                                       */
#define SIO_INTERP0_CTRL_LANE0_SIGNED_Msk (0x8000UL)                /*!< SIGNED (Bitfield-Mask: 0x01)                          */
#define SIO_INTERP0_CTRL_LANE0_MASK_MSB_Pos (10UL)                  /*!< MASK_MSB (Bit 10)                                     */
#define SIO_INTERP0_CTRL_LANE0_MASK_MSB_Msk (0x7c00UL)              /*!< MASK_MSB (Bitfield-Mask: 0x1f)                        */
#define SIO_INTERP0_CTRL_LANE0_MASK_LSB_Pos (5UL)                   /*!< MASK_LSB (Bit 5)                                      */
#define SIO_INTERP0_CTRL_LANE0_MASK_LSB_Msk (0x3e0UL)               /*!< MASK_LSB (Bitfield-Mask: 0x1f)                        */
#define SIO_INTERP0_CTRL_LANE0_SHIFT_Pos  (0UL)                     /*!< SHIFT (Bit 0)                                         */
#define SIO_INTERP0_CTRL_LANE0_SHIFT_Msk  (0x1fUL)                  /*!< SHIFT (Bitfield-Mask: 0x1f)                           */
/* ==================================================  INTERP0_CTRL_LANE1  =================================================== */
#define SIO_INTERP0_CTRL_LANE1_FORCE_MSB_Pos (19UL)                 /*!< FORCE_MSB (Bit 19)                                    */
#define SIO_INTERP0_CTRL_LANE1_FORCE_MSB_Msk (0x180000UL)           /*!< FORCE_MSB (Bitfield-Mask: 0x03)                       */
#define SIO_INTERP0_CTRL_LANE1_ADD_RAW_Pos (18UL)                   /*!< ADD_RAW (Bit 18)                                      */
#define SIO_INTERP0_CTRL_LANE1_ADD_RAW_Msk (0x40000UL)              /*!< ADD_RAW (Bitfield-Mask: 0x01)                         */
#define SIO_INTERP0_CTRL_LANE1_CROSS_RESULT_Pos (17UL)              /*!< CROSS_RESULT (Bit 17)                                 */
#define SIO_INTERP0_CTRL_LANE1_CROSS_RESULT_Msk (0x20000UL)         /*!< CROSS_RESULT (Bitfield-Mask: 0x01)                    */
#define SIO_INTERP0_CTRL_LANE1_CROSS_INPUT_Pos (16UL)               /*!< CROSS_INPUT (Bit 16)                                  */
#define SIO_INTERP0_CTRL_LANE1_CROSS_INPUT_Msk (0x10000UL)          /*!< CROSS_INPUT (Bitfield-Mask: 0x01)                     */
#define SIO_INTERP0_CTRL_LANE1_SIGNED_Pos (15UL)                    /*!< SIGNED (Bit 15)                                       */
#define SIO_INTERP0_CTRL_LANE1_SIGNED_Msk (0x8000UL)                /*!< SIGNED (Bitfield-Mask: 0x01)                          */
#define SIO_INTERP0_CTRL_LANE1_MASK_MSB_Pos (10UL)                  /*!< MASK_MSB (Bit 10)                                     */
#define SIO_INTERP0_CTRL_LANE1_MASK_MSB_Msk (0x7c00UL)              /*!< MASK_MSB (Bitfield-Mask: 0x1f)                        */
#define SIO_INTERP0_CTRL_LANE1_MASK_LSB_Pos (5UL)                   /*!< MASK_LSB (Bit 5)                                      */
#define SIO_INTERP0_CTRL_LANE1_MASK_LSB_Msk (0x3e0UL)               /*!< MASK_LSB (Bitfield-Mask: 0x1f)                        */
#define SIO_INTERP0_CTRL_LANE1_SHIFT_Pos  (0UL)                     /*!< SHIFT (Bit 0)                                         */
#define SIO_INTERP0_CTRL_LANE1_SHIFT_Msk  (0x1fUL)                  /*!< SHIFT (Bitfield-Mask: 0x1f)                           */
/* ==================================================  INTERP0_ACCUM0_ADD  =================================================== */
#define SIO_INTERP0_ACCUM0_ADD_INTERP0_ACCUM0_ADD_Pos (0UL)         /*!< INTERP0_ACCUM0_ADD (Bit 0)                            */
#define SIO_INTERP0_ACCUM0_ADD_INTERP0_ACCUM0_ADD_Msk (0xffffffUL)  /*!< INTERP0_ACCUM0_ADD (Bitfield-Mask: 0xffffff)          */
/* ==================================================  INTERP0_ACCUM1_ADD  =================================================== */
#define SIO_INTERP0_ACCUM1_ADD_INTERP0_ACCUM1_ADD_Pos (0UL)         /*!< INTERP0_ACCUM1_ADD (Bit 0)                            */
#define SIO_INTERP0_ACCUM1_ADD_INTERP0_ACCUM1_ADD_Msk (0xffffffUL)  /*!< INTERP0_ACCUM1_ADD (Bitfield-Mask: 0xffffff)          */
/* ==================================================  INTERP0_BASE_1AND0  =================================================== */
/* ====================================================  INTERP1_ACCUM0  ===================================================== */
/* ====================================================  INTERP1_ACCUM1  ===================================================== */
/* =====================================================  INTERP1_BASE0  ===================================================== */
/* =====================================================  INTERP1_BASE1  ===================================================== */
/* =====================================================  INTERP1_BASE2  ===================================================== */
/* ===================================================  INTERP1_POP_LANE0  =================================================== */
/* ===================================================  INTERP1_POP_LANE1  =================================================== */
/* ===================================================  INTERP1_POP_FULL  ==================================================== */
/* ==================================================  INTERP1_PEEK_LANE0  =================================================== */
/* ==================================================  INTERP1_PEEK_LANE1  =================================================== */
/* ===================================================  INTERP1_PEEK_FULL  =================================================== */
/* ==================================================  INTERP1_CTRL_LANE0  =================================================== */
#define SIO_INTERP1_CTRL_LANE0_OVERF_Pos  (25UL)                    /*!< OVERF (Bit 25)                                        */
#define SIO_INTERP1_CTRL_LANE0_OVERF_Msk  (0x2000000UL)             /*!< OVERF (Bitfield-Mask: 0x01)                           */
#define SIO_INTERP1_CTRL_LANE0_OVERF1_Pos (24UL)                    /*!< OVERF1 (Bit 24)                                       */
#define SIO_INTERP1_CTRL_LANE0_OVERF1_Msk (0x1000000UL)             /*!< OVERF1 (Bitfield-Mask: 0x01)                          */
#define SIO_INTERP1_CTRL_LANE0_OVERF0_Pos (23UL)                    /*!< OVERF0 (Bit 23)                                       */
#define SIO_INTERP1_CTRL_LANE0_OVERF0_Msk (0x800000UL)              /*!< OVERF0 (Bitfield-Mask: 0x01)                          */
#define SIO_INTERP1_CTRL_LANE0_CLAMP_Pos  (22UL)                    /*!< CLAMP (Bit 22)                                        */
#define SIO_INTERP1_CTRL_LANE0_CLAMP_Msk  (0x400000UL)              /*!< CLAMP (Bitfield-Mask: 0x01)                           */
#define SIO_INTERP1_CTRL_LANE0_FORCE_MSB_Pos (19UL)                 /*!< FORCE_MSB (Bit 19)                                    */
#define SIO_INTERP1_CTRL_LANE0_FORCE_MSB_Msk (0x180000UL)           /*!< FORCE_MSB (Bitfield-Mask: 0x03)                       */
#define SIO_INTERP1_CTRL_LANE0_ADD_RAW_Pos (18UL)                   /*!< ADD_RAW (Bit 18)                                      */
#define SIO_INTERP1_CTRL_LANE0_ADD_RAW_Msk (0x40000UL)              /*!< ADD_RAW (Bitfield-Mask: 0x01)                         */
#define SIO_INTERP1_CTRL_LANE0_CROSS_RESULT_Pos (17UL)              /*!< CROSS_RESULT (Bit 17)                                 */
#define SIO_INTERP1_CTRL_LANE0_CROSS_RESULT_Msk (0x20000UL)         /*!< CROSS_RESULT (Bitfield-Mask: 0x01)                    */
#define SIO_INTERP1_CTRL_LANE0_CROSS_INPUT_Pos (16UL)               /*!< CROSS_INPUT (Bit 16)                                  */
#define SIO_INTERP1_CTRL_LANE0_CROSS_INPUT_Msk (0x10000UL)          /*!< CROSS_INPUT (Bitfield-Mask: 0x01)                     */
#define SIO_INTERP1_CTRL_LANE0_SIGNED_Pos (15UL)                    /*!< SIGNED (Bit 15)                                       */
#define SIO_INTERP1_CTRL_LANE0_SIGNED_Msk (0x8000UL)                /*!< SIGNED (Bitfield-Mask: 0x01)                          */
#define SIO_INTERP1_CTRL_LANE0_MASK_MSB_Pos (10UL)                  /*!< MASK_MSB (Bit 10)                                     */
#define SIO_INTERP1_CTRL_LANE0_MASK_MSB_Msk (0x7c00UL)              /*!< MASK_MSB (Bitfield-Mask: 0x1f)                        */
#define SIO_INTERP1_CTRL_LANE0_MASK_LSB_Pos (5UL)                   /*!< MASK_LSB (Bit 5)                                      */
#define SIO_INTERP1_CTRL_LANE0_MASK_LSB_Msk (0x3e0UL)               /*!< MASK_LSB (Bitfield-Mask: 0x1f)                        */
#define SIO_INTERP1_CTRL_LANE0_SHIFT_Pos  (0UL)                     /*!< SHIFT (Bit 0)                                         */
#define SIO_INTERP1_CTRL_LANE0_SHIFT_Msk  (0x1fUL)                  /*!< SHIFT (Bitfield-Mask: 0x1f)                           */
/* ==================================================  INTERP1_CTRL_LANE1  =================================================== */
#define SIO_INTERP1_CTRL_LANE1_FORCE_MSB_Pos (19UL)                 /*!< FORCE_MSB (Bit 19)                                    */
#define SIO_INTERP1_CTRL_LANE1_FORCE_MSB_Msk (0x180000UL)           /*!< FORCE_MSB (Bitfield-Mask: 0x03)                       */
#define SIO_INTERP1_CTRL_LANE1_ADD_RAW_Pos (18UL)                   /*!< ADD_RAW (Bit 18)                                      */
#define SIO_INTERP1_CTRL_LANE1_ADD_RAW_Msk (0x40000UL)              /*!< ADD_RAW (Bitfield-Mask: 0x01)                         */
#define SIO_INTERP1_CTRL_LANE1_CROSS_RESULT_Pos (17UL)              /*!< CROSS_RESULT (Bit 17)                                 */
#define SIO_INTERP1_CTRL_LANE1_CROSS_RESULT_Msk (0x20000UL)         /*!< CROSS_RESULT (Bitfield-Mask: 0x01)                    */
#define SIO_INTERP1_CTRL_LANE1_CROSS_INPUT_Pos (16UL)               /*!< CROSS_INPUT (Bit 16)                                  */
#define SIO_INTERP1_CTRL_LANE1_CROSS_INPUT_Msk (0x10000UL)          /*!< CROSS_INPUT (Bitfield-Mask: 0x01)                     */
#define SIO_INTERP1_CTRL_LANE1_SIGNED_Pos (15UL)                    /*!< SIGNED (Bit 15)                                       */
