mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define SIO_INTERP1_CTRL_LANE1_SIGNED_Msk (0x8000UL)                /*!< SIGNED (Bitfield-Mask: 0x01)                          */
#define SIO_INTERP1_CTRL_LANE1_MASK_MSB_Pos (10UL)                  /*!< MASK_MSB (Bit 10)                                     */
#define SIO_INTERP1_CTRL_LANE1_MASK_MSB_Msk (0x7c00UL)              /*!< MASK_MSB (Bitfield-Mask: 0x1f)                        */
#define SIO_INTERP1_CTRL_LANE1_MASK_LSB_Pos (5UL)                   /*!< MASK_LSB (Bit 5)                                      */
#define SIO_INTERP1_CTRL_LANE1_MASK_LSB_Msk (0x3e0UL)               /*!< MASK_LSB (Bitfield-Mask: 0x1f)                        */
#define SIO_INTERP1_CTRL_LANE1_SHIFT_Pos  (0UL)                     /*!< SHIFT (Bit 0)                                         */
#define SIO_INTERP1_CTRL_LANE1_SHIFT_Msk  (0x1fUL)                  /*!< SHIFT (Bitfield-Mask: 0x1f)                           */
/* ==================================================  INTERP1_ACCUM0_ADD  =================================================== */
#define SIO_INTERP1_ACCUM0_ADD_INTERP1_ACCUM0_ADD_Pos (0UL)         /*!< INTERP1_ACCUM0_ADD (Bit 0)                            */
#define SIO_INTERP1_ACCUM0_ADD_INTERP1_ACCUM0_ADD_Msk (0xffffffUL)  /*!< INTERP1_ACCUM0_ADD (Bitfield-Mask: 0xffffff)          */
/* ==================================================  INTERP1_ACCUM1_ADD  =================================================== */
#define SIO_INTERP1_ACCUM1_ADD_INTERP1_ACCUM1_ADD_Pos (0UL)         /*!< INTERP1_ACCUM1_ADD (Bit 0)                            */
#define SIO_INTERP1_ACCUM1_ADD_INTERP1_ACCUM1_ADD_Msk (0xffffffUL)  /*!< INTERP1_ACCUM1_ADD (Bitfield-Mask: 0xffffff)          */
/* ==================================================  INTERP1_BASE_1AND0  =================================================== */
/* =======================================================  SPINLOCK0  ======================================================= */
/* =======================================================  SPINLOCK1  ======================================================= */
/* =======================================================  SPINLOCK2  ======================================================= */
/* =======================================================  SPINLOCK3  ======================================================= */
/* =======================================================  SPINLOCK4  ======================================================= */
/* =======================================================  SPINLOCK5  ======================================================= */
/* =======================================================  SPINLOCK6  ======================================================= */
/* =======================================================  SPINLOCK7  ======================================================= */
/* =======================================================  SPINLOCK8  ======================================================= */
/* =======================================================  SPINLOCK9  ======================================================= */
/* ======================================================  SPINLOCK10  ======================================================= */
/* ======================================================  SPINLOCK11  ======================================================= */
/* ======================================================  SPINLOCK12  ======================================================= */
/* ======================================================  SPINLOCK13  ======================================================= */
/* ======================================================  SPINLOCK14  ======================================================= */
/* ======================================================  SPINLOCK15  ======================================================= */
/* ======================================================  SPINLOCK16  ======================================================= */
/* ======================================================  SPINLOCK17  ======================================================= */
/* ======================================================  SPINLOCK18  ======================================================= */
/* ======================================================  SPINLOCK19  ======================================================= */
/* ======================================================  SPINLOCK20  ======================================================= */
/* ======================================================  SPINLOCK21  ======================================================= */
/* ======================================================  SPINLOCK22  ======================================================= */
/* ======================================================  SPINLOCK23  ======================================================= */
/* ======================================================  SPINLOCK24  ======================================================= */
/* ======================================================  SPINLOCK25  ======================================================= */
/* ======================================================  SPINLOCK26  ======================================================= */
/* ======================================================  SPINLOCK27  ======================================================= */
/* ======================================================  SPINLOCK28  ======================================================= */
/* ======================================================  SPINLOCK29  ======================================================= */
/* ======================================================  SPINLOCK30  ======================================================= */
/* ======================================================  SPINLOCK31  ======================================================= */


/* =========================================================================================================================== */
/* ================                                            PPB                                            ================ */
/* =========================================================================================================================== */

