mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =======================================================  SYST_CSR  ======================================================== */
#define PPB_SYST_CSR_COUNTFLAG_Pos        (16UL)                    /*!< COUNTFLAG (Bit 16)                                    */
#define PPB_SYST_CSR_COUNTFLAG_Msk        (0x10000UL)               /*!< COUNTFLAG (Bitfield-Mask: 0x01)                       */
#define PPB_SYST_CSR_CLKSOURCE_Pos        (2UL)                     /*!< CLKSOURCE (Bit 2)                                     */
#define PPB_SYST_CSR_CLKSOURCE_Msk        (0x4UL)                   /*!< CLKSOURCE (Bitfield-Mask: 0x01)                       */
#define PPB_SYST_CSR_TICKINT_Pos          (1UL)                     /*!< TICKINT (Bit 1)                                       */
#define PPB_SYST_CSR_TICKINT_Msk          (0x2UL)                   /*!< TICKINT (Bitfield-Mask: 0x01)                         */
#define PPB_SYST_CSR_ENABLE_Pos           (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define PPB_SYST_CSR_ENABLE_Msk           (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* =======================================================  SYST_RVR  ======================================================== */
#define PPB_SYST_RVR_RELOAD_Pos           (0UL)                     /*!< RELOAD (Bit 0)                                        */
#define PPB_SYST_RVR_RELOAD_Msk           (0xffffffUL)              /*!< RELOAD (Bitfield-Mask: 0xffffff)                      */
/* =======================================================  SYST_CVR  ======================================================== */
#define PPB_SYST_CVR_CURRENT_Pos          (0UL)                     /*!< CURRENT (Bit 0)                                       */
#define PPB_SYST_CVR_CURRENT_Msk          (0xffffffUL)              /*!< CURRENT (Bitfield-Mask: 0xffffff)                     */
/* ======================================================  SYST_CALIB  ======================================================= */
#define PPB_SYST_CALIB_NOREF_Pos          (31UL)                    /*!< NOREF (Bit 31)                                        */
#define PPB_SYST_CALIB_NOREF_Msk          (0x80000000UL)            /*!< NOREF (Bitfield-Mask: 0x01)                           */
#define PPB_SYST_CALIB_SKEW_Pos           (30UL)                    /*!< SKEW (Bit 30)                                         */
#define PPB_SYST_CALIB_SKEW_Msk           (0x40000000UL)            /*!< SKEW (Bitfield-Mask: 0x01)                            */
#define PPB_SYST_CALIB_TENMS_Pos          (0UL)                     /*!< TENMS (Bit 0)                                         */
#define PPB_SYST_CALIB_TENMS_Msk          (0xffffffUL)              /*!< TENMS (Bitfield-Mask: 0xffffff)                       */
/* =======================================================  NVIC_ISER  ======================================================= */
#define PPB_NVIC_ISER_SETENA_Pos          (0UL)                     /*!< SETENA (Bit 0)                                        */
#define PPB_NVIC_ISER_SETENA_Msk          (0xffffffffUL)            /*!< SETENA (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  NVIC_ICER  ======================================================= */
#define PPB_NVIC_ICER_CLRENA_Pos          (0UL)                     /*!< CLRENA (Bit 0)                                        */
#define PPB_NVIC_ICER_CLRENA_Msk          (0xffffffffUL)            /*!< CLRENA (Bitfield-Mask: 0xffffffff)                    */
/* =======================================================  NVIC_ISPR  ======================================================= */
#define PPB_NVIC_ISPR_SETPEND_Pos         (0UL)                     /*!< SETPEND (Bit 0)                                       */
#define PPB_NVIC_ISPR_SETPEND_Msk         (0xffffffffUL)            /*!< SETPEND (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  NVIC_ICPR  ======================================================= */
#define PPB_NVIC_ICPR_CLRPEND_Pos         (0UL)                     /*!< CLRPEND (Bit 0)                                       */
#define PPB_NVIC_ICPR_CLRPEND_Msk         (0xffffffffUL)            /*!< CLRPEND (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  NVIC_IPR0  ======================================================= */
#define PPB_NVIC_IPR0_IP_3_Pos            (30UL)                    /*!< IP_3 (Bit 30)                                         */
#define PPB_NVIC_IPR0_IP_3_Msk            (0xc0000000UL)            /*!< IP_3 (Bitfield-Mask: 0x03)                            */
#define PPB_NVIC_IPR0_IP_2_Pos            (22UL)                    /*!< IP_2 (Bit 22)                                         */
#define PPB_NVIC_IPR0_IP_2_Msk            (0xc00000UL)              /*!< IP_2 (Bitfield-Mask: 0x03)                            */
#define PPB_NVIC_IPR0_IP_1_Pos            (14UL)                    /*!< IP_1 (Bit 14)                                         */
#define PPB_NVIC_IPR0_IP_1_Msk            (0xc000UL)                /*!< IP_1 (Bitfield-Mask: 0x03)                            */
#define PPB_NVIC_IPR0_IP_0_Pos            (6UL)                     /*!< IP_0 (Bit 6)                                          */
#define PPB_NVIC_IPR0_IP_0_Msk            (0xc0UL)                  /*!< IP_0 (Bitfield-Mask: 0x03)                            */
/* =======================================================  NVIC_IPR1  ======================================================= */
#define PPB_NVIC_IPR1_IP_7_Pos            (30UL)                    /*!< IP_7 (Bit 30)                                         */
#define PPB_NVIC_IPR1_IP_7_Msk            (0xc0000000UL)            /*!< IP_7 (Bitfield-Mask: 0x03)                            */
#define PPB_NVIC_IPR1_IP_6_Pos            (22UL)                    /*!< IP_6 (Bit 22)                                         */
#define PPB_NVIC_IPR1_IP_6_Msk            (0xc00000UL)              /*!< IP_6 (Bitfield-Mask: 0x03)                            */
#define PPB_NVIC_IPR1_IP_5_Pos            (14UL)                    /*!< IP_5 (Bit 14)                                         */
#define PPB_NVIC_IPR1_IP_5_Msk            (0xc000UL)                /*!< IP_5 (Bitfield-Mask: 0x03)                            */
#define PPB_NVIC_IPR1_IP_4_Pos            (6UL)                     /*!< IP_4 (Bit 6)                                          */
#define PPB_NVIC_IPR1_IP_4_Msk            (0xc0UL)                  /*!< IP_4 (Bitfield-Mask: 0x03)                            */
/* =======================================================  NVIC_IPR2  ======================================================= */
#define PPB_NVIC_IPR2_IP_11_Pos           (30UL)                    /*!< IP_11 (Bit 30)                                        */
#define PPB_NVIC_IPR2_IP_11_Msk           (0xc0000000UL)            /*!< IP_11 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR2_IP_10_Pos           (22UL)                    /*!< IP_10 (Bit 22)                                        */
#define PPB_NVIC_IPR2_IP_10_Msk           (0xc00000UL)              /*!< IP_10 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR2_IP_9_Pos            (14UL)                    /*!< IP_9 (Bit 14)                                         */
#define PPB_NVIC_IPR2_IP_9_Msk            (0xc000UL)                /*!< IP_9 (Bitfield-Mask: 0x03)                            */
#define PPB_NVIC_IPR2_IP_8_Pos            (6UL)                     /*!< IP_8 (Bit 6)                                          */
#define PPB_NVIC_IPR2_IP_8_Msk            (0xc0UL)                  /*!< IP_8 (Bitfield-Mask: 0x03)                            */
/* =======================================================  NVIC_IPR3  ======================================================= */
#define PPB_NVIC_IPR3_IP_15_Pos           (30UL)                    /*!< IP_15 (Bit 30)                                        */
#define PPB_NVIC_IPR3_IP_15_Msk           (0xc0000000UL)            /*!< IP_15 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR3_IP_14_Pos           (22UL)                    /*!< IP_14 (Bit 22)                                        */
#define PPB_NVIC_IPR3_IP_14_Msk           (0xc00000UL)              /*!< IP_14 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR3_IP_13_Pos           (14UL)                    /*!< IP_13 (Bit 14)                                        */
#define PPB_NVIC_IPR3_IP_13_Msk           (0xc000UL)                /*!< IP_13 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR3_IP_12_Pos           (6UL)                     /*!< IP_12 (Bit 6)                                         */
#define PPB_NVIC_IPR3_IP_12_Msk           (0xc0UL)                  /*!< IP_12 (Bitfield-Mask: 0x03)                           */
/* =======================================================  NVIC_IPR4  ======================================================= */
#define PPB_NVIC_IPR4_IP_19_Pos           (30UL)                    /*!< IP_19 (Bit 30)                                        */
#define PPB_NVIC_IPR4_IP_19_Msk           (0xc0000000UL)            /*!< IP_19 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR4_IP_18_Pos           (22UL)                    /*!< IP_18 (Bit 22)                                        */
#define PPB_NVIC_IPR4_IP_18_Msk           (0xc00000UL)              /*!< IP_18 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR4_IP_17_Pos           (14UL)                    /*!< IP_17 (Bit 14)                                        */
#define PPB_NVIC_IPR4_IP_17_Msk           (0xc000UL)                /*!< IP_17 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR4_IP_16_Pos           (6UL)                     /*!< IP_16 (Bit 6)                                         */
#define PPB_NVIC_IPR4_IP_16_Msk           (0xc0UL)                  /*!< IP_16 (Bitfield-Mask: 0x03)                           */
/* =======================================================  NVIC_IPR5  ======================================================= */
#define PPB_NVIC_IPR5_IP_23_Pos           (30UL)                    /*!< IP_23 (Bit 30)                                        */
#define PPB_NVIC_IPR5_IP_23_Msk           (0xc0000000UL)            /*!< IP_23 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR5_IP_22_Pos           (22UL)                    /*!< IP_22 (Bit 22)                                        */
#define PPB_NVIC_IPR5_IP_22_Msk           (0xc00000UL)              /*!< IP_22 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR5_IP_21_Pos           (14UL)                    /*!< IP_21 (Bit 14)                                        */
#define PPB_NVIC_IPR5_IP_21_Msk           (0xc000UL)                /*!< IP_21 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR5_IP_20_Pos           (6UL)                     /*!< IP_20 (Bit 6)                                         */
#define PPB_NVIC_IPR5_IP_20_Msk           (0xc0UL)                  /*!< IP_20 (Bitfield-Mask: 0x03)                           */
/* =======================================================  NVIC_IPR6  ======================================================= */
#define PPB_NVIC_IPR6_IP_27_Pos           (30UL)                    /*!< IP_27 (Bit 30)                                        */
#define PPB_NVIC_IPR6_IP_27_Msk           (0xc0000000UL)            /*!< IP_27 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR6_IP_26_Pos           (22UL)                    /*!< IP_26 (Bit 22)                                        */
#define PPB_NVIC_IPR6_IP_26_Msk           (0xc00000UL)              /*!< IP_26 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR6_IP_25_Pos           (14UL)                    /*!< IP_25 (Bit 14)                                        */
#define PPB_NVIC_IPR6_IP_25_Msk           (0xc000UL)                /*!< IP_25 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR6_IP_24_Pos           (6UL)                     /*!< IP_24 (Bit 6)                                         */
#define PPB_NVIC_IPR6_IP_24_Msk           (0xc0UL)                  /*!< IP_24 (Bitfield-Mask: 0x03)                           */
/* =======================================================  NVIC_IPR7  ======================================================= */
#define PPB_NVIC_IPR7_IP_31_Pos           (30UL)                    /*!< IP_31 (Bit 30)                                        */
#define PPB_NVIC_IPR7_IP_31_Msk           (0xc0000000UL)            /*!< IP_31 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR7_IP_30_Pos           (22UL)                    /*!< IP_30 (Bit 22)                                        */
#define PPB_NVIC_IPR7_IP_30_Msk           (0xc00000UL)              /*!< IP_30 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR7_IP_29_Pos           (14UL)                    /*!< IP_29 (Bit 14)                                        */
#define PPB_NVIC_IPR7_IP_29_Msk           (0xc000UL)                /*!< IP_29 (Bitfield-Mask: 0x03)                           */
#define PPB_NVIC_IPR7_IP_28_Pos           (6UL)                     /*!< IP_28 (Bit 6)                                         */
#define PPB_NVIC_IPR7_IP_28_Msk           (0xc0UL)                  /*!< IP_28 (Bitfield-Mask: 0x03)                           */
/* =========================================================  CPUID  ========================================================= */
#define PPB_CPUID_IMPLEMENTER_Pos         (24UL)                    /*!< IMPLEMENTER (Bit 24)                                  */
#define PPB_CPUID_IMPLEMENTER_Msk         (0xff000000UL)            /*!< IMPLEMENTER (Bitfield-Mask: 0xff)                     */
#define PPB_CPUID_VARIANT_Pos             (20UL)                    /*!< VARIANT (Bit 20)                                      */
#define PPB_CPUID_VARIANT_Msk             (0xf00000UL)              /*!< VARIANT (Bitfield-Mask: 0x0f)                         */
#define PPB_CPUID_ARCHITECTURE_Pos        (16UL)                    /*!< ARCHITECTURE (Bit 16)                                 */
#define PPB_CPUID_ARCHITECTURE_Msk        (0xf0000UL)               /*!< ARCHITECTURE (Bitfield-Mask: 0x0f)                    */
#define PPB_CPUID_PARTNO_Pos              (4UL)                     /*!< PARTNO (Bit 4)                                        */
#define PPB_CPUID_PARTNO_Msk              (0xfff0UL)                /*!< PARTNO (Bitfield-Mask: 0xfff)                         */
#define PPB_CPUID_REVISION_Pos            (0UL)                     /*!< REVISION (Bit 0)                                      */
#define PPB_CPUID_REVISION_Msk            (0xfUL)                   /*!< REVISION (Bitfield-Mask: 0x0f)                        */
/* =========================================================  ICSR  ========================================================== */
#define PPB_ICSR_NMIPENDSET_Pos           (31UL)                    /*!< NMIPENDSET (Bit 31)                                   */
#define PPB_ICSR_NMIPENDSET_Msk           (0x80000000UL)            /*!< NMIPENDSET (Bitfield-Mask: 0x01)                      */
#define PPB_ICSR_PENDSVSET_Pos            (28UL)                    /*!< PENDSVSET (Bit 28)                                    */
#define PPB_ICSR_PENDSVSET_Msk            (0x10000000UL)            /*!< PENDSVSET (Bitfield-Mask: 0x01)                       */
#define PPB_ICSR_PENDSVCLR_Pos            (27UL)                    /*!< PENDSVCLR (Bit 27)                                    */
#define PPB_ICSR_PENDSVCLR_Msk            (0x8000000UL)             /*!< PENDSVCLR (Bitfield-Mask: 0x01)                       */
#define PPB_ICSR_PENDSTSET_Pos            (26UL)                    /*!< PENDSTSET (Bit 26)                                    */
#define PPB_ICSR_PENDSTSET_Msk            (0x4000000UL)             /*!< PENDSTSET (Bitfield-Mask: 0x01)                       */
#define PPB_ICSR_PENDSTCLR_Pos            (25UL)                    /*!< PENDSTCLR (Bit 25)                                    */
#define PPB_ICSR_PENDSTCLR_Msk            (0x2000000UL)             /*!< PENDSTCLR (Bitfield-Mask: 0x01)                       */
#define PPB_ICSR_ISRPREEMPT_Pos           (23UL)                    /*!< ISRPREEMPT (Bit 23)                                   */
#define PPB_ICSR_ISRPREEMPT_Msk           (0x800000UL)              /*!< ISRPREEMPT (Bitfield-Mask: 0x01)                      */
#define PPB_ICSR_ISRPENDING_Pos           (22UL)                    /*!< ISRPENDING (Bit 22)                                   */
#define PPB_ICSR_ISRPENDING_Msk           (0x400000UL)              /*!< ISRPENDING (Bitfield-Mask: 0x01)                      */
#define PPB_ICSR_VECTPENDING_Pos          (12UL)                    /*!< VECTPENDING (Bit 12)                                  */
#define PPB_ICSR_VECTPENDING_Msk          (0x1ff000UL)              /*!< VECTPENDING (Bitfield-Mask: 0x1ff)                    */
#define PPB_ICSR_VECTACTIVE_Pos           (0UL)                     /*!< VECTACTIVE (Bit 0)                                    */
#define PPB_ICSR_VECTACTIVE_Msk           (0x1ffUL)                 /*!< VECTACTIVE (Bitfield-Mask: 0x1ff)                     */
/* =========================================================  VTOR  ========================================================== */
#define PPB_VTOR_TBLOFF_Pos               (8UL)                     /*!< TBLOFF (Bit 8)                                        */
#define PPB_VTOR_TBLOFF_Msk               (0xffffff00UL)            /*!< TBLOFF (Bitfield-Mask: 0xffffff)                      */
/* =========================================================  AIRCR  ========================================================= */
#define PPB_AIRCR_VECTKEY_Pos             (16UL)                    /*!< VECTKEY (Bit 16)                                      */
#define PPB_AIRCR_VECTKEY_Msk             (0xffff0000UL)            /*!< VECTKEY (Bitfield-Mask: 0xffff)                       */
#define PPB_AIRCR_ENDIANESS_Pos           (15UL)                    /*!< ENDIANESS (Bit 15)                                    */
#define PPB_AIRCR_ENDIANESS_Msk           (0x8000UL)                /*!< ENDIANESS (Bitfield-Mask: 0x01)                       */
#define PPB_AIRCR_SYSRESETREQ_Pos         (2UL)                     /*!< SYSRESETREQ (Bit 2)                                   */
#define PPB_AIRCR_SYSRESETREQ_Msk         (0x4UL)                   /*!< SYSRESETREQ (Bitfield-Mask: 0x01)                     */
#define PPB_AIRCR_VECTCLRACTIVE_Pos       (1UL)                     /*!< VECTCLRACTIVE (Bit 1)                                 */
#define PPB_AIRCR_VECTCLRACTIVE_Msk       (0x2UL)                   /*!< VECTCLRACTIVE (Bitfield-Mask: 0x01)                   */
/* ==========================================================  SCR  ========================================================== */
#define PPB_SCR_SEVONPEND_Pos             (4UL)                     /*!< SEVONPEND (Bit 4)                                     */
#define PPB_SCR_SEVONPEND_Msk             (0x10UL)                  /*!< SEVONPEND (Bitfield-Mask: 0x01)                       */
#define PPB_SCR_SLEEPDEEP_Pos             (2UL)                     /*!< SLEEPDEEP (Bit 2)                                     */
#define PPB_SCR_SLEEPDEEP_Msk             (0x4UL)                   /*!< SLEEPDEEP (Bitfield-Mask: 0x01)                       */
#define PPB_SCR_SLEEPONEXIT_Pos           (1UL)                     /*!< SLEEPONEXIT (Bit 1)                                   */
#define PPB_SCR_SLEEPONEXIT_Msk           (0x2UL)                   /*!< SLEEPONEXIT (Bitfield-Mask: 0x01)                     */
/* ==========================================================  CCR  ========================================================== */
#define PPB_CCR_STKALIGN_Pos              (9UL)                     /*!< STKALIGN (Bit 9)                                      */
#define PPB_CCR_STKALIGN_Msk              (0x200UL)                 /*!< STKALIGN (Bitfield-Mask: 0x01)                        */
#define PPB_CCR_UNALIGN_TRP_Pos           (3UL)                     /*!< UNALIGN_TRP (Bit 3)                                   */
#define PPB_CCR_UNALIGN_TRP_Msk           (0x8UL)                   /*!< UNALIGN_TRP (Bitfield-Mask: 0x01)                     */
/* =========================================================  SHPR2  ========================================================= */
#define PPB_SHPR2_PRI_11_Pos              (30UL)                    /*!< PRI_11 (Bit 30)                                       */
#define PPB_SHPR2_PRI_11_Msk              (0xc0000000UL)            /*!< PRI_11 (Bitfield-Mask: 0x03)                          */
/* =========================================================  SHPR3  ========================================================= */
#define PPB_SHPR3_PRI_15_Pos              (30UL)                    /*!< PRI_15 (Bit 30)                                       */
#define PPB_SHPR3_PRI_15_Msk              (0xc0000000UL)            /*!< PRI_15 (Bitfield-Mask: 0x03)                          */
#define PPB_SHPR3_PRI_14_Pos              (22UL)                    /*!< PRI_14 (Bit 22)                                       */
#define PPB_SHPR3_PRI_14_Msk              (0xc00000UL)              /*!< PRI_14 (Bitfield-Mask: 0x03)                          */
/* =========================================================  SHCSR  ========================================================= */
#define PPB_SHCSR_SVCALLPENDED_Pos        (15UL)                    /*!< SVCALLPENDED (Bit 15)                                 */
#define PPB_SHCSR_SVCALLPENDED_Msk        (0x8000UL)                /*!< SVCALLPENDED (Bitfield-Mask: 0x01)                    */
/* =======================================================  MPU_TYPE  ======================================================== */
#define PPB_MPU_TYPE_IREGION_Pos          (16UL)                    /*!< IREGION (Bit 16)                                      */
#define PPB_MPU_TYPE_IREGION_Msk          (0xff0000UL)              /*!< IREGION (Bitfield-Mask: 0xff)                         */
#define PPB_MPU_TYPE_DREGION_Pos          (8UL)                     /*!< DREGION (Bit 8)                                       */
#define PPB_MPU_TYPE_DREGION_Msk          (0xff00UL)                /*!< DREGION (Bitfield-Mask: 0xff)                         */
#define PPB_MPU_TYPE_SEPARATE_Pos         (0UL)                     /*!< SEPARATE (Bit 0)                                      */
#define PPB_MPU_TYPE_SEPARATE_Msk         (0x1UL)                   /*!< SEPARATE (Bitfield-Mask: 0x01)                        */
/* =======================================================  MPU_CTRL  ======================================================== */
#define PPB_MPU_CTRL_PRIVDEFENA_Pos       (2UL)                     /*!< PRIVDEFENA (Bit 2)                                    */
#define PPB_MPU_CTRL_PRIVDEFENA_Msk       (0x4UL)                   /*!< PRIVDEFENA (Bitfield-Mask: 0x01)                      */
#define PPB_MPU_CTRL_HFNMIENA_Pos         (1UL)                     /*!< HFNMIENA (Bit 1)                                      */
#define PPB_MPU_CTRL_HFNMIENA_Msk         (0x2UL)                   /*!< HFNMIENA (Bitfield-Mask: 0x01)                        */
#define PPB_MPU_CTRL_ENABLE_Pos           (0UL)                     /*!< ENABLE (Bit 0)                                        */
