mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
#define PPB_MPU_CTRL_ENABLE_Msk           (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* ========================================================  MPU_RNR  ======================================================== */
#define PPB_MPU_RNR_REGION_Pos            (0UL)                     /*!< REGION (Bit 0)                                        */
#define PPB_MPU_RNR_REGION_Msk            (0xfUL)                   /*!< REGION (Bitfield-Mask: 0x0f)                          */
/* =======================================================  MPU_RBAR  ======================================================== */
#define PPB_MPU_RBAR_ADDR_Pos             (8UL)                     /*!< ADDR (Bit 8)                                          */
#define PPB_MPU_RBAR_ADDR_Msk             (0xffffff00UL)            /*!< ADDR (Bitfield-Mask: 0xffffff)                        */
#define PPB_MPU_RBAR_VALID_Pos            (4UL)                     /*!< VALID (Bit 4)                                         */
#define PPB_MPU_RBAR_VALID_Msk            (0x10UL)                  /*!< VALID (Bitfield-Mask: 0x01)                           */
#define PPB_MPU_RBAR_REGION_Pos           (0UL)                     /*!< REGION (Bit 0)                                        */
#define PPB_MPU_RBAR_REGION_Msk           (0xfUL)                   /*!< REGION (Bitfield-Mask: 0x0f)                          */
/* =======================================================  MPU_RASR  ======================================================== */
#define PPB_MPU_RASR_ATTRS_Pos            (16UL)                    /*!< ATTRS (Bit 16)                                        */
#define PPB_MPU_RASR_ATTRS_Msk            (0xffff0000UL)            /*!< ATTRS (Bitfield-Mask: 0xffff)                         */
#define PPB_MPU_RASR_SRD_Pos              (8UL)                     /*!< SRD (Bit 8)                                           */
#define PPB_MPU_RASR_SRD_Msk              (0xff00UL)                /*!< SRD (Bitfield-Mask: 0xff)                             */
#define PPB_MPU_RASR_SIZE_Pos             (1UL)                     /*!< SIZE (Bit 1)                                          */
#define PPB_MPU_RASR_SIZE_Msk             (0x3eUL)                  /*!< SIZE (Bitfield-Mask: 0x1f)                            */
#define PPB_MPU_RASR_ENABLE_Pos           (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define PPB_MPU_RASR_ENABLE_Msk           (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */

/** @} */ /* End of group PosMask_peripherals */


/* =========================================================================================================================== */
/* ================                           Enumerated Values Peripheral Section                            ================ */
/* =========================================================================================================================== */


/** @addtogroup EnumValue_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                         XIP_CTRL                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* =========================================================  FLUSH  ========================================================= */
/* =========================================================  STAT  ========================================================== */
/* ========================================================  CTR_HIT  ======================================================== */
/* ========================================================  CTR_ACC  ======================================================== */
/* ======================================================  STREAM_ADDR  ====================================================== */
/* ======================================================  STREAM_CTR  ======================================================= */
/* ======================================================  STREAM_FIFO  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          XIP_SSI                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CTRLR0  ========================================================= */
/* ============================================  XIP_SSI CTRLR0 SPI_FRF [21..22]  ============================================ */
typedef enum {                                  /*!< XIP_SSI_CTRLR0_SPI_FRF                                                    */
  XIP_SSI_CTRLR0_SPI_FRF_STD           = 0,     /*!< STD : Standard 1-bit SPI frame format; 1 bit per SCK, full-duplex         */
  XIP_SSI_CTRLR0_SPI_FRF_DUAL          = 1,     /*!< DUAL : Dual-SPI frame format; two bits per SCK, half-duplex               */
  XIP_SSI_CTRLR0_SPI_FRF_QUAD          = 2,     /*!< QUAD : Quad-SPI frame format; four bits per SCK, half-duplex              */
} XIP_SSI_CTRLR0_SPI_FRF_Enum;

/* ==============================================  XIP_SSI CTRLR0 TMOD [8..9]  =============================================== */
typedef enum {                                  /*!< XIP_SSI_CTRLR0_TMOD                                                       */
  XIP_SSI_CTRLR0_TMOD_TX_AND_RX        = 0,     /*!< TX_AND_RX : Both transmit and receive                                     */
  XIP_SSI_CTRLR0_TMOD_TX_ONLY          = 1,     /*!< TX_ONLY : Transmit only (not for FRF == 0, standard SPI mode)             */
  XIP_SSI_CTRLR0_TMOD_RX_ONLY          = 2,     /*!< RX_ONLY : Receive only (not for FRF == 0, standard SPI mode)              */
  XIP_SSI_CTRLR0_TMOD_EEPROM_READ      = 3,     /*!< EEPROM_READ : EEPROM read mode (TX then RX; RX starts after
                                                     control data TX'd)                                                        */
} XIP_SSI_CTRLR0_TMOD_Enum;

/* ========================================================  CTRLR1  ========================================================= */
/* ========================================================  SSIENR  ========================================================= */
/* =========================================================  MWCR  ========================================================== */
/* ==========================================================  SER  ========================================================== */
/* =========================================================  BAUDR  ========================================================= */
/* ========================================================  TXFTLR  ========================================================= */
/* ========================================================  RXFTLR  ========================================================= */
/* =========================================================  TXFLR  ========================================================= */
/* =========================================================  RXFLR  ========================================================= */
/* ==========================================================  SR  =========================================================== */
/* ==========================================================  IMR  ========================================================== */
/* ==========================================================  ISR  ========================================================== */
/* =========================================================  RISR  ========================================================== */
/* ========================================================  TXOICR  ========================================================= */
/* ========================================================  RXOICR  ========================================================= */
/* ========================================================  RXUICR  ========================================================= */
/* ========================================================  MSTICR  ========================================================= */
/* ==========================================================  ICR  ========================================================== */
/* =========================================================  DMACR  ========================================================= */
/* ========================================================  DMATDLR  ======================================================== */
/* ========================================================  DMARDLR  ======================================================== */
/* ==========================================================  IDR  ========================================================== */
/* ====================================================  SSI_VERSION_ID  ===================================================== */
/* ==========================================================  DR0  ========================================================== */
/* =====================================================  RX_SAMPLE_DLY  ===================================================== */
/* ======================================================  SPI_CTRLR0  ======================================================= */
/* ===========================================  XIP_SSI SPI_CTRLR0 INST_L [8..9]  ============================================ */
typedef enum {                                  /*!< XIP_SSI_SPI_CTRLR0_INST_L                                                 */
  XIP_SSI_SPI_CTRLR0_INST_L_NONE       = 0,     /*!< NONE : No instruction                                                     */
  XIP_SSI_SPI_CTRLR0_INST_L_4B         = 1,     /*!< 4B : 4-bit instruction                                                    */
  XIP_SSI_SPI_CTRLR0_INST_L_8B         = 2,     /*!< 8B : 8-bit instruction                                                    */
  XIP_SSI_SPI_CTRLR0_INST_L_16B        = 3,     /*!< 16B : 16-bit instruction                                                  */
} XIP_SSI_SPI_CTRLR0_INST_L_Enum;

/* =========================================  XIP_SSI SPI_CTRLR0 TRANS_TYPE [0..1]  ========================================== */
typedef enum {                                  /*!< XIP_SSI_SPI_CTRLR0_TRANS_TYPE                                             */
  XIP_SSI_SPI_CTRLR0_TRANS_TYPE_1C1A   = 0,     /*!< 1C1A : Command and address both in standard SPI frame format              */
  XIP_SSI_SPI_CTRLR0_TRANS_TYPE_1C2A   = 1,     /*!< 1C2A : Command in standard SPI format, address in format specified
                                                     by FRF                                                                    */
  XIP_SSI_SPI_CTRLR0_TRANS_TYPE_2C2A   = 2,     /*!< 2C2A : Command and address both in format specified by FRF (e.g.
                                                     Dual-SPI)                                                                 */
} XIP_SSI_SPI_CTRLR0_TRANS_TYPE_Enum;

/* ====================================================  TXD_DRIVE_EDGE  ===================================================== */


/* =========================================================================================================================== */
/* ================                                          SYSINFO                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  CHIP_ID  ======================================================== */
/* =======================================================  PLATFORM  ======================================================== */
/* =====================================================  GITREF_RP2040  ===================================================== */


/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */

/* ====================================================  PROC0_NMI_MASK  ===================================================== */
/* ====================================================  PROC1_NMI_MASK  ===================================================== */
/* ======================================================  PROC_CONFIG  ====================================================== */
/* ==================================================  PROC_IN_SYNC_BYPASS  ================================================== */
/* ================================================  PROC_IN_SYNC_BYPASS_HI  ================================================= */
/* =======================================================  DBGFORCE  ======================================================== */
/* =====================================================  MEMPOWERDOWN  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          CLOCKS                                           ================ */
/* =========================================================================================================================== */

/* ====================================================  CLK_GPOUT0_CTRL  ==================================================== */
/* =========================================  CLOCKS CLK_GPOUT0_CTRL AUXSRC [5..8]  ========================================== */
typedef enum {                                  /*!< CLOCKS_CLK_GPOUT0_CTRL_AUXSRC                                             */
  CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_clksrc_pll_sys = 0,/*!< clksrc_pll_sys : clksrc_pll_sys                                        */
  CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_clksrc_gpin0 = 1,/*!< clksrc_gpin0 : clksrc_gpin0                                              */
  CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_clksrc_gpin1 = 2,/*!< clksrc_gpin1 : clksrc_gpin1                                              */
  CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_clksrc_pll_usb = 3,/*!< clksrc_pll_usb : clksrc_pll_usb                                        */
  CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_rosc_clksrc = 4,/*!< rosc_clksrc : rosc_clksrc                                                 */
  CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_xosc_clksrc = 5,/*!< xosc_clksrc : xosc_clksrc                                                 */
  CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_clk_sys = 6,    /*!< clk_sys : clk_sys                                                         */
  CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_clk_usb = 7,    /*!< clk_usb : clk_usb                                                         */
  CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_clk_adc = 8,    /*!< clk_adc : clk_adc                                                         */
  CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_clk_rtc = 9,    /*!< clk_rtc : clk_rtc                                                         */
  CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_clk_ref = 10,   /*!< clk_ref : clk_ref                                                         */
} CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_Enum;

/* ====================================================  CLK_GPOUT0_DIV  ===================================================== */
/* ==================================================  CLK_GPOUT0_SELECTED  ================================================== */
/* ====================================================  CLK_GPOUT1_CTRL  ==================================================== */
/* =========================================  CLOCKS CLK_GPOUT1_CTRL AUXSRC [5..8]  ========================================== */
typedef enum {                                  /*!< CLOCKS_CLK_GPOUT1_CTRL_AUXSRC                                             */
  CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_clksrc_pll_sys = 0,/*!< clksrc_pll_sys : clksrc_pll_sys                                        */
  CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_clksrc_gpin0 = 1,/*!< clksrc_gpin0 : clksrc_gpin0                                              */
  CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_clksrc_gpin1 = 2,/*!< clksrc_gpin1 : clksrc_gpin1                                              */
  CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_clksrc_pll_usb = 3,/*!< clksrc_pll_usb : clksrc_pll_usb                                        */
  CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_rosc_clksrc = 4,/*!< rosc_clksrc : rosc_clksrc                                                 */
  CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_xosc_clksrc = 5,/*!< xosc_clksrc : xosc_clksrc                                                 */
  CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_clk_sys = 6,    /*!< clk_sys : clk_sys                                                         */
  CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_clk_usb = 7,    /*!< clk_usb : clk_usb                                                         */
  CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_clk_adc = 8,    /*!< clk_adc : clk_adc                                                         */
  CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_clk_rtc = 9,    /*!< clk_rtc : clk_rtc                                                         */
  CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_clk_ref = 10,   /*!< clk_ref : clk_ref                                                         */
} CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_Enum;

/* ====================================================  CLK_GPOUT1_DIV  ===================================================== */
/* ==================================================  CLK_GPOUT1_SELECTED  ================================================== */
/* ====================================================  CLK_GPOUT2_CTRL  ==================================================== */
/* =========================================  CLOCKS CLK_GPOUT2_CTRL AUXSRC [5..8]  ========================================== */
typedef enum {                                  /*!< CLOCKS_CLK_GPOUT2_CTRL_AUXSRC                                             */
  CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_clksrc_pll_sys = 0,/*!< clksrc_pll_sys : clksrc_pll_sys                                        */
  CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_clksrc_gpin0 = 1,/*!< clksrc_gpin0 : clksrc_gpin0                                              */
  CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_clksrc_gpin1 = 2,/*!< clksrc_gpin1 : clksrc_gpin1                                              */
  CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_clksrc_pll_usb = 3,/*!< clksrc_pll_usb : clksrc_pll_usb                                        */
  CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_rosc_clksrc_ph = 4,/*!< rosc_clksrc_ph : rosc_clksrc_ph                                        */
  CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_xosc_clksrc = 5,/*!< xosc_clksrc : xosc_clksrc                                                 */
  CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_clk_sys = 6,    /*!< clk_sys : clk_sys                                                         */
  CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_clk_usb = 7,    /*!< clk_usb : clk_usb                                                         */
  CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_clk_adc = 8,    /*!< clk_adc : clk_adc                                                         */
  CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_clk_rtc = 9,    /*!< clk_rtc : clk_rtc                                                         */
  CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_clk_ref = 10,   /*!< clk_ref : clk_ref                                                         */
} CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_Enum;

/* ====================================================  CLK_GPOUT2_DIV  ===================================================== */
/* ==================================================  CLK_GPOUT2_SELECTED  ================================================== */
/* ====================================================  CLK_GPOUT3_CTRL  ==================================================== */
/* =========================================  CLOCKS CLK_GPOUT3_CTRL AUXSRC [5..8]  ========================================== */
typedef enum {                                  /*!< CLOCKS_CLK_GPOUT3_CTRL_AUXSRC                                             */
  CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_clksrc_pll_sys = 0,/*!< clksrc_pll_sys : clksrc_pll_sys                                        */
  CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_clksrc_gpin0 = 1,/*!< clksrc_gpin0 : clksrc_gpin0                                              */
  CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_clksrc_gpin1 = 2,/*!< clksrc_gpin1 : clksrc_gpin1                                              */
  CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_clksrc_pll_usb = 3,/*!< clksrc_pll_usb : clksrc_pll_usb                                        */
  CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_rosc_clksrc_ph = 4,/*!< rosc_clksrc_ph : rosc_clksrc_ph                                        */
  CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_xosc_clksrc = 5,/*!< xosc_clksrc : xosc_clksrc                                                 */
  CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_clk_sys = 6,    /*!< clk_sys : clk_sys                                                         */
  CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_clk_usb = 7,    /*!< clk_usb : clk_usb                                                         */
  CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_clk_adc = 8,    /*!< clk_adc : clk_adc                                                         */
  CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_clk_rtc = 9,    /*!< clk_rtc : clk_rtc                                                         */
  CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_clk_ref = 10,   /*!< clk_ref : clk_ref                                                         */
} CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_Enum;

/* ====================================================  CLK_GPOUT3_DIV  ===================================================== */
/* ==================================================  CLK_GPOUT3_SELECTED  ================================================== */
/* =====================================================  CLK_REF_CTRL  ====================================================== */
/* ===========================================  CLOCKS CLK_REF_CTRL AUXSRC [5..6]  =========================================== */
typedef enum {                                  /*!< CLOCKS_CLK_REF_CTRL_AUXSRC                                                */
  CLOCKS_CLK_REF_CTRL_AUXSRC_clksrc_pll_usb = 0,/*!< clksrc_pll_usb : clksrc_pll_usb                                           */
  CLOCKS_CLK_REF_CTRL_AUXSRC_clksrc_gpin0 = 1,  /*!< clksrc_gpin0 : clksrc_gpin0                                               */
  CLOCKS_CLK_REF_CTRL_AUXSRC_clksrc_gpin1 = 2,  /*!< clksrc_gpin1 : clksrc_gpin1                                               */
} CLOCKS_CLK_REF_CTRL_AUXSRC_Enum;

