mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ============================================  CLOCKS CLK_REF_CTRL SRC [0..1]  ============================================= */
typedef enum {                                  /*!< CLOCKS_CLK_REF_CTRL_SRC                                                   */
  CLOCKS_CLK_REF_CTRL_SRC_rosc_clksrc_ph = 0,   /*!< rosc_clksrc_ph : rosc_clksrc_ph                                           */
  CLOCKS_CLK_REF_CTRL_SRC_clksrc_clk_ref_aux = 1,/*!< clksrc_clk_ref_aux : clksrc_clk_ref_aux                                  */
  CLOCKS_CLK_REF_CTRL_SRC_xosc_clksrc  = 2,     /*!< xosc_clksrc : xosc_clksrc                                                 */
} CLOCKS_CLK_REF_CTRL_SRC_Enum;

/* ======================================================  CLK_REF_DIV  ====================================================== */
/* ===================================================  CLK_REF_SELECTED  ==================================================== */
/* =====================================================  CLK_SYS_CTRL  ====================================================== */
/* ===========================================  CLOCKS CLK_SYS_CTRL AUXSRC [5..7]  =========================================== */
typedef enum {                                  /*!< CLOCKS_CLK_SYS_CTRL_AUXSRC                                                */
  CLOCKS_CLK_SYS_CTRL_AUXSRC_clksrc_pll_sys = 0,/*!< clksrc_pll_sys : clksrc_pll_sys                                           */
  CLOCKS_CLK_SYS_CTRL_AUXSRC_clksrc_pll_usb = 1,/*!< clksrc_pll_usb : clksrc_pll_usb                                           */
  CLOCKS_CLK_SYS_CTRL_AUXSRC_rosc_clksrc = 2,   /*!< rosc_clksrc : rosc_clksrc                                                 */
  CLOCKS_CLK_SYS_CTRL_AUXSRC_xosc_clksrc = 3,   /*!< xosc_clksrc : xosc_clksrc                                                 */
  CLOCKS_CLK_SYS_CTRL_AUXSRC_clksrc_gpin0 = 4,  /*!< clksrc_gpin0 : clksrc_gpin0                                               */
  CLOCKS_CLK_SYS_CTRL_AUXSRC_clksrc_gpin1 = 5,  /*!< clksrc_gpin1 : clksrc_gpin1                                               */
} CLOCKS_CLK_SYS_CTRL_AUXSRC_Enum;

/* ============================================  CLOCKS CLK_SYS_CTRL SRC [0..0]  ============================================= */
typedef enum {                                  /*!< CLOCKS_CLK_SYS_CTRL_SRC                                                   */
  CLOCKS_CLK_SYS_CTRL_SRC_clk_ref      = 0,     /*!< clk_ref : clk_ref                                                         */
  CLOCKS_CLK_SYS_CTRL_SRC_clksrc_clk_sys_aux = 1,/*!< clksrc_clk_sys_aux : clksrc_clk_sys_aux                                  */
} CLOCKS_CLK_SYS_CTRL_SRC_Enum;

/* ======================================================  CLK_SYS_DIV  ====================================================== */
/* ===================================================  CLK_SYS_SELECTED  ==================================================== */
/* =====================================================  CLK_PERI_CTRL  ===================================================== */
/* ==========================================  CLOCKS CLK_PERI_CTRL AUXSRC [5..7]  =========================================== */
typedef enum {                                  /*!< CLOCKS_CLK_PERI_CTRL_AUXSRC                                               */
  CLOCKS_CLK_PERI_CTRL_AUXSRC_clk_sys  = 0,     /*!< clk_sys : clk_sys                                                         */
  CLOCKS_CLK_PERI_CTRL_AUXSRC_clksrc_pll_sys = 1,/*!< clksrc_pll_sys : clksrc_pll_sys                                          */
  CLOCKS_CLK_PERI_CTRL_AUXSRC_clksrc_pll_usb = 2,/*!< clksrc_pll_usb : clksrc_pll_usb                                          */
  CLOCKS_CLK_PERI_CTRL_AUXSRC_rosc_clksrc_ph = 3,/*!< rosc_clksrc_ph : rosc_clksrc_ph                                          */
  CLOCKS_CLK_PERI_CTRL_AUXSRC_xosc_clksrc = 4,  /*!< xosc_clksrc : xosc_clksrc                                                 */
  CLOCKS_CLK_PERI_CTRL_AUXSRC_clksrc_gpin0 = 5, /*!< clksrc_gpin0 : clksrc_gpin0                                               */
  CLOCKS_CLK_PERI_CTRL_AUXSRC_clksrc_gpin1 = 6, /*!< clksrc_gpin1 : clksrc_gpin1                                               */
} CLOCKS_CLK_PERI_CTRL_AUXSRC_Enum;

/* ===================================================  CLK_PERI_SELECTED  =================================================== */
/* =====================================================  CLK_USB_CTRL  ====================================================== */
/* ===========================================  CLOCKS CLK_USB_CTRL AUXSRC [5..7]  =========================================== */
typedef enum {                                  /*!< CLOCKS_CLK_USB_CTRL_AUXSRC                                                */
  CLOCKS_CLK_USB_CTRL_AUXSRC_clksrc_pll_usb = 0,/*!< clksrc_pll_usb : clksrc_pll_usb                                           */
  CLOCKS_CLK_USB_CTRL_AUXSRC_clksrc_pll_sys = 1,/*!< clksrc_pll_sys : clksrc_pll_sys                                           */
  CLOCKS_CLK_USB_CTRL_AUXSRC_rosc_clksrc_ph = 2,/*!< rosc_clksrc_ph : rosc_clksrc_ph                                           */
  CLOCKS_CLK_USB_CTRL_AUXSRC_xosc_clksrc = 3,   /*!< xosc_clksrc : xosc_clksrc                                                 */
  CLOCKS_CLK_USB_CTRL_AUXSRC_clksrc_gpin0 = 4,  /*!< clksrc_gpin0 : clksrc_gpin0                                               */
  CLOCKS_CLK_USB_CTRL_AUXSRC_clksrc_gpin1 = 5,  /*!< clksrc_gpin1 : clksrc_gpin1                                               */
} CLOCKS_CLK_USB_CTRL_AUXSRC_Enum;

/* ======================================================  CLK_USB_DIV  ====================================================== */
/* ===================================================  CLK_USB_SELECTED  ==================================================== */
/* =====================================================  CLK_ADC_CTRL  ====================================================== */
/* ===========================================  CLOCKS CLK_ADC_CTRL AUXSRC [5..7]  =========================================== */
typedef enum {                                  /*!< CLOCKS_CLK_ADC_CTRL_AUXSRC                                                */
  CLOCKS_CLK_ADC_CTRL_AUXSRC_clksrc_pll_usb = 0,/*!< clksrc_pll_usb : clksrc_pll_usb                                           */
  CLOCKS_CLK_ADC_CTRL_AUXSRC_clksrc_pll_sys = 1,/*!< clksrc_pll_sys : clksrc_pll_sys                                           */
  CLOCKS_CLK_ADC_CTRL_AUXSRC_rosc_clksrc_ph = 2,/*!< rosc_clksrc_ph : rosc_clksrc_ph                                           */
  CLOCKS_CLK_ADC_CTRL_AUXSRC_xosc_clksrc = 3,   /*!< xosc_clksrc : xosc_clksrc                                                 */
  CLOCKS_CLK_ADC_CTRL_AUXSRC_clksrc_gpin0 = 4,  /*!< clksrc_gpin0 : clksrc_gpin0                                               */
  CLOCKS_CLK_ADC_CTRL_AUXSRC_clksrc_gpin1 = 5,  /*!< clksrc_gpin1 : clksrc_gpin1                                               */
} CLOCKS_CLK_ADC_CTRL_AUXSRC_Enum;

/* ======================================================  CLK_ADC_DIV  ====================================================== */
/* ===================================================  CLK_ADC_SELECTED  ==================================================== */
/* =====================================================  CLK_RTC_CTRL  ====================================================== */
/* ===========================================  CLOCKS CLK_RTC_CTRL AUXSRC [5..7]  =========================================== */
typedef enum {                                  /*!< CLOCKS_CLK_RTC_CTRL_AUXSRC                                                */
  CLOCKS_CLK_RTC_CTRL_AUXSRC_clksrc_pll_usb = 0,/*!< clksrc_pll_usb : clksrc_pll_usb                                           */
  CLOCKS_CLK_RTC_CTRL_AUXSRC_clksrc_pll_sys = 1,/*!< clksrc_pll_sys : clksrc_pll_sys                                           */
  CLOCKS_CLK_RTC_CTRL_AUXSRC_rosc_clksrc_ph = 2,/*!< rosc_clksrc_ph : rosc_clksrc_ph                                           */
  CLOCKS_CLK_RTC_CTRL_AUXSRC_xosc_clksrc = 3,   /*!< xosc_clksrc : xosc_clksrc                                                 */
  CLOCKS_CLK_RTC_CTRL_AUXSRC_clksrc_gpin0 = 4,  /*!< clksrc_gpin0 : clksrc_gpin0                                               */
  CLOCKS_CLK_RTC_CTRL_AUXSRC_clksrc_gpin1 = 5,  /*!< clksrc_gpin1 : clksrc_gpin1                                               */
} CLOCKS_CLK_RTC_CTRL_AUXSRC_Enum;

/* ======================================================  CLK_RTC_DIV  ====================================================== */
/* ===================================================  CLK_RTC_SELECTED  ==================================================== */
/* ==================================================  CLK_SYS_RESUS_CTRL  =================================================== */
/* =================================================  CLK_SYS_RESUS_STATUS  ================================================== */
/* ======================================================  FC0_REF_KHZ  ====================================================== */
/* ======================================================  FC0_MIN_KHZ  ====================================================== */
/* ======================================================  FC0_MAX_KHZ  ====================================================== */
/* =======================================================  FC0_DELAY  ======================================================= */
/* =====================================================  FC0_INTERVAL  ====================================================== */
/* ========================================================  FC0_SRC  ======================================================== */
/* =============================================  CLOCKS FC0_SRC FC0_SRC [0..7]  ============================================= */
typedef enum {                                  /*!< CLOCKS_FC0_SRC_FC0_SRC                                                    */
  CLOCKS_FC0_SRC_FC0_SRC_NULL          = 0,     /*!< NULL : NULL                                                               */
  CLOCKS_FC0_SRC_FC0_SRC_pll_sys_clksrc_primary = 1,/*!< pll_sys_clksrc_primary : pll_sys_clksrc_primary                       */
  CLOCKS_FC0_SRC_FC0_SRC_pll_usb_clksrc_primary = 2,/*!< pll_usb_clksrc_primary : pll_usb_clksrc_primary                       */
  CLOCKS_FC0_SRC_FC0_SRC_rosc_clksrc   = 3,     /*!< rosc_clksrc : rosc_clksrc                                                 */
  CLOCKS_FC0_SRC_FC0_SRC_rosc_clksrc_ph = 4,    /*!< rosc_clksrc_ph : rosc_clksrc_ph                                           */
  CLOCKS_FC0_SRC_FC0_SRC_xosc_clksrc   = 5,     /*!< xosc_clksrc : xosc_clksrc                                                 */
  CLOCKS_FC0_SRC_FC0_SRC_clksrc_gpin0  = 6,     /*!< clksrc_gpin0 : clksrc_gpin0                                               */
  CLOCKS_FC0_SRC_FC0_SRC_clksrc_gpin1  = 7,     /*!< clksrc_gpin1 : clksrc_gpin1                                               */
  CLOCKS_FC0_SRC_FC0_SRC_clk_ref       = 8,     /*!< clk_ref : clk_ref                                                         */
  CLOCKS_FC0_SRC_FC0_SRC_clk_sys       = 9,     /*!< clk_sys : clk_sys                                                         */
  CLOCKS_FC0_SRC_FC0_SRC_clk_peri      = 10,    /*!< clk_peri : clk_peri                                                       */
  CLOCKS_FC0_SRC_FC0_SRC_clk_usb       = 11,    /*!< clk_usb : clk_usb                                                         */
  CLOCKS_FC0_SRC_FC0_SRC_clk_adc       = 12,    /*!< clk_adc : clk_adc                                                         */
  CLOCKS_FC0_SRC_FC0_SRC_clk_rtc       = 13,    /*!< clk_rtc : clk_rtc                                                         */
} CLOCKS_FC0_SRC_FC0_SRC_Enum;

/* ======================================================  FC0_STATUS  ======================================================= */
/* ======================================================  FC0_RESULT  ======================================================= */
/* =======================================================  WAKE_EN0  ======================================================== */
/* =======================================================  WAKE_EN1  ======================================================== */
/* =======================================================  SLEEP_EN0  ======================================================= */
/* =======================================================  SLEEP_EN1  ======================================================= */
/* =======================================================  ENABLED0  ======================================================== */
/* =======================================================  ENABLED1  ======================================================== */
/* =========================================================  INTR  ========================================================== */
/* =========================================================  INTE  ========================================================== */
/* =========================================================  INTF  ========================================================== */
/* =========================================================  INTS  ========================================================== */


/* =========================================================================================================================== */
/* ================                                          RESETS                                           ================ */
/* =========================================================================================================================== */

