mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ==========================================  IO_BANK0 GPIO27_CTRL OUTOVER [8..9]  ========================================== */
typedef enum {                                  /*!< IO_BANK0_GPIO27_CTRL_OUTOVER                                              */
  IO_BANK0_GPIO27_CTRL_OUTOVER_NORMAL  = 0,     /*!< NORMAL : drive output from peripheral signal selected by funcsel          */
  IO_BANK0_GPIO27_CTRL_OUTOVER_INVERT  = 1,     /*!< INVERT : drive output from inverse of peripheral signal selected
                                                     by funcsel                                                                */
  IO_BANK0_GPIO27_CTRL_OUTOVER_LOW     = 2,     /*!< LOW : drive output low                                                    */
  IO_BANK0_GPIO27_CTRL_OUTOVER_HIGH    = 3,     /*!< HIGH : drive output high                                                  */
} IO_BANK0_GPIO27_CTRL_OUTOVER_Enum;

/* ==========================================  IO_BANK0 GPIO27_CTRL FUNCSEL [0..4]  ========================================== */
typedef enum {                                  /*!< IO_BANK0_GPIO27_CTRL_FUNCSEL                                              */
  IO_BANK0_GPIO27_CTRL_FUNCSEL_spi1_tx = 1,     /*!< spi1_tx : spi1_tx                                                         */
  IO_BANK0_GPIO27_CTRL_FUNCSEL_uart1_rts = 2,   /*!< uart1_rts : uart1_rts                                                     */
  IO_BANK0_GPIO27_CTRL_FUNCSEL_i2c1_scl = 3,    /*!< i2c1_scl : i2c1_scl                                                       */
  IO_BANK0_GPIO27_CTRL_FUNCSEL_pwm_b_5 = 4,     /*!< pwm_b_5 : pwm_b_5                                                         */
  IO_BANK0_GPIO27_CTRL_FUNCSEL_sio_27  = 5,     /*!< sio_27 : sio_27                                                           */
  IO_BANK0_GPIO27_CTRL_FUNCSEL_pio0_27 = 6,     /*!< pio0_27 : pio0_27                                                         */
  IO_BANK0_GPIO27_CTRL_FUNCSEL_pio1_27 = 7,     /*!< pio1_27 : pio1_27                                                         */
  IO_BANK0_GPIO27_CTRL_FUNCSEL_usb_muxing_overcurr_detect = 9,/*!< usb_muxing_overcurr_detect : usb_muxing_overcurr_detect     */
  IO_BANK0_GPIO27_CTRL_FUNCSEL_null    = 31,    /*!< null : null                                                               */
} IO_BANK0_GPIO27_CTRL_FUNCSEL_Enum;

/* =====================================================  GPIO28_STATUS  ===================================================== */
/* ======================================================  GPIO28_CTRL  ====================================================== */
/* =========================================  IO_BANK0 GPIO28_CTRL IRQOVER [28..29]  ========================================= */
typedef enum {                                  /*!< IO_BANK0_GPIO28_CTRL_IRQOVER                                              */
  IO_BANK0_GPIO28_CTRL_IRQOVER_NORMAL  = 0,     /*!< NORMAL : don't invert the interrupt                                       */
  IO_BANK0_GPIO28_CTRL_IRQOVER_INVERT  = 1,     /*!< INVERT : invert the interrupt                                             */
  IO_BANK0_GPIO28_CTRL_IRQOVER_LOW     = 2,     /*!< LOW : drive interrupt low                                                 */
  IO_BANK0_GPIO28_CTRL_IRQOVER_HIGH    = 3,     /*!< HIGH : drive interrupt high                                               */
} IO_BANK0_GPIO28_CTRL_IRQOVER_Enum;

/* =========================================  IO_BANK0 GPIO28_CTRL INOVER [16..17]  ========================================== */
typedef enum {                                  /*!< IO_BANK0_GPIO28_CTRL_INOVER                                               */
  IO_BANK0_GPIO28_CTRL_INOVER_NORMAL   = 0,     /*!< NORMAL : don't invert the peri input                                      */
  IO_BANK0_GPIO28_CTRL_INOVER_INVERT   = 1,     /*!< INVERT : invert the peri input                                            */
  IO_BANK0_GPIO28_CTRL_INOVER_LOW      = 2,     /*!< LOW : drive peri input low                                                */
  IO_BANK0_GPIO28_CTRL_INOVER_HIGH     = 3,     /*!< HIGH : drive peri input high                                              */
} IO_BANK0_GPIO28_CTRL_INOVER_Enum;

/* =========================================  IO_BANK0 GPIO28_CTRL OEOVER [12..13]  ========================================== */
typedef enum {                                  /*!< IO_BANK0_GPIO28_CTRL_OEOVER                                               */
  IO_BANK0_GPIO28_CTRL_OEOVER_NORMAL   = 0,     /*!< NORMAL : drive output enable from peripheral signal selected
                                                     by funcsel                                                                */
  IO_BANK0_GPIO28_CTRL_OEOVER_INVERT   = 1,     /*!< INVERT : drive output enable from inverse of peripheral signal
                                                     selected by funcsel                                                       */
  IO_BANK0_GPIO28_CTRL_OEOVER_DISABLE  = 2,     /*!< DISABLE : disable output                                                  */
  IO_BANK0_GPIO28_CTRL_OEOVER_ENABLE   = 3,     /*!< ENABLE : enable output                                                    */
} IO_BANK0_GPIO28_CTRL_OEOVER_Enum;

/* ==========================================  IO_BANK0 GPIO28_CTRL OUTOVER [8..9]  ========================================== */
typedef enum {                                  /*!< IO_BANK0_GPIO28_CTRL_OUTOVER                                              */
  IO_BANK0_GPIO28_CTRL_OUTOVER_NORMAL  = 0,     /*!< NORMAL : drive output from peripheral signal selected by funcsel          */
  IO_BANK0_GPIO28_CTRL_OUTOVER_INVERT  = 1,     /*!< INVERT : drive output from inverse of peripheral signal selected
                                                     by funcsel                                                                */
  IO_BANK0_GPIO28_CTRL_OUTOVER_LOW     = 2,     /*!< LOW : drive output low                                                    */
  IO_BANK0_GPIO28_CTRL_OUTOVER_HIGH    = 3,     /*!< HIGH : drive output high                                                  */
} IO_BANK0_GPIO28_CTRL_OUTOVER_Enum;

/* ==========================================  IO_BANK0 GPIO28_CTRL FUNCSEL [0..4]  ========================================== */
typedef enum {                                  /*!< IO_BANK0_GPIO28_CTRL_FUNCSEL                                              */
  IO_BANK0_GPIO28_CTRL_FUNCSEL_spi1_rx = 1,     /*!< spi1_rx : spi1_rx                                                         */
  IO_BANK0_GPIO28_CTRL_FUNCSEL_uart0_tx = 2,    /*!< uart0_tx : uart0_tx                                                       */
  IO_BANK0_GPIO28_CTRL_FUNCSEL_i2c0_sda = 3,    /*!< i2c0_sda : i2c0_sda                                                       */
  IO_BANK0_GPIO28_CTRL_FUNCSEL_pwm_a_6 = 4,     /*!< pwm_a_6 : pwm_a_6                                                         */
  IO_BANK0_GPIO28_CTRL_FUNCSEL_sio_28  = 5,     /*!< sio_28 : sio_28                                                           */
  IO_BANK0_GPIO28_CTRL_FUNCSEL_pio0_28 = 6,     /*!< pio0_28 : pio0_28                                                         */
  IO_BANK0_GPIO28_CTRL_FUNCSEL_pio1_28 = 7,     /*!< pio1_28 : pio1_28                                                         */
  IO_BANK0_GPIO28_CTRL_FUNCSEL_usb_muxing_vbus_detect = 9,/*!< usb_muxing_vbus_detect : usb_muxing_vbus_detect                 */
  IO_BANK0_GPIO28_CTRL_FUNCSEL_null    = 31,    /*!< null : null                                                               */
} IO_BANK0_GPIO28_CTRL_FUNCSEL_Enum;

/* =====================================================  GPIO29_STATUS  ===================================================== */
/* ======================================================  GPIO29_CTRL  ====================================================== */
/* =========================================  IO_BANK0 GPIO29_CTRL IRQOVER [28..29]  ========================================= */
typedef enum {                                  /*!< IO_BANK0_GPIO29_CTRL_IRQOVER                                              */
  IO_BANK0_GPIO29_CTRL_IRQOVER_NORMAL  = 0,     /*!< NORMAL : don't invert the interrupt                                       */
  IO_BANK0_GPIO29_CTRL_IRQOVER_INVERT  = 1,     /*!< INVERT : invert the interrupt                                             */
  IO_BANK0_GPIO29_CTRL_IRQOVER_LOW     = 2,     /*!< LOW : drive interrupt low                                                 */
  IO_BANK0_GPIO29_CTRL_IRQOVER_HIGH    = 3,     /*!< HIGH : drive interrupt high                                               */
} IO_BANK0_GPIO29_CTRL_IRQOVER_Enum;

/* =========================================  IO_BANK0 GPIO29_CTRL INOVER [16..17]  ========================================== */
typedef enum {                                  /*!< IO_BANK0_GPIO29_CTRL_INOVER                                               */
  IO_BANK0_GPIO29_CTRL_INOVER_NORMAL   = 0,     /*!< NORMAL : don't invert the peri input                                      */
  IO_BANK0_GPIO29_CTRL_INOVER_INVERT   = 1,     /*!< INVERT : invert the peri input                                            */
  IO_BANK0_GPIO29_CTRL_INOVER_LOW      = 2,     /*!< LOW : drive peri input low                                                */
  IO_BANK0_GPIO29_CTRL_INOVER_HIGH     = 3,     /*!< HIGH : drive peri input high                                              */
} IO_BANK0_GPIO29_CTRL_INOVER_Enum;

/* =========================================  IO_BANK0 GPIO29_CTRL OEOVER [12..13]  ========================================== */
typedef enum {                                  /*!< IO_BANK0_GPIO29_CTRL_OEOVER                                               */
  IO_BANK0_GPIO29_CTRL_OEOVER_NORMAL   = 0,     /*!< NORMAL : drive output enable from peripheral signal selected
                                                     by funcsel                                                                */
  IO_BANK0_GPIO29_CTRL_OEOVER_INVERT   = 1,     /*!< INVERT : drive output enable from inverse of peripheral signal
                                                     selected by funcsel                                                       */
  IO_BANK0_GPIO29_CTRL_OEOVER_DISABLE  = 2,     /*!< DISABLE : disable output                                                  */
  IO_BANK0_GPIO29_CTRL_OEOVER_ENABLE   = 3,     /*!< ENABLE : enable output                                                    */
} IO_BANK0_GPIO29_CTRL_OEOVER_Enum;

/* ==========================================  IO_BANK0 GPIO29_CTRL OUTOVER [8..9]  ========================================== */
typedef enum {                                  /*!< IO_BANK0_GPIO29_CTRL_OUTOVER                                              */
  IO_BANK0_GPIO29_CTRL_OUTOVER_NORMAL  = 0,     /*!< NORMAL : drive output from peripheral signal selected by funcsel          */
  IO_BANK0_GPIO29_CTRL_OUTOVER_INVERT  = 1,     /*!< INVERT : drive output from inverse of peripheral signal selected
                                                     by funcsel                                                                */
  IO_BANK0_GPIO29_CTRL_OUTOVER_LOW     = 2,     /*!< LOW : drive output low                                                    */
  IO_BANK0_GPIO29_CTRL_OUTOVER_HIGH    = 3,     /*!< HIGH : drive output high                                                  */
} IO_BANK0_GPIO29_CTRL_OUTOVER_Enum;

/* ==========================================  IO_BANK0 GPIO29_CTRL FUNCSEL [0..4]  ========================================== */
typedef enum {                                  /*!< IO_BANK0_GPIO29_CTRL_FUNCSEL                                              */
  IO_BANK0_GPIO29_CTRL_FUNCSEL_spi1_ss_n = 1,   /*!< spi1_ss_n : spi1_ss_n                                                     */
  IO_BANK0_GPIO29_CTRL_FUNCSEL_uart0_rx = 2,    /*!< uart0_rx : uart0_rx                                                       */
  IO_BANK0_GPIO29_CTRL_FUNCSEL_i2c0_scl = 3,    /*!< i2c0_scl : i2c0_scl                                                       */
  IO_BANK0_GPIO29_CTRL_FUNCSEL_pwm_b_6 = 4,     /*!< pwm_b_6 : pwm_b_6                                                         */
  IO_BANK0_GPIO29_CTRL_FUNCSEL_sio_29  = 5,     /*!< sio_29 : sio_29                                                           */
  IO_BANK0_GPIO29_CTRL_FUNCSEL_pio0_29 = 6,     /*!< pio0_29 : pio0_29                                                         */
  IO_BANK0_GPIO29_CTRL_FUNCSEL_pio1_29 = 7,     /*!< pio1_29 : pio1_29                                                         */
  IO_BANK0_GPIO29_CTRL_FUNCSEL_usb_muxing_vbus_en = 9,/*!< usb_muxing_vbus_en : usb_muxing_vbus_en                             */
  IO_BANK0_GPIO29_CTRL_FUNCSEL_null    = 31,    /*!< null : null                                                               */
} IO_BANK0_GPIO29_CTRL_FUNCSEL_Enum;

/* =========================================================  INTR0  ========================================================= */
/* =========================================================  INTR1  ========================================================= */
/* =========================================================  INTR2  ========================================================= */
/* =========================================================  INTR3  ========================================================= */
/* ======================================================  PROC0_INTE0  ====================================================== */
/* ======================================================  PROC0_INTE1  ====================================================== */
/* ======================================================  PROC0_INTE2  ====================================================== */
/* ======================================================  PROC0_INTE3  ====================================================== */
/* ======================================================  PROC0_INTF0  ====================================================== */
/* ======================================================  PROC0_INTF1  ====================================================== */
/* ======================================================  PROC0_INTF2  ====================================================== */
/* ======================================================  PROC0_INTF3  ====================================================== */
/* ======================================================  PROC0_INTS0  ====================================================== */
/* ======================================================  PROC0_INTS1  ====================================================== */
/* ======================================================  PROC0_INTS2  ====================================================== */
/* ======================================================  PROC0_INTS3  ====================================================== */
/* ======================================================  PROC1_INTE0  ====================================================== */
/* ======================================================  PROC1_INTE1  ====================================================== */
/* ======================================================  PROC1_INTE2  ====================================================== */
/* ======================================================  PROC1_INTE3  ====================================================== */
/* ======================================================  PROC1_INTF0  ====================================================== */
/* ======================================================  PROC1_INTF1  ====================================================== */
/* ======================================================  PROC1_INTF2  ====================================================== */
/* ======================================================  PROC1_INTF3  ====================================================== */
/* ======================================================  PROC1_INTS0  ====================================================== */
/* ======================================================  PROC1_INTS1  ====================================================== */
/* ======================================================  PROC1_INTS2  ====================================================== */
/* ======================================================  PROC1_INTS3  ====================================================== */
/* ==================================================  DORMANT_WAKE_INTE0  =================================================== */
/* ==================================================  DORMANT_WAKE_INTE1  =================================================== */
/* ==================================================  DORMANT_WAKE_INTE2  =================================================== */
/* ==================================================  DORMANT_WAKE_INTE3  =================================================== */
/* ==================================================  DORMANT_WAKE_INTF0  =================================================== */
/* ==================================================  DORMANT_WAKE_INTF1  =================================================== */
/* ==================================================  DORMANT_WAKE_INTF2  =================================================== */
/* ==================================================  DORMANT_WAKE_INTF3  =================================================== */
/* ==================================================  DORMANT_WAKE_INTS0  =================================================== */
/* ==================================================  DORMANT_WAKE_INTS1  =================================================== */
/* ==================================================  DORMANT_WAKE_INTS2  =================================================== */
/* ==================================================  DORMANT_WAKE_INTS3  =================================================== */


/* =========================================================================================================================== */
/* ================                                          IO_QSPI                                          ================ */
/* =========================================================================================================================== */

/* =================================================  GPIO_QSPI_SCLK_STATUS  ================================================= */
/* ==================================================  GPIO_QSPI_SCLK_CTRL  ================================================== */
/* =====================================  IO_QSPI GPIO_QSPI_SCLK_CTRL IRQOVER [28..29]  ====================================== */
typedef enum {                                  /*!< IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER                                       */
  IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_NORMAL = 0,/*!< NORMAL : don't invert the interrupt                                      */
  IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_INVERT = 1,/*!< INVERT : invert the interrupt                                            */
  IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_LOW = 2,  /*!< LOW : drive interrupt low                                                 */
  IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_HIGH = 3, /*!< HIGH : drive interrupt high                                               */
} IO_QSPI_GPIO_QSPI_SCLK_CTRL_IRQOVER_Enum;

