mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ======================================  IO_QSPI GPIO_QSPI_SD2_CTRL INOVER [16..17]  ======================================= */
typedef enum {                                  /*!< IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER                                         */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_NORMAL = 0, /*!< NORMAL : don't invert the peri input                                      */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_INVERT = 1, /*!< INVERT : invert the peri input                                            */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_LOW = 2,    /*!< LOW : drive peri input low                                                */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_HIGH = 3,   /*!< HIGH : drive peri input high                                              */
} IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_Enum;

/* ======================================  IO_QSPI GPIO_QSPI_SD2_CTRL OEOVER [12..13]  ======================================= */
typedef enum {                                  /*!< IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER                                         */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_NORMAL = 0, /*!< NORMAL : drive output enable from peripheral signal selected
                                                     by funcsel                                                                */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_INVERT = 1, /*!< INVERT : drive output enable from inverse of peripheral signal
                                                     selected by funcsel                                                       */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_DISABLE = 2,/*!< DISABLE : disable output                                                  */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_ENABLE = 3, /*!< ENABLE : enable output                                                    */
} IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_Enum;

/* =======================================  IO_QSPI GPIO_QSPI_SD2_CTRL OUTOVER [8..9]  ======================================= */
typedef enum {                                  /*!< IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER                                        */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_NORMAL = 0,/*!< NORMAL : drive output from peripheral signal selected by funcsel          */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_INVERT = 1,/*!< INVERT : drive output from inverse of peripheral signal selected
                                                     by funcsel                                                                */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_LOW = 2,   /*!< LOW : drive output low                                                    */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_HIGH = 3,  /*!< HIGH : drive output high                                                  */
} IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_Enum;

/* =======================================  IO_QSPI GPIO_QSPI_SD2_CTRL FUNCSEL [0..4]  ======================================= */
typedef enum {                                  /*!< IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL                                        */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_xip_sd2 = 0,/*!< xip_sd2 : xip_sd2                                                        */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_sio_34 = 5,/*!< sio_34 : sio_34                                                           */
  IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_null = 31, /*!< null : null                                                               */
} IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_Enum;

/* =================================================  GPIO_QSPI_SD3_STATUS  ================================================== */
/* ==================================================  GPIO_QSPI_SD3_CTRL  =================================================== */
/* ======================================  IO_QSPI GPIO_QSPI_SD3_CTRL IRQOVER [28..29]  ====================================== */
typedef enum {                                  /*!< IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER                                        */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_NORMAL = 0,/*!< NORMAL : don't invert the interrupt                                       */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_INVERT = 1,/*!< INVERT : invert the interrupt                                             */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_LOW = 2,   /*!< LOW : drive interrupt low                                                 */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_HIGH = 3,  /*!< HIGH : drive interrupt high                                               */
} IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_Enum;

/* ======================================  IO_QSPI GPIO_QSPI_SD3_CTRL INOVER [16..17]  ======================================= */
typedef enum {                                  /*!< IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER                                         */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_NORMAL = 0, /*!< NORMAL : don't invert the peri input                                      */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_INVERT = 1, /*!< INVERT : invert the peri input                                            */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_LOW = 2,    /*!< LOW : drive peri input low                                                */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_HIGH = 3,   /*!< HIGH : drive peri input high                                              */
} IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_Enum;

/* ======================================  IO_QSPI GPIO_QSPI_SD3_CTRL OEOVER [12..13]  ======================================= */
typedef enum {                                  /*!< IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER                                         */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_NORMAL = 0, /*!< NORMAL : drive output enable from peripheral signal selected
                                                     by funcsel                                                                */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_INVERT = 1, /*!< INVERT : drive output enable from inverse of peripheral signal
                                                     selected by funcsel                                                       */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_DISABLE = 2,/*!< DISABLE : disable output                                                  */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_ENABLE = 3, /*!< ENABLE : enable output                                                    */
} IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_Enum;

/* =======================================  IO_QSPI GPIO_QSPI_SD3_CTRL OUTOVER [8..9]  ======================================= */
typedef enum {                                  /*!< IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER                                        */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_NORMAL = 0,/*!< NORMAL : drive output from peripheral signal selected by funcsel          */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_INVERT = 1,/*!< INVERT : drive output from inverse of peripheral signal selected
                                                     by funcsel                                                                */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_LOW = 2,   /*!< LOW : drive output low                                                    */
  IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_HIGH = 3,  /*!< HIGH : drive output high                                                  */
} IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_Enum;

