mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ========================================================  GPIO20  ========================================================= */
/* ============================================  PADS_BANK0 GPIO20 DRIVE [4..5]  ============================================= */
typedef enum {                                  /*!< PADS_BANK0_GPIO20_DRIVE                                                   */
  PADS_BANK0_GPIO20_DRIVE_2mA          = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_GPIO20_DRIVE_4mA          = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_GPIO20_DRIVE_8mA          = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_GPIO20_DRIVE_12mA         = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_GPIO20_DRIVE_Enum;

/* ========================================================  GPIO21  ========================================================= */
/* ============================================  PADS_BANK0 GPIO21 DRIVE [4..5]  ============================================= */
typedef enum {                                  /*!< PADS_BANK0_GPIO21_DRIVE                                                   */
  PADS_BANK0_GPIO21_DRIVE_2mA          = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_GPIO21_DRIVE_4mA          = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_GPIO21_DRIVE_8mA          = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_GPIO21_DRIVE_12mA         = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_GPIO21_DRIVE_Enum;

/* ========================================================  GPIO22  ========================================================= */
/* ============================================  PADS_BANK0 GPIO22 DRIVE [4..5]  ============================================= */
typedef enum {                                  /*!< PADS_BANK0_GPIO22_DRIVE                                                   */
  PADS_BANK0_GPIO22_DRIVE_2mA          = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_GPIO22_DRIVE_4mA          = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_GPIO22_DRIVE_8mA          = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_GPIO22_DRIVE_12mA         = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_GPIO22_DRIVE_Enum;

/* ========================================================  GPIO23  ========================================================= */
/* ============================================  PADS_BANK0 GPIO23 DRIVE [4..5]  ============================================= */
typedef enum {                                  /*!< PADS_BANK0_GPIO23_DRIVE                                                   */
  PADS_BANK0_GPIO23_DRIVE_2mA          = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_GPIO23_DRIVE_4mA          = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_GPIO23_DRIVE_8mA          = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_GPIO23_DRIVE_12mA         = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_GPIO23_DRIVE_Enum;

/* ========================================================  GPIO24  ========================================================= */
/* ============================================  PADS_BANK0 GPIO24 DRIVE [4..5]  ============================================= */
typedef enum {                                  /*!< PADS_BANK0_GPIO24_DRIVE                                                   */
  PADS_BANK0_GPIO24_DRIVE_2mA          = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_GPIO24_DRIVE_4mA          = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_GPIO24_DRIVE_8mA          = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_GPIO24_DRIVE_12mA         = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_GPIO24_DRIVE_Enum;

/* ========================================================  GPIO25  ========================================================= */
/* ============================================  PADS_BANK0 GPIO25 DRIVE [4..5]  ============================================= */
typedef enum {                                  /*!< PADS_BANK0_GPIO25_DRIVE                                                   */
  PADS_BANK0_GPIO25_DRIVE_2mA          = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_GPIO25_DRIVE_4mA          = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_GPIO25_DRIVE_8mA          = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_GPIO25_DRIVE_12mA         = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_GPIO25_DRIVE_Enum;

/* ========================================================  GPIO26  ========================================================= */
/* ============================================  PADS_BANK0 GPIO26 DRIVE [4..5]  ============================================= */
typedef enum {                                  /*!< PADS_BANK0_GPIO26_DRIVE                                                   */
  PADS_BANK0_GPIO26_DRIVE_2mA          = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_GPIO26_DRIVE_4mA          = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_GPIO26_DRIVE_8mA          = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_GPIO26_DRIVE_12mA         = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_GPIO26_DRIVE_Enum;

/* ========================================================  GPIO27  ========================================================= */
/* ============================================  PADS_BANK0 GPIO27 DRIVE [4..5]  ============================================= */
typedef enum {                                  /*!< PADS_BANK0_GPIO27_DRIVE                                                   */
  PADS_BANK0_GPIO27_DRIVE_2mA          = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_GPIO27_DRIVE_4mA          = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_GPIO27_DRIVE_8mA          = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_GPIO27_DRIVE_12mA         = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_GPIO27_DRIVE_Enum;

/* ========================================================  GPIO28  ========================================================= */
/* ============================================  PADS_BANK0 GPIO28 DRIVE [4..5]  ============================================= */
typedef enum {                                  /*!< PADS_BANK0_GPIO28_DRIVE                                                   */
  PADS_BANK0_GPIO28_DRIVE_2mA          = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_GPIO28_DRIVE_4mA          = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_GPIO28_DRIVE_8mA          = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_GPIO28_DRIVE_12mA         = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_GPIO28_DRIVE_Enum;

/* ========================================================  GPIO29  ========================================================= */
/* ============================================  PADS_BANK0 GPIO29 DRIVE [4..5]  ============================================= */
typedef enum {                                  /*!< PADS_BANK0_GPIO29_DRIVE                                                   */
  PADS_BANK0_GPIO29_DRIVE_2mA          = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_GPIO29_DRIVE_4mA          = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_GPIO29_DRIVE_8mA          = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_GPIO29_DRIVE_12mA         = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_GPIO29_DRIVE_Enum;

/* =========================================================  SWCLK  ========================================================= */
/* =============================================  PADS_BANK0 SWCLK DRIVE [4..5]  ============================================= */
typedef enum {                                  /*!< PADS_BANK0_SWCLK_DRIVE                                                    */
  PADS_BANK0_SWCLK_DRIVE_2mA           = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_SWCLK_DRIVE_4mA           = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_SWCLK_DRIVE_8mA           = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_SWCLK_DRIVE_12mA          = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_SWCLK_DRIVE_Enum;

/* ==========================================================  SWD  ========================================================== */
/* ==============================================  PADS_BANK0 SWD DRIVE [4..5]  ============================================== */
typedef enum {                                  /*!< PADS_BANK0_SWD_DRIVE                                                      */
  PADS_BANK0_SWD_DRIVE_2mA             = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_BANK0_SWD_DRIVE_4mA             = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_BANK0_SWD_DRIVE_8mA             = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_BANK0_SWD_DRIVE_12mA            = 3,     /*!< 12mA : 12mA                                                               */
} PADS_BANK0_SWD_DRIVE_Enum;



/* =========================================================================================================================== */
/* ================                                         PADS_QSPI                                         ================ */
/* =========================================================================================================================== */

/* ====================================================  VOLTAGE_SELECT  ===================================================== */
/* ====================================  PADS_QSPI VOLTAGE_SELECT VOLTAGE_SELECT [0..0]  ===================================== */
typedef enum {                                  /*!< PADS_QSPI_VOLTAGE_SELECT_VOLTAGE_SELECT                                   */
  PADS_QSPI_VOLTAGE_SELECT_VOLTAGE_SELECT_3v3 = 0,/*!< 3v3 : Set voltage to 3.3V (DVDD >= 2V5)                                 */
  PADS_QSPI_VOLTAGE_SELECT_VOLTAGE_SELECT_1v8 = 1,/*!< 1v8 : Set voltage to 1.8V (DVDD <= 1V8)                                 */
} PADS_QSPI_VOLTAGE_SELECT_VOLTAGE_SELECT_Enum;

/* ====================================================  GPIO_QSPI_SCLK  ===================================================== */
/* =========================================  PADS_QSPI GPIO_QSPI_SCLK DRIVE [4..5]  ========================================= */
typedef enum {                                  /*!< PADS_QSPI_GPIO_QSPI_SCLK_DRIVE                                            */
  PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_2mA   = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_4mA   = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_8mA   = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_12mA  = 3,     /*!< 12mA : 12mA                                                               */
} PADS_QSPI_GPIO_QSPI_SCLK_DRIVE_Enum;

