mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =====================================================  GPIO_QSPI_SD0  ===================================================== */
/* =========================================  PADS_QSPI GPIO_QSPI_SD0 DRIVE [4..5]  ========================================== */
typedef enum {                                  /*!< PADS_QSPI_GPIO_QSPI_SD0_DRIVE                                             */
  PADS_QSPI_GPIO_QSPI_SD0_DRIVE_2mA    = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD0_DRIVE_4mA    = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD0_DRIVE_8mA    = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD0_DRIVE_12mA   = 3,     /*!< 12mA : 12mA                                                               */
} PADS_QSPI_GPIO_QSPI_SD0_DRIVE_Enum;

/* =====================================================  GPIO_QSPI_SD1  ===================================================== */
/* =========================================  PADS_QSPI GPIO_QSPI_SD1 DRIVE [4..5]  ========================================== */
typedef enum {                                  /*!< PADS_QSPI_GPIO_QSPI_SD1_DRIVE                                             */
  PADS_QSPI_GPIO_QSPI_SD1_DRIVE_2mA    = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD1_DRIVE_4mA    = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD1_DRIVE_8mA    = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD1_DRIVE_12mA   = 3,     /*!< 12mA : 12mA                                                               */
} PADS_QSPI_GPIO_QSPI_SD1_DRIVE_Enum;

/* =====================================================  GPIO_QSPI_SD2  ===================================================== */
/* =========================================  PADS_QSPI GPIO_QSPI_SD2 DRIVE [4..5]  ========================================== */
typedef enum {                                  /*!< PADS_QSPI_GPIO_QSPI_SD2_DRIVE                                             */
  PADS_QSPI_GPIO_QSPI_SD2_DRIVE_2mA    = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD2_DRIVE_4mA    = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD2_DRIVE_8mA    = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD2_DRIVE_12mA   = 3,     /*!< 12mA : 12mA                                                               */
} PADS_QSPI_GPIO_QSPI_SD2_DRIVE_Enum;

/* =====================================================  GPIO_QSPI_SD3  ===================================================== */
/* =========================================  PADS_QSPI GPIO_QSPI_SD3 DRIVE [4..5]  ========================================== */
typedef enum {                                  /*!< PADS_QSPI_GPIO_QSPI_SD3_DRIVE                                             */
  PADS_QSPI_GPIO_QSPI_SD3_DRIVE_2mA    = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD3_DRIVE_4mA    = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD3_DRIVE_8mA    = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SD3_DRIVE_12mA   = 3,     /*!< 12mA : 12mA                                                               */
} PADS_QSPI_GPIO_QSPI_SD3_DRIVE_Enum;

/* =====================================================  GPIO_QSPI_SS  ====================================================== */
/* ==========================================  PADS_QSPI GPIO_QSPI_SS DRIVE [4..5]  ========================================== */
typedef enum {                                  /*!< PADS_QSPI_GPIO_QSPI_SS_DRIVE                                              */
  PADS_QSPI_GPIO_QSPI_SS_DRIVE_2mA     = 0,     /*!< 2mA : 2mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SS_DRIVE_4mA     = 1,     /*!< 4mA : 4mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SS_DRIVE_8mA     = 2,     /*!< 8mA : 8mA                                                                 */
  PADS_QSPI_GPIO_QSPI_SS_DRIVE_12mA    = 3,     /*!< 12mA : 12mA                                                               */
} PADS_QSPI_GPIO_QSPI_SS_DRIVE_Enum;



/* =========================================================================================================================== */
/* ================                                           XOSC                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* ===============================================  XOSC CTRL ENABLE [12..23]  =============================================== */
typedef enum {                                  /*!< XOSC_CTRL_ENABLE                                                          */
  XOSC_CTRL_ENABLE_DISABLE             = 3358,  /*!< DISABLE : DISABLE                                                         */
  XOSC_CTRL_ENABLE_ENABLE              = 4011,  /*!< ENABLE : ENABLE                                                           */
} XOSC_CTRL_ENABLE_Enum;

/* =============================================  XOSC CTRL FREQ_RANGE [0..11]  ============================================== */
typedef enum {                                  /*!< XOSC_CTRL_FREQ_RANGE                                                      */
  XOSC_CTRL_FREQ_RANGE_1_15MHZ         = 2720,  /*!< 1_15MHZ : 1_15MHZ                                                         */
  XOSC_CTRL_FREQ_RANGE_RESERVED_1      = 2721,  /*!< RESERVED_1 : RESERVED_1                                                   */
  XOSC_CTRL_FREQ_RANGE_RESERVED_2      = 2722,  /*!< RESERVED_2 : RESERVED_2                                                   */
  XOSC_CTRL_FREQ_RANGE_RESERVED_3      = 2723,  /*!< RESERVED_3 : RESERVED_3                                                   */
} XOSC_CTRL_FREQ_RANGE_Enum;

/* ========================================================  STATUS  ========================================================= */
/* =============================================  XOSC STATUS FREQ_RANGE [0..1]  ============================================= */
typedef enum {                                  /*!< XOSC_STATUS_FREQ_RANGE                                                    */
  XOSC_STATUS_FREQ_RANGE_1_15MHZ       = 0,     /*!< 1_15MHZ : 1_15MHZ                                                         */
  XOSC_STATUS_FREQ_RANGE_RESERVED_1    = 1,     /*!< RESERVED_1 : RESERVED_1                                                   */
  XOSC_STATUS_FREQ_RANGE_RESERVED_2    = 2,     /*!< RESERVED_2 : RESERVED_2                                                   */
  XOSC_STATUS_FREQ_RANGE_RESERVED_3    = 3,     /*!< RESERVED_3 : RESERVED_3                                                   */
} XOSC_STATUS_FREQ_RANGE_Enum;

/* ========================================================  DORMANT  ======================================================== */
/* ========================================================  STARTUP  ======================================================== */
/* =========================================================  COUNT  ========================================================= */


/* =========================================================================================================================== */
/* ================                                          PLL_SYS                                          ================ */
/* =========================================================================================================================== */

/* ==========================================================  CS  =========================================================== */
/* ==========================================================  PWR  ========================================================== */
/* =======================================================  FBDIV_INT  ======================================================= */
/* =========================================================  PRIM  ========================================================== */


/* =========================================================================================================================== */
/* ================                                          BUSCTRL                                          ================ */
/* =========================================================================================================================== */

