mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =====================================================  BUS_PRIORITY  ====================================================== */
/* ===================================================  BUS_PRIORITY_ACK  ==================================================== */
/* =======================================================  PERFCTR0  ======================================================== */
/* =======================================================  PERFSEL0  ======================================================== */
/* ===========================================  BUSCTRL PERFSEL0 PERFSEL0 [0..4]  ============================================ */
typedef enum {                                  /*!< BUSCTRL_PERFSEL0_PERFSEL0                                                 */
  BUSCTRL_PERFSEL0_PERFSEL0_apb_contested = 0,  /*!< apb_contested : apb_contested                                             */
  BUSCTRL_PERFSEL0_PERFSEL0_apb        = 1,     /*!< apb : apb                                                                 */
  BUSCTRL_PERFSEL0_PERFSEL0_fastperi_contested = 2,/*!< fastperi_contested : fastperi_contested                                */
  BUSCTRL_PERFSEL0_PERFSEL0_fastperi   = 3,     /*!< fastperi : fastperi                                                       */
  BUSCTRL_PERFSEL0_PERFSEL0_sram5_contested = 4,/*!< sram5_contested : sram5_contested                                         */
  BUSCTRL_PERFSEL0_PERFSEL0_sram5      = 5,     /*!< sram5 : sram5                                                             */
  BUSCTRL_PERFSEL0_PERFSEL0_sram4_contested = 6,/*!< sram4_contested : sram4_contested                                         */
  BUSCTRL_PERFSEL0_PERFSEL0_sram4      = 7,     /*!< sram4 : sram4                                                             */
  BUSCTRL_PERFSEL0_PERFSEL0_sram3_contested = 8,/*!< sram3_contested : sram3_contested                                         */
  BUSCTRL_PERFSEL0_PERFSEL0_sram3      = 9,     /*!< sram3 : sram3                                                             */
  BUSCTRL_PERFSEL0_PERFSEL0_sram2_contested = 10,/*!< sram2_contested : sram2_contested                                        */
  BUSCTRL_PERFSEL0_PERFSEL0_sram2      = 11,    /*!< sram2 : sram2                                                             */
  BUSCTRL_PERFSEL0_PERFSEL0_sram1_contested = 12,/*!< sram1_contested : sram1_contested                                        */
  BUSCTRL_PERFSEL0_PERFSEL0_sram1      = 13,    /*!< sram1 : sram1                                                             */
  BUSCTRL_PERFSEL0_PERFSEL0_sram0_contested = 14,/*!< sram0_contested : sram0_contested                                        */
  BUSCTRL_PERFSEL0_PERFSEL0_sram0      = 15,    /*!< sram0 : sram0                                                             */
  BUSCTRL_PERFSEL0_PERFSEL0_xip_main_contested = 16,/*!< xip_main_contested : xip_main_contested                               */
  BUSCTRL_PERFSEL0_PERFSEL0_xip_main   = 17,    /*!< xip_main : xip_main                                                       */
  BUSCTRL_PERFSEL0_PERFSEL0_rom_contested = 18, /*!< rom_contested : rom_contested                                             */
  BUSCTRL_PERFSEL0_PERFSEL0_rom        = 19,    /*!< rom : rom                                                                 */
} BUSCTRL_PERFSEL0_PERFSEL0_Enum;

/* =======================================================  PERFCTR1  ======================================================== */
/* =======================================================  PERFSEL1  ======================================================== */
/* ===========================================  BUSCTRL PERFSEL1 PERFSEL1 [0..4]  ============================================ */
typedef enum {                                  /*!< BUSCTRL_PERFSEL1_PERFSEL1                                                 */
  BUSCTRL_PERFSEL1_PERFSEL1_apb_contested = 0,  /*!< apb_contested : apb_contested                                             */
  BUSCTRL_PERFSEL1_PERFSEL1_apb        = 1,     /*!< apb : apb                                                                 */
  BUSCTRL_PERFSEL1_PERFSEL1_fastperi_contested = 2,/*!< fastperi_contested : fastperi_contested                                */
  BUSCTRL_PERFSEL1_PERFSEL1_fastperi   = 3,     /*!< fastperi : fastperi                                                       */
  BUSCTRL_PERFSEL1_PERFSEL1_sram5_contested = 4,/*!< sram5_contested : sram5_contested                                         */
  BUSCTRL_PERFSEL1_PERFSEL1_sram5      = 5,     /*!< sram5 : sram5                                                             */
  BUSCTRL_PERFSEL1_PERFSEL1_sram4_contested = 6,/*!< sram4_contested : sram4_contested                                         */
  BUSCTRL_PERFSEL1_PERFSEL1_sram4      = 7,     /*!< sram4 : sram4                                                             */
  BUSCTRL_PERFSEL1_PERFSEL1_sram3_contested = 8,/*!< sram3_contested : sram3_contested                                         */
  BUSCTRL_PERFSEL1_PERFSEL1_sram3      = 9,     /*!< sram3 : sram3                                                             */
  BUSCTRL_PERFSEL1_PERFSEL1_sram2_contested = 10,/*!< sram2_contested : sram2_contested                                        */
  BUSCTRL_PERFSEL1_PERFSEL1_sram2      = 11,    /*!< sram2 : sram2                                                             */
  BUSCTRL_PERFSEL1_PERFSEL1_sram1_contested = 12,/*!< sram1_contested : sram1_contested                                        */
  BUSCTRL_PERFSEL1_PERFSEL1_sram1      = 13,    /*!< sram1 : sram1                                                             */
  BUSCTRL_PERFSEL1_PERFSEL1_sram0_contested = 14,/*!< sram0_contested : sram0_contested                                        */
  BUSCTRL_PERFSEL1_PERFSEL1_sram0      = 15,    /*!< sram0 : sram0                                                             */
  BUSCTRL_PERFSEL1_PERFSEL1_xip_main_contested = 16,/*!< xip_main_contested : xip_main_contested                               */
  BUSCTRL_PERFSEL1_PERFSEL1_xip_main   = 17,    /*!< xip_main : xip_main                                                       */
  BUSCTRL_PERFSEL1_PERFSEL1_rom_contested = 18, /*!< rom_contested : rom_contested                                             */
  BUSCTRL_PERFSEL1_PERFSEL1_rom        = 19,    /*!< rom : rom                                                                 */
} BUSCTRL_PERFSEL1_PERFSEL1_Enum;

/* =======================================================  PERFCTR2  ======================================================== */
/* =======================================================  PERFSEL2  ======================================================== */
/* ===========================================  BUSCTRL PERFSEL2 PERFSEL2 [0..4]  ============================================ */
typedef enum {                                  /*!< BUSCTRL_PERFSEL2_PERFSEL2                                                 */
  BUSCTRL_PERFSEL2_PERFSEL2_apb_contested = 0,  /*!< apb_contested : apb_contested                                             */
  BUSCTRL_PERFSEL2_PERFSEL2_apb        = 1,     /*!< apb : apb                                                                 */
  BUSCTRL_PERFSEL2_PERFSEL2_fastperi_contested = 2,/*!< fastperi_contested : fastperi_contested                                */
  BUSCTRL_PERFSEL2_PERFSEL2_fastperi   = 3,     /*!< fastperi : fastperi                                                       */
  BUSCTRL_PERFSEL2_PERFSEL2_sram5_contested = 4,/*!< sram5_contested : sram5_contested                                         */
  BUSCTRL_PERFSEL2_PERFSEL2_sram5      = 5,     /*!< sram5 : sram5                                                             */
  BUSCTRL_PERFSEL2_PERFSEL2_sram4_contested = 6,/*!< sram4_contested : sram4_contested                                         */
  BUSCTRL_PERFSEL2_PERFSEL2_sram4      = 7,     /*!< sram4 : sram4                                                             */
  BUSCTRL_PERFSEL2_PERFSEL2_sram3_contested = 8,/*!< sram3_contested : sram3_contested                                         */
  BUSCTRL_PERFSEL2_PERFSEL2_sram3      = 9,     /*!< sram3 : sram3                                                             */
  BUSCTRL_PERFSEL2_PERFSEL2_sram2_contested = 10,/*!< sram2_contested : sram2_contested                                        */
  BUSCTRL_PERFSEL2_PERFSEL2_sram2      = 11,    /*!< sram2 : sram2                                                             */
  BUSCTRL_PERFSEL2_PERFSEL2_sram1_contested = 12,/*!< sram1_contested : sram1_contested                                        */
  BUSCTRL_PERFSEL2_PERFSEL2_sram1      = 13,    /*!< sram1 : sram1                                                             */
  BUSCTRL_PERFSEL2_PERFSEL2_sram0_contested = 14,/*!< sram0_contested : sram0_contested                                        */
  BUSCTRL_PERFSEL2_PERFSEL2_sram0      = 15,    /*!< sram0 : sram0                                                             */
  BUSCTRL_PERFSEL2_PERFSEL2_xip_main_contested = 16,/*!< xip_main_contested : xip_main_contested                               */
  BUSCTRL_PERFSEL2_PERFSEL2_xip_main   = 17,    /*!< xip_main : xip_main                                                       */
  BUSCTRL_PERFSEL2_PERFSEL2_rom_contested = 18, /*!< rom_contested : rom_contested                                             */
  BUSCTRL_PERFSEL2_PERFSEL2_rom        = 19,    /*!< rom : rom                                                                 */
} BUSCTRL_PERFSEL2_PERFSEL2_Enum;

/* =======================================================  PERFCTR3  ======================================================== */
/* =======================================================  PERFSEL3  ======================================================== */
/* ===========================================  BUSCTRL PERFSEL3 PERFSEL3 [0..4]  ============================================ */
typedef enum {                                  /*!< BUSCTRL_PERFSEL3_PERFSEL3                                                 */
  BUSCTRL_PERFSEL3_PERFSEL3_apb_contested = 0,  /*!< apb_contested : apb_contested                                             */
  BUSCTRL_PERFSEL3_PERFSEL3_apb        = 1,     /*!< apb : apb                                                                 */
  BUSCTRL_PERFSEL3_PERFSEL3_fastperi_contested = 2,/*!< fastperi_contested : fastperi_contested                                */
  BUSCTRL_PERFSEL3_PERFSEL3_fastperi   = 3,     /*!< fastperi : fastperi                                                       */
  BUSCTRL_PERFSEL3_PERFSEL3_sram5_contested = 4,/*!< sram5_contested : sram5_contested                                         */
  BUSCTRL_PERFSEL3_PERFSEL3_sram5      = 5,     /*!< sram5 : sram5                                                             */
  BUSCTRL_PERFSEL3_PERFSEL3_sram4_contested = 6,/*!< sram4_contested : sram4_contested                                         */
  BUSCTRL_PERFSEL3_PERFSEL3_sram4      = 7,     /*!< sram4 : sram4                                                             */
  BUSCTRL_PERFSEL3_PERFSEL3_sram3_contested = 8,/*!< sram3_contested : sram3_contested                                         */
  BUSCTRL_PERFSEL3_PERFSEL3_sram3      = 9,     /*!< sram3 : sram3                                                             */
  BUSCTRL_PERFSEL3_PERFSEL3_sram2_contested = 10,/*!< sram2_contested : sram2_contested                                        */
  BUSCTRL_PERFSEL3_PERFSEL3_sram2      = 11,    /*!< sram2 : sram2                                                             */
  BUSCTRL_PERFSEL3_PERFSEL3_sram1_contested = 12,/*!< sram1_contested : sram1_contested                                        */
  BUSCTRL_PERFSEL3_PERFSEL3_sram1      = 13,    /*!< sram1 : sram1                                                             */
  BUSCTRL_PERFSEL3_PERFSEL3_sram0_contested = 14,/*!< sram0_contested : sram0_contested                                        */
  BUSCTRL_PERFSEL3_PERFSEL3_sram0      = 15,    /*!< sram0 : sram0                                                             */
  BUSCTRL_PERFSEL3_PERFSEL3_xip_main_contested = 16,/*!< xip_main_contested : xip_main_contested                               */
  BUSCTRL_PERFSEL3_PERFSEL3_xip_main   = 17,    /*!< xip_main : xip_main                                                       */
  BUSCTRL_PERFSEL3_PERFSEL3_rom_contested = 18, /*!< rom_contested : rom_contested                                             */
  BUSCTRL_PERFSEL3_PERFSEL3_rom        = 19,    /*!< rom : rom                                                                 */
} BUSCTRL_PERFSEL3_PERFSEL3_Enum;



/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  UARTDR  ========================================================= */
/* ========================================================  UARTRSR  ======================================================== */
/* ========================================================  UARTFR  ========================================================= */
/* =======================================================  UARTILPR  ======================================================== */
/* =======================================================  UARTIBRD  ======================================================== */
/* =======================================================  UARTFBRD  ======================================================== */
/* =======================================================  UARTLCR_H  ======================================================= */
/* ========================================================  UARTCR  ========================================================= */
/* =======================================================  UARTIFLS  ======================================================== */
/* =======================================================  UARTIMSC  ======================================================== */
/* ========================================================  UARTRIS  ======================================================== */
/* ========================================================  UARTMIS  ======================================================== */
/* ========================================================  UARTICR  ======================================================== */
/* =======================================================  UARTDMACR  ======================================================= */
/* =====================================================  UARTPERIPHID0  ===================================================== */
/* =====================================================  UARTPERIPHID1  ===================================================== */
/* =====================================================  UARTPERIPHID2  ===================================================== */
/* =====================================================  UARTPERIPHID3  ===================================================== */
/* =====================================================  UARTPCELLID0  ====================================================== */
/* =====================================================  UARTPCELLID1  ====================================================== */
/* =====================================================  UARTPCELLID2  ====================================================== */
/* =====================================================  UARTPCELLID3  ====================================================== */


/* =========================================================================================================================== */
/* ================                                           SPI0                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  SSPCR0  ========================================================= */
/* ========================================================  SSPCR1  ========================================================= */
/* =========================================================  SSPDR  ========================================================= */
/* =========================================================  SSPSR  ========================================================= */
/* ========================================================  SSPCPSR  ======================================================== */
/* ========================================================  SSPIMSC  ======================================================== */
/* ========================================================  SSPRIS  ========================================================= */
/* ========================================================  SSPMIS  ========================================================= */
/* ========================================================  SSPICR  ========================================================= */
/* =======================================================  SSPDMACR  ======================================================== */
/* =====================================================  SSPPERIPHID0  ====================================================== */
/* =====================================================  SSPPERIPHID1  ====================================================== */
/* =====================================================  SSPPERIPHID2  ====================================================== */
/* =====================================================  SSPPERIPHID3  ====================================================== */
/* ======================================================  SSPPCELLID0  ====================================================== */
/* ======================================================  SSPPCELLID1  ====================================================== */
/* ======================================================  SSPPCELLID2  ====================================================== */
/* ======================================================  SSPPCELLID3  ====================================================== */


/* =========================================================================================================================== */
/* ================                                           I2C0                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  IC_CON  ========================================================= */
/* =======================================  I2C0 IC_CON RX_FIFO_FULL_HLD_CTRL [9..9]  ======================================== */
typedef enum {                                  /*!< I2C0_IC_CON_RX_FIFO_FULL_HLD_CTRL                                         */
  I2C0_IC_CON_RX_FIFO_FULL_HLD_CTRL_DISABLED = 0,/*!< DISABLED : Overflow when RX_FIFO is full                                 */
  I2C0_IC_CON_RX_FIFO_FULL_HLD_CTRL_ENABLED = 1,/*!< ENABLED : Hold bus when RX_FIFO is full                                   */
} I2C0_IC_CON_RX_FIFO_FULL_HLD_CTRL_Enum;

