mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ===========================================  I2C0 IC_CON TX_EMPTY_CTRL [8..8]  ============================================ */
typedef enum {                                  /*!< I2C0_IC_CON_TX_EMPTY_CTRL                                                 */
  I2C0_IC_CON_TX_EMPTY_CTRL_DISABLED   = 0,     /*!< DISABLED : Default behaviour of TX_EMPTY interrupt                        */
  I2C0_IC_CON_TX_EMPTY_CTRL_ENABLED    = 1,     /*!< ENABLED : Controlled generation of TX_EMPTY interrupt                     */
} I2C0_IC_CON_TX_EMPTY_CTRL_Enum;

/* ========================================  I2C0 IC_CON STOP_DET_IFADDRESSED [7..7]  ======================================== */
typedef enum {                                  /*!< I2C0_IC_CON_STOP_DET_IFADDRESSED                                          */
  I2C0_IC_CON_STOP_DET_IFADDRESSED_DISABLED = 0,/*!< DISABLED : slave issues STOP_DET intr always                              */
  I2C0_IC_CON_STOP_DET_IFADDRESSED_ENABLED = 1, /*!< ENABLED : slave issues STOP_DET intr only if addressed                    */
} I2C0_IC_CON_STOP_DET_IFADDRESSED_Enum;

/* ==========================================  I2C0 IC_CON IC_SLAVE_DISABLE [6..6]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_CON_IC_SLAVE_DISABLE                                              */
  I2C0_IC_CON_IC_SLAVE_DISABLE_SLAVE_ENABLED = 0,/*!< SLAVE_ENABLED : Slave mode is enabled                                    */
  I2C0_IC_CON_IC_SLAVE_DISABLE_SLAVE_DISABLED = 1,/*!< SLAVE_DISABLED : Slave mode is disabled                                 */
} I2C0_IC_CON_IC_SLAVE_DISABLE_Enum;

/* ===========================================  I2C0 IC_CON IC_RESTART_EN [5..5]  ============================================ */
typedef enum {                                  /*!< I2C0_IC_CON_IC_RESTART_EN                                                 */
  I2C0_IC_CON_IC_RESTART_EN_DISABLED   = 0,     /*!< DISABLED : Master restart disabled                                        */
  I2C0_IC_CON_IC_RESTART_EN_ENABLED    = 1,     /*!< ENABLED : Master restart enabled                                          */
} I2C0_IC_CON_IC_RESTART_EN_Enum;

/* ========================================  I2C0 IC_CON IC_10BITADDR_MASTER [4..4]  ========================================= */
typedef enum {                                  /*!< I2C0_IC_CON_IC_10BITADDR_MASTER                                           */
  I2C0_IC_CON_IC_10BITADDR_MASTER_ADDR_7BITS = 0,/*!< ADDR_7BITS : Master 7Bit addressing mode                                 */
  I2C0_IC_CON_IC_10BITADDR_MASTER_ADDR_10BITS = 1,/*!< ADDR_10BITS : Master 10Bit addressing mode                              */
} I2C0_IC_CON_IC_10BITADDR_MASTER_Enum;

/* =========================================  I2C0 IC_CON IC_10BITADDR_SLAVE [3..3]  ========================================= */
typedef enum {                                  /*!< I2C0_IC_CON_IC_10BITADDR_SLAVE                                            */
  I2C0_IC_CON_IC_10BITADDR_SLAVE_ADDR_7BITS = 0,/*!< ADDR_7BITS : Slave 7Bit addressing                                        */
  I2C0_IC_CON_IC_10BITADDR_SLAVE_ADDR_10BITS = 1,/*!< ADDR_10BITS : Slave 10Bit addressing                                     */
} I2C0_IC_CON_IC_10BITADDR_SLAVE_Enum;

/* ===============================================  I2C0 IC_CON SPEED [1..2]  ================================================ */
typedef enum {                                  /*!< I2C0_IC_CON_SPEED                                                         */
  I2C0_IC_CON_SPEED_STANDARD           = 1,     /*!< STANDARD : Standard Speed mode of operation                               */
  I2C0_IC_CON_SPEED_FAST               = 2,     /*!< FAST : Fast or Fast Plus mode of operation                                */
  I2C0_IC_CON_SPEED_HIGH               = 3,     /*!< HIGH : High Speed mode of operation                                       */
} I2C0_IC_CON_SPEED_Enum;

/* ============================================  I2C0 IC_CON MASTER_MODE [0..0]  ============================================= */
typedef enum {                                  /*!< I2C0_IC_CON_MASTER_MODE                                                   */
  I2C0_IC_CON_MASTER_MODE_DISABLED     = 0,     /*!< DISABLED : Master mode is disabled                                        */
  I2C0_IC_CON_MASTER_MODE_ENABLED      = 1,     /*!< ENABLED : Master mode is enabled                                          */
} I2C0_IC_CON_MASTER_MODE_Enum;

/* ========================================================  IC_TAR  ========================================================= */
/* =============================================  I2C0 IC_TAR SPECIAL [11..11]  ============================================== */
typedef enum {                                  /*!< I2C0_IC_TAR_SPECIAL                                                       */
  I2C0_IC_TAR_SPECIAL_DISABLED         = 0,     /*!< DISABLED : Disables programming of GENERAL_CALL or START_BYTE
                                                     transmission                                                              */
  I2C0_IC_TAR_SPECIAL_ENABLED          = 1,     /*!< ENABLED : Enables programming of GENERAL_CALL or START_BYTE
                                                     transmission                                                              */
} I2C0_IC_TAR_SPECIAL_Enum;

/* ===========================================  I2C0 IC_TAR GC_OR_START [10..10]  ============================================ */
typedef enum {                                  /*!< I2C0_IC_TAR_GC_OR_START                                                   */
  I2C0_IC_TAR_GC_OR_START_GENERAL_CALL = 0,     /*!< GENERAL_CALL : GENERAL_CALL byte transmission                             */
  I2C0_IC_TAR_GC_OR_START_START_BYTE   = 1,     /*!< START_BYTE : START byte transmission                                      */
} I2C0_IC_TAR_GC_OR_START_Enum;

/* ========================================================  IC_SAR  ========================================================= */
/* ======================================================  IC_DATA_CMD  ====================================================== */
/* =======================================  I2C0 IC_DATA_CMD FIRST_DATA_BYTE [11..11]  ======================================= */
typedef enum {                                  /*!< I2C0_IC_DATA_CMD_FIRST_DATA_BYTE                                          */
  I2C0_IC_DATA_CMD_FIRST_DATA_BYTE_INACTIVE = 0,/*!< INACTIVE : Sequential data byte received                                  */
  I2C0_IC_DATA_CMD_FIRST_DATA_BYTE_ACTIVE = 1,  /*!< ACTIVE : Non sequential data byte received                                */
} I2C0_IC_DATA_CMD_FIRST_DATA_BYTE_Enum;

/* ===========================================  I2C0 IC_DATA_CMD RESTART [10..10]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_DATA_CMD_RESTART                                                  */
  I2C0_IC_DATA_CMD_RESTART_DISABLE     = 0,     /*!< DISABLE : Don't Issue RESTART before this command                         */
  I2C0_IC_DATA_CMD_RESTART_ENABLE      = 1,     /*!< ENABLE : Issue RESTART before this command                                */
} I2C0_IC_DATA_CMD_RESTART_Enum;

/* =============================================  I2C0 IC_DATA_CMD STOP [9..9]  ============================================== */
typedef enum {                                  /*!< I2C0_IC_DATA_CMD_STOP                                                     */
  I2C0_IC_DATA_CMD_STOP_DISABLE        = 0,     /*!< DISABLE : Don't Issue STOP after this command                             */
  I2C0_IC_DATA_CMD_STOP_ENABLE         = 1,     /*!< ENABLE : Issue STOP after this command                                    */
} I2C0_IC_DATA_CMD_STOP_Enum;

/* ==============================================  I2C0 IC_DATA_CMD CMD [8..8]  ============================================== */
typedef enum {                                  /*!< I2C0_IC_DATA_CMD_CMD                                                      */
  I2C0_IC_DATA_CMD_CMD_WRITE           = 0,     /*!< WRITE : Master Write Command                                              */
  I2C0_IC_DATA_CMD_CMD_READ            = 1,     /*!< READ : Master Read Command                                                */
} I2C0_IC_DATA_CMD_CMD_Enum;

/* ====================================================  IC_SS_SCL_HCNT  ===================================================== */
/* ====================================================  IC_SS_SCL_LCNT  ===================================================== */
/* ====================================================  IC_FS_SCL_HCNT  ===================================================== */
/* ====================================================  IC_FS_SCL_LCNT  ===================================================== */
/* =====================================================  IC_INTR_STAT  ====================================================== */
/* =======================================  I2C0 IC_INTR_STAT R_RESTART_DET [12..12]  ======================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_RESTART_DET                                           */
  I2C0_IC_INTR_STAT_R_RESTART_DET_INACTIVE = 0, /*!< INACTIVE : R_RESTART_DET interrupt is inactive                            */
  I2C0_IC_INTR_STAT_R_RESTART_DET_ACTIVE = 1,   /*!< ACTIVE : R_RESTART_DET interrupt is active                                */
} I2C0_IC_INTR_STAT_R_RESTART_DET_Enum;

/* =========================================  I2C0 IC_INTR_STAT R_GEN_CALL [11..11]  ========================================= */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_GEN_CALL                                              */
  I2C0_IC_INTR_STAT_R_GEN_CALL_INACTIVE = 0,    /*!< INACTIVE : R_GEN_CALL interrupt is inactive                               */
  I2C0_IC_INTR_STAT_R_GEN_CALL_ACTIVE  = 1,     /*!< ACTIVE : R_GEN_CALL interrupt is active                                   */
} I2C0_IC_INTR_STAT_R_GEN_CALL_Enum;

/* ========================================  I2C0 IC_INTR_STAT R_START_DET [10..10]  ========================================= */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_START_DET                                             */
  I2C0_IC_INTR_STAT_R_START_DET_INACTIVE = 0,   /*!< INACTIVE : R_START_DET interrupt is inactive                              */
  I2C0_IC_INTR_STAT_R_START_DET_ACTIVE = 1,     /*!< ACTIVE : R_START_DET interrupt is active                                  */
} I2C0_IC_INTR_STAT_R_START_DET_Enum;

