mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ==========================================  I2C0 IC_INTR_STAT R_STOP_DET [9..9]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_STOP_DET                                              */
  I2C0_IC_INTR_STAT_R_STOP_DET_INACTIVE = 0,    /*!< INACTIVE : R_STOP_DET interrupt is inactive                               */
  I2C0_IC_INTR_STAT_R_STOP_DET_ACTIVE  = 1,     /*!< ACTIVE : R_STOP_DET interrupt is active                                   */
} I2C0_IC_INTR_STAT_R_STOP_DET_Enum;

/* ==========================================  I2C0 IC_INTR_STAT R_ACTIVITY [8..8]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_ACTIVITY                                              */
  I2C0_IC_INTR_STAT_R_ACTIVITY_INACTIVE = 0,    /*!< INACTIVE : R_ACTIVITY interrupt is inactive                               */
  I2C0_IC_INTR_STAT_R_ACTIVITY_ACTIVE  = 1,     /*!< ACTIVE : R_ACTIVITY interrupt is active                                   */
} I2C0_IC_INTR_STAT_R_ACTIVITY_Enum;

/* ==========================================  I2C0 IC_INTR_STAT R_RX_DONE [7..7]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_RX_DONE                                               */
  I2C0_IC_INTR_STAT_R_RX_DONE_INACTIVE = 0,     /*!< INACTIVE : R_RX_DONE interrupt is inactive                                */
  I2C0_IC_INTR_STAT_R_RX_DONE_ACTIVE   = 1,     /*!< ACTIVE : R_RX_DONE interrupt is active                                    */
} I2C0_IC_INTR_STAT_R_RX_DONE_Enum;

/* ==========================================  I2C0 IC_INTR_STAT R_TX_ABRT [6..6]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_TX_ABRT                                               */
  I2C0_IC_INTR_STAT_R_TX_ABRT_INACTIVE = 0,     /*!< INACTIVE : R_TX_ABRT interrupt is inactive                                */
  I2C0_IC_INTR_STAT_R_TX_ABRT_ACTIVE   = 1,     /*!< ACTIVE : R_TX_ABRT interrupt is active                                    */
} I2C0_IC_INTR_STAT_R_TX_ABRT_Enum;

/* ===========================================  I2C0 IC_INTR_STAT R_RD_REQ [5..5]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_RD_REQ                                                */
  I2C0_IC_INTR_STAT_R_RD_REQ_INACTIVE  = 0,     /*!< INACTIVE : R_RD_REQ interrupt is inactive                                 */
  I2C0_IC_INTR_STAT_R_RD_REQ_ACTIVE    = 1,     /*!< ACTIVE : R_RD_REQ interrupt is active                                     */
} I2C0_IC_INTR_STAT_R_RD_REQ_Enum;

/* ==========================================  I2C0 IC_INTR_STAT R_TX_EMPTY [4..4]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_TX_EMPTY                                              */
  I2C0_IC_INTR_STAT_R_TX_EMPTY_INACTIVE = 0,    /*!< INACTIVE : R_TX_EMPTY interrupt is inactive                               */
  I2C0_IC_INTR_STAT_R_TX_EMPTY_ACTIVE  = 1,     /*!< ACTIVE : R_TX_EMPTY interrupt is active                                   */
} I2C0_IC_INTR_STAT_R_TX_EMPTY_Enum;

/* ==========================================  I2C0 IC_INTR_STAT R_TX_OVER [3..3]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_TX_OVER                                               */
  I2C0_IC_INTR_STAT_R_TX_OVER_INACTIVE = 0,     /*!< INACTIVE : R_TX_OVER interrupt is inactive                                */
  I2C0_IC_INTR_STAT_R_TX_OVER_ACTIVE   = 1,     /*!< ACTIVE : R_TX_OVER interrupt is active                                    */
} I2C0_IC_INTR_STAT_R_TX_OVER_Enum;

/* ==========================================  I2C0 IC_INTR_STAT R_RX_FULL [2..2]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_RX_FULL                                               */
  I2C0_IC_INTR_STAT_R_RX_FULL_INACTIVE = 0,     /*!< INACTIVE : R_RX_FULL interrupt is inactive                                */
  I2C0_IC_INTR_STAT_R_RX_FULL_ACTIVE   = 1,     /*!< ACTIVE : R_RX_FULL interrupt is active                                    */
} I2C0_IC_INTR_STAT_R_RX_FULL_Enum;

/* ==========================================  I2C0 IC_INTR_STAT R_RX_OVER [1..1]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_RX_OVER                                               */
  I2C0_IC_INTR_STAT_R_RX_OVER_INACTIVE = 0,     /*!< INACTIVE : R_RX_OVER interrupt is inactive                                */
  I2C0_IC_INTR_STAT_R_RX_OVER_ACTIVE   = 1,     /*!< ACTIVE : R_RX_OVER interrupt is active                                    */
} I2C0_IC_INTR_STAT_R_RX_OVER_Enum;

/* ==========================================  I2C0 IC_INTR_STAT R_RX_UNDER [0..0]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_STAT_R_RX_UNDER                                              */
  I2C0_IC_INTR_STAT_R_RX_UNDER_INACTIVE = 0,    /*!< INACTIVE : RX_UNDER interrupt is inactive                                 */
  I2C0_IC_INTR_STAT_R_RX_UNDER_ACTIVE  = 1,     /*!< ACTIVE : RX_UNDER interrupt is active                                     */
} I2C0_IC_INTR_STAT_R_RX_UNDER_Enum;

/* =====================================================  IC_INTR_MASK  ====================================================== */
/* =======================================  I2C0 IC_INTR_MASK M_RESTART_DET [12..12]  ======================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_RESTART_DET                                           */
  I2C0_IC_INTR_MASK_M_RESTART_DET_ENABLED = 0,  /*!< ENABLED : RESTART_DET interrupt is masked                                 */
  I2C0_IC_INTR_MASK_M_RESTART_DET_DISABLED = 1, /*!< DISABLED : RESTART_DET interrupt is unmasked                              */
} I2C0_IC_INTR_MASK_M_RESTART_DET_Enum;

/* =========================================  I2C0 IC_INTR_MASK M_GEN_CALL [11..11]  ========================================= */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_GEN_CALL                                              */
  I2C0_IC_INTR_MASK_M_GEN_CALL_ENABLED = 0,     /*!< ENABLED : GEN_CALL interrupt is masked                                    */
  I2C0_IC_INTR_MASK_M_GEN_CALL_DISABLED = 1,    /*!< DISABLED : GEN_CALL interrupt is unmasked                                 */
} I2C0_IC_INTR_MASK_M_GEN_CALL_Enum;

/* ========================================  I2C0 IC_INTR_MASK M_START_DET [10..10]  ========================================= */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_START_DET                                             */
  I2C0_IC_INTR_MASK_M_START_DET_ENABLED = 0,    /*!< ENABLED : START_DET interrupt is masked                                   */
  I2C0_IC_INTR_MASK_M_START_DET_DISABLED = 1,   /*!< DISABLED : START_DET interrupt is unmasked                                */
} I2C0_IC_INTR_MASK_M_START_DET_Enum;

/* ==========================================  I2C0 IC_INTR_MASK M_STOP_DET [9..9]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_STOP_DET                                              */
  I2C0_IC_INTR_MASK_M_STOP_DET_ENABLED = 0,     /*!< ENABLED : STOP_DET interrupt is masked                                    */
  I2C0_IC_INTR_MASK_M_STOP_DET_DISABLED = 1,    /*!< DISABLED : STOP_DET interrupt is unmasked                                 */
} I2C0_IC_INTR_MASK_M_STOP_DET_Enum;

/* ==========================================  I2C0 IC_INTR_MASK M_ACTIVITY [8..8]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_ACTIVITY                                              */
  I2C0_IC_INTR_MASK_M_ACTIVITY_ENABLED = 0,     /*!< ENABLED : ACTIVITY interrupt is masked                                    */
  I2C0_IC_INTR_MASK_M_ACTIVITY_DISABLED = 1,    /*!< DISABLED : ACTIVITY interrupt is unmasked                                 */
} I2C0_IC_INTR_MASK_M_ACTIVITY_Enum;

