mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ==========================================  I2C0 IC_INTR_MASK M_RX_DONE [7..7]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_RX_DONE                                               */
  I2C0_IC_INTR_MASK_M_RX_DONE_ENABLED  = 0,     /*!< ENABLED : RX_DONE interrupt is masked                                     */
  I2C0_IC_INTR_MASK_M_RX_DONE_DISABLED = 1,     /*!< DISABLED : RX_DONE interrupt is unmasked                                  */
} I2C0_IC_INTR_MASK_M_RX_DONE_Enum;

/* ==========================================  I2C0 IC_INTR_MASK M_TX_ABRT [6..6]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_TX_ABRT                                               */
  I2C0_IC_INTR_MASK_M_TX_ABRT_ENABLED  = 0,     /*!< ENABLED : TX_ABORT interrupt is masked                                    */
  I2C0_IC_INTR_MASK_M_TX_ABRT_DISABLED = 1,     /*!< DISABLED : TX_ABORT interrupt is unmasked                                 */
} I2C0_IC_INTR_MASK_M_TX_ABRT_Enum;

/* ===========================================  I2C0 IC_INTR_MASK M_RD_REQ [5..5]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_RD_REQ                                                */
  I2C0_IC_INTR_MASK_M_RD_REQ_ENABLED   = 0,     /*!< ENABLED : RD_REQ interrupt is masked                                      */
  I2C0_IC_INTR_MASK_M_RD_REQ_DISABLED  = 1,     /*!< DISABLED : RD_REQ interrupt is unmasked                                   */
} I2C0_IC_INTR_MASK_M_RD_REQ_Enum;

/* ==========================================  I2C0 IC_INTR_MASK M_TX_EMPTY [4..4]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_TX_EMPTY                                              */
  I2C0_IC_INTR_MASK_M_TX_EMPTY_ENABLED = 0,     /*!< ENABLED : TX_EMPTY interrupt is masked                                    */
  I2C0_IC_INTR_MASK_M_TX_EMPTY_DISABLED = 1,    /*!< DISABLED : TX_EMPTY interrupt is unmasked                                 */
} I2C0_IC_INTR_MASK_M_TX_EMPTY_Enum;

/* ==========================================  I2C0 IC_INTR_MASK M_TX_OVER [3..3]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_TX_OVER                                               */
  I2C0_IC_INTR_MASK_M_TX_OVER_ENABLED  = 0,     /*!< ENABLED : TX_OVER interrupt is masked                                     */
  I2C0_IC_INTR_MASK_M_TX_OVER_DISABLED = 1,     /*!< DISABLED : TX_OVER interrupt is unmasked                                  */
} I2C0_IC_INTR_MASK_M_TX_OVER_Enum;

/* ==========================================  I2C0 IC_INTR_MASK M_RX_FULL [2..2]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_RX_FULL                                               */
  I2C0_IC_INTR_MASK_M_RX_FULL_ENABLED  = 0,     /*!< ENABLED : RX_FULL interrupt is masked                                     */
  I2C0_IC_INTR_MASK_M_RX_FULL_DISABLED = 1,     /*!< DISABLED : RX_FULL interrupt is unmasked                                  */
} I2C0_IC_INTR_MASK_M_RX_FULL_Enum;

/* ==========================================  I2C0 IC_INTR_MASK M_RX_OVER [1..1]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_RX_OVER                                               */
  I2C0_IC_INTR_MASK_M_RX_OVER_ENABLED  = 0,     /*!< ENABLED : RX_OVER interrupt is masked                                     */
  I2C0_IC_INTR_MASK_M_RX_OVER_DISABLED = 1,     /*!< DISABLED : RX_OVER interrupt is unmasked                                  */
} I2C0_IC_INTR_MASK_M_RX_OVER_Enum;

/* ==========================================  I2C0 IC_INTR_MASK M_RX_UNDER [0..0]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_INTR_MASK_M_RX_UNDER                                              */
  I2C0_IC_INTR_MASK_M_RX_UNDER_ENABLED = 0,     /*!< ENABLED : RX_UNDER interrupt is masked                                    */
  I2C0_IC_INTR_MASK_M_RX_UNDER_DISABLED = 1,    /*!< DISABLED : RX_UNDER interrupt is unmasked                                 */
} I2C0_IC_INTR_MASK_M_RX_UNDER_Enum;

/* ===================================================  IC_RAW_INTR_STAT  ==================================================== */
/* ======================================  I2C0 IC_RAW_INTR_STAT RESTART_DET [12..12]  ======================================= */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_RESTART_DET                                         */
  I2C0_IC_RAW_INTR_STAT_RESTART_DET_INACTIVE = 0,/*!< INACTIVE : RESTART_DET interrupt is inactive                             */
  I2C0_IC_RAW_INTR_STAT_RESTART_DET_ACTIVE = 1, /*!< ACTIVE : RESTART_DET interrupt is active                                  */
} I2C0_IC_RAW_INTR_STAT_RESTART_DET_Enum;

/* ========================================  I2C0 IC_RAW_INTR_STAT GEN_CALL [11..11]  ======================================== */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_GEN_CALL                                            */
  I2C0_IC_RAW_INTR_STAT_GEN_CALL_INACTIVE = 0,  /*!< INACTIVE : GEN_CALL interrupt is inactive                                 */
  I2C0_IC_RAW_INTR_STAT_GEN_CALL_ACTIVE = 1,    /*!< ACTIVE : GEN_CALL interrupt is active                                     */
} I2C0_IC_RAW_INTR_STAT_GEN_CALL_Enum;

/* =======================================  I2C0 IC_RAW_INTR_STAT START_DET [10..10]  ======================================== */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_START_DET                                           */
  I2C0_IC_RAW_INTR_STAT_START_DET_INACTIVE = 0, /*!< INACTIVE : START_DET interrupt is inactive                                */
  I2C0_IC_RAW_INTR_STAT_START_DET_ACTIVE = 1,   /*!< ACTIVE : START_DET interrupt is active                                    */
} I2C0_IC_RAW_INTR_STAT_START_DET_Enum;

