mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =========================================  I2C0 IC_RAW_INTR_STAT STOP_DET [9..9]  ========================================= */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_STOP_DET                                            */
  I2C0_IC_RAW_INTR_STAT_STOP_DET_INACTIVE = 0,  /*!< INACTIVE : STOP_DET interrupt is inactive                                 */
  I2C0_IC_RAW_INTR_STAT_STOP_DET_ACTIVE = 1,    /*!< ACTIVE : STOP_DET interrupt is active                                     */
} I2C0_IC_RAW_INTR_STAT_STOP_DET_Enum;

/* =========================================  I2C0 IC_RAW_INTR_STAT ACTIVITY [8..8]  ========================================= */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_ACTIVITY                                            */
  I2C0_IC_RAW_INTR_STAT_ACTIVITY_INACTIVE = 0,  /*!< INACTIVE : RAW_INTR_ACTIVITY interrupt is inactive                        */
  I2C0_IC_RAW_INTR_STAT_ACTIVITY_ACTIVE = 1,    /*!< ACTIVE : RAW_INTR_ACTIVITY interrupt is active                            */
} I2C0_IC_RAW_INTR_STAT_ACTIVITY_Enum;

/* =========================================  I2C0 IC_RAW_INTR_STAT RX_DONE [7..7]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_RX_DONE                                             */
  I2C0_IC_RAW_INTR_STAT_RX_DONE_INACTIVE = 0,   /*!< INACTIVE : RX_DONE interrupt is inactive                                  */
  I2C0_IC_RAW_INTR_STAT_RX_DONE_ACTIVE = 1,     /*!< ACTIVE : RX_DONE interrupt is active                                      */
} I2C0_IC_RAW_INTR_STAT_RX_DONE_Enum;

/* =========================================  I2C0 IC_RAW_INTR_STAT TX_ABRT [6..6]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_TX_ABRT                                             */
  I2C0_IC_RAW_INTR_STAT_TX_ABRT_INACTIVE = 0,   /*!< INACTIVE : TX_ABRT interrupt is inactive                                  */
  I2C0_IC_RAW_INTR_STAT_TX_ABRT_ACTIVE = 1,     /*!< ACTIVE : TX_ABRT interrupt is active                                      */
} I2C0_IC_RAW_INTR_STAT_TX_ABRT_Enum;

/* ==========================================  I2C0 IC_RAW_INTR_STAT RD_REQ [5..5]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_RD_REQ                                              */
  I2C0_IC_RAW_INTR_STAT_RD_REQ_INACTIVE = 0,    /*!< INACTIVE : RD_REQ interrupt is inactive                                   */
  I2C0_IC_RAW_INTR_STAT_RD_REQ_ACTIVE  = 1,     /*!< ACTIVE : RD_REQ interrupt is active                                       */
} I2C0_IC_RAW_INTR_STAT_RD_REQ_Enum;

/* =========================================  I2C0 IC_RAW_INTR_STAT TX_EMPTY [4..4]  ========================================= */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_TX_EMPTY                                            */
  I2C0_IC_RAW_INTR_STAT_TX_EMPTY_INACTIVE = 0,  /*!< INACTIVE : TX_EMPTY interrupt is inactive                                 */
  I2C0_IC_RAW_INTR_STAT_TX_EMPTY_ACTIVE = 1,    /*!< ACTIVE : TX_EMPTY interrupt is active                                     */
} I2C0_IC_RAW_INTR_STAT_TX_EMPTY_Enum;

/* =========================================  I2C0 IC_RAW_INTR_STAT TX_OVER [3..3]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_TX_OVER                                             */
  I2C0_IC_RAW_INTR_STAT_TX_OVER_INACTIVE = 0,   /*!< INACTIVE : TX_OVER interrupt is inactive                                  */
  I2C0_IC_RAW_INTR_STAT_TX_OVER_ACTIVE = 1,     /*!< ACTIVE : TX_OVER interrupt is active                                      */
} I2C0_IC_RAW_INTR_STAT_TX_OVER_Enum;

/* =========================================  I2C0 IC_RAW_INTR_STAT RX_FULL [2..2]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_RX_FULL                                             */
  I2C0_IC_RAW_INTR_STAT_RX_FULL_INACTIVE = 0,   /*!< INACTIVE : RX_FULL interrupt is inactive                                  */
  I2C0_IC_RAW_INTR_STAT_RX_FULL_ACTIVE = 1,     /*!< ACTIVE : RX_FULL interrupt is active                                      */
} I2C0_IC_RAW_INTR_STAT_RX_FULL_Enum;

/* =========================================  I2C0 IC_RAW_INTR_STAT RX_OVER [1..1]  ========================================== */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_RX_OVER                                             */
  I2C0_IC_RAW_INTR_STAT_RX_OVER_INACTIVE = 0,   /*!< INACTIVE : RX_OVER interrupt is inactive                                  */
  I2C0_IC_RAW_INTR_STAT_RX_OVER_ACTIVE = 1,     /*!< ACTIVE : RX_OVER interrupt is active                                      */
} I2C0_IC_RAW_INTR_STAT_RX_OVER_Enum;

/* =========================================  I2C0 IC_RAW_INTR_STAT RX_UNDER [0..0]  ========================================= */
typedef enum {                                  /*!< I2C0_IC_RAW_INTR_STAT_RX_UNDER                                            */
  I2C0_IC_RAW_INTR_STAT_RX_UNDER_INACTIVE = 0,  /*!< INACTIVE : RX_UNDER interrupt is inactive                                 */
  I2C0_IC_RAW_INTR_STAT_RX_UNDER_ACTIVE = 1,    /*!< ACTIVE : RX_UNDER interrupt is active                                     */
} I2C0_IC_RAW_INTR_STAT_RX_UNDER_Enum;

/* =======================================================  IC_RX_TL  ======================================================== */
/* =======================================================  IC_TX_TL  ======================================================== */
/* ======================================================  IC_CLR_INTR  ====================================================== */
/* ====================================================  IC_CLR_RX_UNDER  ==================================================== */
/* ====================================================  IC_CLR_RX_OVER  ===================================================== */
/* ====================================================  IC_CLR_TX_OVER  ===================================================== */
/* =====================================================  IC_CLR_RD_REQ  ===================================================== */
/* ====================================================  IC_CLR_TX_ABRT  ===================================================== */
/* ====================================================  IC_CLR_RX_DONE  ===================================================== */
/* ====================================================  IC_CLR_ACTIVITY  ==================================================== */
/* ====================================================  IC_CLR_STOP_DET  ==================================================== */
/* ===================================================  IC_CLR_START_DET  ==================================================== */
/* ====================================================  IC_CLR_GEN_CALL  ==================================================== */
/* =======================================================  IC_ENABLE  ======================================================= */
/* ==========================================  I2C0 IC_ENABLE TX_CMD_BLOCK [2..2]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_ENABLE_TX_CMD_BLOCK                                               */
  I2C0_IC_ENABLE_TX_CMD_BLOCK_NOT_BLOCKED = 0,  /*!< NOT_BLOCKED : Tx Command execution not blocked                            */
  I2C0_IC_ENABLE_TX_CMD_BLOCK_BLOCKED  = 1,     /*!< BLOCKED : Tx Command execution blocked                                    */
} I2C0_IC_ENABLE_TX_CMD_BLOCK_Enum;

/* ==============================================  I2C0 IC_ENABLE ABORT [1..1]  ============================================== */
typedef enum {                                  /*!< I2C0_IC_ENABLE_ABORT                                                      */
  I2C0_IC_ENABLE_ABORT_DISABLE         = 0,     /*!< DISABLE : ABORT operation not in progress                                 */
  I2C0_IC_ENABLE_ABORT_ENABLED         = 1,     /*!< ENABLED : ABORT operation in progress                                     */
} I2C0_IC_ENABLE_ABORT_Enum;

