mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =============================================  I2C0 IC_ENABLE ENABLE [0..0]  ============================================== */
typedef enum {                                  /*!< I2C0_IC_ENABLE_ENABLE                                                     */
  I2C0_IC_ENABLE_ENABLE_DISABLED       = 0,     /*!< DISABLED : I2C is disabled                                                */
  I2C0_IC_ENABLE_ENABLE_ENABLED        = 1,     /*!< ENABLED : I2C is enabled                                                  */
} I2C0_IC_ENABLE_ENABLE_Enum;

/* =======================================================  IC_STATUS  ======================================================= */
/* ==========================================  I2C0 IC_STATUS SLV_ACTIVITY [6..6]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_STATUS_SLV_ACTIVITY                                               */
  I2C0_IC_STATUS_SLV_ACTIVITY_IDLE     = 0,     /*!< IDLE : Slave is idle                                                      */
  I2C0_IC_STATUS_SLV_ACTIVITY_ACTIVE   = 1,     /*!< ACTIVE : Slave not idle                                                   */
} I2C0_IC_STATUS_SLV_ACTIVITY_Enum;

/* ==========================================  I2C0 IC_STATUS MST_ACTIVITY [5..5]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_STATUS_MST_ACTIVITY                                               */
  I2C0_IC_STATUS_MST_ACTIVITY_IDLE     = 0,     /*!< IDLE : Master is idle                                                     */
  I2C0_IC_STATUS_MST_ACTIVITY_ACTIVE   = 1,     /*!< ACTIVE : Master not idle                                                  */
} I2C0_IC_STATUS_MST_ACTIVITY_Enum;

/* ===============================================  I2C0 IC_STATUS RFF [4..4]  =============================================== */
typedef enum {                                  /*!< I2C0_IC_STATUS_RFF                                                        */
  I2C0_IC_STATUS_RFF_NOT_FULL          = 0,     /*!< NOT_FULL : Rx FIFO not full                                               */
  I2C0_IC_STATUS_RFF_FULL              = 1,     /*!< FULL : Rx FIFO is full                                                    */
} I2C0_IC_STATUS_RFF_Enum;

/* ==============================================  I2C0 IC_STATUS RFNE [3..3]  =============================================== */
typedef enum {                                  /*!< I2C0_IC_STATUS_RFNE                                                       */
  I2C0_IC_STATUS_RFNE_EMPTY            = 0,     /*!< EMPTY : Rx FIFO is empty                                                  */
  I2C0_IC_STATUS_RFNE_NOT_EMPTY        = 1,     /*!< NOT_EMPTY : Rx FIFO not empty                                             */
} I2C0_IC_STATUS_RFNE_Enum;

/* ===============================================  I2C0 IC_STATUS TFE [2..2]  =============================================== */
typedef enum {                                  /*!< I2C0_IC_STATUS_TFE                                                        */
  I2C0_IC_STATUS_TFE_NON_EMPTY         = 0,     /*!< NON_EMPTY : Tx FIFO not empty                                             */
  I2C0_IC_STATUS_TFE_EMPTY             = 1,     /*!< EMPTY : Tx FIFO is empty                                                  */
} I2C0_IC_STATUS_TFE_Enum;

/* ==============================================  I2C0 IC_STATUS TFNF [1..1]  =============================================== */
typedef enum {                                  /*!< I2C0_IC_STATUS_TFNF                                                       */
  I2C0_IC_STATUS_TFNF_FULL             = 0,     /*!< FULL : Tx FIFO is full                                                    */
  I2C0_IC_STATUS_TFNF_NOT_FULL         = 1,     /*!< NOT_FULL : Tx FIFO not full                                               */
} I2C0_IC_STATUS_TFNF_Enum;

/* ============================================  I2C0 IC_STATUS ACTIVITY [0..0]  ============================================= */
typedef enum {                                  /*!< I2C0_IC_STATUS_ACTIVITY                                                   */
  I2C0_IC_STATUS_ACTIVITY_INACTIVE     = 0,     /*!< INACTIVE : I2C is idle                                                    */
  I2C0_IC_STATUS_ACTIVITY_ACTIVE       = 1,     /*!< ACTIVE : I2C is active                                                    */
} I2C0_IC_STATUS_ACTIVITY_Enum;

/* =======================================================  IC_TXFLR  ======================================================== */
/* =======================================================  IC_RXFLR  ======================================================== */
/* ======================================================  IC_SDA_HOLD  ====================================================== */
/* ===================================================  IC_TX_ABRT_SOURCE  =================================================== */
/* ====================================  I2C0 IC_TX_ABRT_SOURCE ABRT_USER_ABRT [16..16]  ===================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT                                     */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_ABRT_USER_ABRT_VOID = 0,/*!< ABRT_USER_ABRT_VOID : Transfer abort detected by master- scenario
                                                     not present                                                               */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_ABRT_USER_ABRT_GENERATED = 1,/*!< ABRT_USER_ABRT_GENERATED : Transfer abort detected by master */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_Enum;

/* ====================================  I2C0 IC_TX_ABRT_SOURCE ABRT_SLVRD_INTX [15..15]  ==================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX                                    */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_ABRT_SLVRD_INTX_VOID = 0,/*!< ABRT_SLVRD_INTX_VOID : Slave trying to transmit to remote master
                                                     in read mode- scenario not present                                        */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_ABRT_SLVRD_INTX_GENERATED = 1,/*!< ABRT_SLVRD_INTX_GENERATED : Slave trying to transmit to remote
                                                     master in read mode                                                       */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_Enum;

/* ===================================  I2C0 IC_TX_ABRT_SOURCE ABRT_SLV_ARBLOST [14..14]  ==================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST                                   */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_ABRT_SLV_ARBLOST_VOID = 0,/*!< ABRT_SLV_ARBLOST_VOID : Slave lost arbitration to remote master-
                                                     scenario not present                                                      */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_ABRT_SLV_ARBLOST_GENERATED = 1,/*!< ABRT_SLV_ARBLOST_GENERATED : Slave lost arbitration to remote
                                                     master                                                                    */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_Enum;

/* =================================  I2C0 IC_TX_ABRT_SOURCE ABRT_SLVFLUSH_TXFIFO [13..13]  ================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO                               */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_ABRT_SLVFLUSH_TXFIFO_VOID = 0,/*!< ABRT_SLVFLUSH_TXFIFO_VOID : Slave flushes existing data in TX-FIFO
                                                     upon getting read command- scenario not present                           */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_ABRT_SLVFLUSH_TXFIFO_GENERATED = 1,/*!< ABRT_SLVFLUSH_TXFIFO_GENERATED : Slave flushes existing data
                                                     in TX-FIFO upon getting read command                                      */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_Enum;

/* =======================================  I2C0 IC_TX_ABRT_SOURCE ARB_LOST [12..12]  ======================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ARB_LOST                                           */
  I2C0_IC_TX_ABRT_SOURCE_ARB_LOST_ABRT_LOST_VOID = 0,/*!< ABRT_LOST_VOID : Master or Slave-Transmitter lost arbitration-
                                                     scenario not present                                                      */
  I2C0_IC_TX_ABRT_SOURCE_ARB_LOST_ABRT_LOST_GENERATED = 1,/*!< ABRT_LOST_GENERATED : Master or Slave-Transmitter lost arbitration */
} I2C0_IC_TX_ABRT_SOURCE_ARB_LOST_Enum;

/* ====================================  I2C0 IC_TX_ABRT_SOURCE ABRT_MASTER_DIS [11..11]  ==================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS                                    */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_ABRT_MASTER_DIS_VOID = 0,/*!< ABRT_MASTER_DIS_VOID : User initiating master operation when
                                                     MASTER disabled- scenario not present                                     */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_ABRT_MASTER_DIS_GENERATED = 1,/*!< ABRT_MASTER_DIS_GENERATED : User initiating master operation
                                                     when MASTER disabled                                                      */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_Enum;

/* ==================================  I2C0 IC_TX_ABRT_SOURCE ABRT_10B_RD_NORSTRT [10..10]  ================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT                                */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_ABRT_10B_RD_VOID = 0,/*!< ABRT_10B_RD_VOID : Master not trying to read in 10Bit addressing
                                                     mode when RESTART disabled                                                */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_ABRT_10B_RD_GENERATED = 1,/*!< ABRT_10B_RD_GENERATED : Master trying to read in 10Bit addressing
                                                     mode when RESTART disabled                                                */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_Enum;

/* ===================================  I2C0 IC_TX_ABRT_SOURCE ABRT_SBYTE_NORSTRT [9..9]  ==================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT                                 */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_ABRT_SBYTE_NORSTRT_VOID = 0,/*!< ABRT_SBYTE_NORSTRT_VOID : User trying to send START byte when
                                                     RESTART disabled- scenario not present                                    */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_ABRT_SBYTE_NORSTRT_GENERATED = 1,/*!< ABRT_SBYTE_NORSTRT_GENERATED : User trying to send START byte
                                                     when RESTART disabled                                                     */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_Enum;

/* =====================================  I2C0 IC_TX_ABRT_SOURCE ABRT_HS_NORSTRT [8..8]  ===================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT                                    */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_ABRT_HS_NORSTRT_VOID = 0,/*!< ABRT_HS_NORSTRT_VOID : User trying to switch Master to HS mode
                                                     when RESTART disabled- scenario not present                               */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_ABRT_HS_NORSTRT_GENERATED = 1,/*!< ABRT_HS_NORSTRT_GENERATED : User trying to switch Master to
                                                     HS mode when RESTART disabled                                             */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_Enum;

