mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ====================================  I2C0 IC_TX_ABRT_SOURCE ABRT_SBYTE_ACKDET [7..7]  ==================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET                                  */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_ABRT_SBYTE_ACKDET_VOID = 0,/*!< ABRT_SBYTE_ACKDET_VOID : ACK detected for START byte- scenario
                                                     not present                                                               */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_ABRT_SBYTE_ACKDET_GENERATED = 1,/*!< ABRT_SBYTE_ACKDET_GENERATED : ACK detected for START byte */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_Enum;

/* =====================================  I2C0 IC_TX_ABRT_SOURCE ABRT_HS_ACKDET [6..6]  ====================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET                                     */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_ABRT_HS_ACK_VOID = 0,/*!< ABRT_HS_ACK_VOID : HS Master code ACKed in HS Mode- scenario
                                                     not present                                                               */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_ABRT_HS_ACK_GENERATED = 1,/*!< ABRT_HS_ACK_GENERATED : HS Master code ACKed in HS Mode */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_Enum;

/* =====================================  I2C0 IC_TX_ABRT_SOURCE ABRT_GCALL_READ [5..5]  ===================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ                                    */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_ABRT_GCALL_READ_VOID = 0,/*!< ABRT_GCALL_READ_VOID : GCALL is followed by read from bus-scenario
                                                     not present                                                               */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_ABRT_GCALL_READ_GENERATED = 1,/*!< ABRT_GCALL_READ_GENERATED : GCALL is followed by read from bus */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_Enum;

/* ====================================  I2C0 IC_TX_ABRT_SOURCE ABRT_GCALL_NOACK [4..4]  ===================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK                                   */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_ABRT_GCALL_NOACK_VOID = 0,/*!< ABRT_GCALL_NOACK_VOID : GCALL not ACKed by any slave-scenario
                                                     not present                                                               */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_ABRT_GCALL_NOACK_GENERATED = 1,/*!< ABRT_GCALL_NOACK_GENERATED : GCALL not ACKed by any slave */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_Enum;

/* ====================================  I2C0 IC_TX_ABRT_SOURCE ABRT_TXDATA_NOACK [3..3]  ==================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK                                  */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_ABRT_TXDATA_NOACK_VOID = 0,/*!< ABRT_TXDATA_NOACK_VOID : Transmitted data non-ACKed by addressed
                                                     slave-scenario not present                                                */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_ABRT_TXDATA_NOACK_GENERATED = 1,/*!< ABRT_TXDATA_NOACK_GENERATED : Transmitted data not ACKed by
                                                     addressed slave                                                           */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_Enum;

/* ===================================  I2C0 IC_TX_ABRT_SOURCE ABRT_10ADDR2_NOACK [2..2]  ==================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK                                 */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_INACTIVE = 0,/*!< INACTIVE : This abort is not generated                           */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_ACTIVE = 1,/*!< ACTIVE : Byte 2 of 10Bit Address not ACKed by any slave            */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_Enum;

/* ===================================  I2C0 IC_TX_ABRT_SOURCE ABRT_10ADDR1_NOACK [1..1]  ==================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK                                 */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_INACTIVE = 0,/*!< INACTIVE : This abort is not generated                           */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_ACTIVE = 1,/*!< ACTIVE : Byte 1 of 10Bit Address not ACKed by any slave            */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_Enum;

/* ===================================  I2C0 IC_TX_ABRT_SOURCE ABRT_7B_ADDR_NOACK [0..0]  ==================================== */
typedef enum {                                  /*!< I2C0_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK                                 */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_INACTIVE = 0,/*!< INACTIVE : This abort is not generated                           */
  I2C0_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_ACTIVE = 1,/*!< ACTIVE : This abort is generated because of NOACK for 7-bit
                                                     address                                                                   */
} I2C0_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_Enum;

/* =================================================  IC_SLV_DATA_NACK_ONLY  ================================================= */
/* ========================================  I2C0 IC_SLV_DATA_NACK_ONLY NACK [0..0]  ========================================= */
typedef enum {                                  /*!< I2C0_IC_SLV_DATA_NACK_ONLY_NACK                                           */
  I2C0_IC_SLV_DATA_NACK_ONLY_NACK_DISABLED = 0, /*!< DISABLED : Slave receiver generates NACK normally                         */
  I2C0_IC_SLV_DATA_NACK_ONLY_NACK_ENABLED = 1,  /*!< ENABLED : Slave receiver generates NACK upon data reception
                                                     only                                                                      */
} I2C0_IC_SLV_DATA_NACK_ONLY_NACK_Enum;

/* =======================================================  IC_DMA_CR  ======================================================= */
/* ==============================================  I2C0 IC_DMA_CR TDMAE [1..1]  ============================================== */
typedef enum {                                  /*!< I2C0_IC_DMA_CR_TDMAE                                                      */
  I2C0_IC_DMA_CR_TDMAE_DISABLED        = 0,     /*!< DISABLED : transmit FIFO DMA channel disabled                             */
  I2C0_IC_DMA_CR_TDMAE_ENABLED         = 1,     /*!< ENABLED : Transmit FIFO DMA channel enabled                               */
} I2C0_IC_DMA_CR_TDMAE_Enum;

