mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ==============================================  I2C0 IC_DMA_CR RDMAE [0..0]  ============================================== */
typedef enum {                                  /*!< I2C0_IC_DMA_CR_RDMAE                                                      */
  I2C0_IC_DMA_CR_RDMAE_DISABLED        = 0,     /*!< DISABLED : Receive FIFO DMA channel disabled                              */
  I2C0_IC_DMA_CR_RDMAE_ENABLED         = 1,     /*!< ENABLED : Receive FIFO DMA channel enabled                                */
} I2C0_IC_DMA_CR_RDMAE_Enum;

/* ======================================================  IC_DMA_TDLR  ====================================================== */
/* ======================================================  IC_DMA_RDLR  ====================================================== */
/* =====================================================  IC_SDA_SETUP  ====================================================== */
/* ==================================================  IC_ACK_GENERAL_CALL  ================================================== */
/* =====================================  I2C0 IC_ACK_GENERAL_CALL ACK_GEN_CALL [0..0]  ====================================== */
typedef enum {                                  /*!< I2C0_IC_ACK_GENERAL_CALL_ACK_GEN_CALL                                     */
  I2C0_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_DISABLED = 0,/*!< DISABLED : Generate NACK for a General Call                          */
  I2C0_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_ENABLED = 1,/*!< ENABLED : Generate ACK for a General Call                             */
} I2C0_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_Enum;

/* ===================================================  IC_ENABLE_STATUS  ==================================================== */
/* =====================================  I2C0 IC_ENABLE_STATUS SLV_RX_DATA_LOST [2..2]  ===================================== */
typedef enum {                                  /*!< I2C0_IC_ENABLE_STATUS_SLV_RX_DATA_LOST                                    */
  I2C0_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_INACTIVE = 0,/*!< INACTIVE : Slave RX Data is not lost                                */
  I2C0_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_ACTIVE = 1,/*!< ACTIVE : Slave RX Data is lost                                        */
} I2C0_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_Enum;

/* =================================  I2C0 IC_ENABLE_STATUS SLV_DISABLED_WHILE_BUSY [1..1]  ================================== */
typedef enum {                                  /*!< I2C0_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY                             */
  I2C0_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_INACTIVE = 0,/*!< INACTIVE : Slave is disabled when it is idle                 */
  I2C0_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_ACTIVE = 1,/*!< ACTIVE : Slave is disabled when it is active                   */
} I2C0_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_Enum;

/* ==========================================  I2C0 IC_ENABLE_STATUS IC_EN [0..0]  =========================================== */
typedef enum {                                  /*!< I2C0_IC_ENABLE_STATUS_IC_EN                                               */
  I2C0_IC_ENABLE_STATUS_IC_EN_DISABLED = 0,     /*!< DISABLED : I2C disabled                                                   */
  I2C0_IC_ENABLE_STATUS_IC_EN_ENABLED  = 1,     /*!< ENABLED : I2C enabled                                                     */
} I2C0_IC_ENABLE_STATUS_IC_EN_Enum;

/* =====================================================  IC_FS_SPKLEN  ====================================================== */
/* ==================================================  IC_CLR_RESTART_DET  =================================================== */
/* ====================================================  IC_COMP_PARAM_1  ==================================================== */
/* ====================================================  IC_COMP_VERSION  ==================================================== */
/* =====================================================  IC_COMP_TYPE  ====================================================== */


/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CS  =========================================================== */
/* ========================================================  RESULT  ========================================================= */
/* ==========================================================  FCS  ========================================================== */
/* =========================================================  FIFO  ========================================================== */
/* ==========================================================  DIV  ========================================================== */
/* =========================================================  INTR  ========================================================== */
/* =========================================================  INTE  ========================================================== */
/* =========================================================  INTF  ========================================================== */
/* =========================================================  INTS  ========================================================== */


/* =========================================================================================================================== */
/* ================                                            PWM                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  CH0_CSR  ======================================================== */
/* ==============================================  PWM CH0_CSR DIVMODE [4..5]  =============================================== */
typedef enum {                                  /*!< PWM_CH0_CSR_DIVMODE                                                       */
  PWM_CH0_CSR_DIVMODE_div              = 0,     /*!< div : Free-running counting at rate dictated by fractional divider        */
  PWM_CH0_CSR_DIVMODE_level            = 1,     /*!< level : Fractional divider operation is gated by the PWM B pin.           */
  PWM_CH0_CSR_DIVMODE_rise             = 2,     /*!< rise : Counter advances with each rising edge of the PWM B pin.           */
  PWM_CH0_CSR_DIVMODE_fall             = 3,     /*!< fall : Counter advances with each falling edge of the PWM B
                                                     pin.                                                                      */
} PWM_CH0_CSR_DIVMODE_Enum;

/* ========================================================  CH0_DIV  ======================================================== */
/* ========================================================  CH0_CTR  ======================================================== */
/* ========================================================  CH0_CC  ========================================================= */
/* ========================================================  CH0_TOP  ======================================================== */
/* ========================================================  CH1_CSR  ======================================================== */
/* ==============================================  PWM CH1_CSR DIVMODE [4..5]  =============================================== */
typedef enum {                                  /*!< PWM_CH1_CSR_DIVMODE                                                       */
  PWM_CH1_CSR_DIVMODE_div              = 0,     /*!< div : Free-running counting at rate dictated by fractional divider        */
  PWM_CH1_CSR_DIVMODE_level            = 1,     /*!< level : Fractional divider operation is gated by the PWM B pin.           */
  PWM_CH1_CSR_DIVMODE_rise             = 2,     /*!< rise : Counter advances with each rising edge of the PWM B pin.           */
  PWM_CH1_CSR_DIVMODE_fall             = 3,     /*!< fall : Counter advances with each falling edge of the PWM B
                                                     pin.                                                                      */
} PWM_CH1_CSR_DIVMODE_Enum;

/* ========================================================  CH1_DIV  ======================================================== */
/* ========================================================  CH1_CTR  ======================================================== */
/* ========================================================  CH1_CC  ========================================================= */
/* ========================================================  CH1_TOP  ======================================================== */
/* ========================================================  CH2_CSR  ======================================================== */
/* ==============================================  PWM CH2_CSR DIVMODE [4..5]  =============================================== */
typedef enum {                                  /*!< PWM_CH2_CSR_DIVMODE                                                       */
  PWM_CH2_CSR_DIVMODE_div              = 0,     /*!< div : Free-running counting at rate dictated by fractional divider        */
  PWM_CH2_CSR_DIVMODE_level            = 1,     /*!< level : Fractional divider operation is gated by the PWM B pin.           */
  PWM_CH2_CSR_DIVMODE_rise             = 2,     /*!< rise : Counter advances with each rising edge of the PWM B pin.           */
  PWM_CH2_CSR_DIVMODE_fall             = 3,     /*!< fall : Counter advances with each falling edge of the PWM B
                                                     pin.                                                                      */
} PWM_CH2_CSR_DIVMODE_Enum;

/* ========================================================  CH2_DIV  ======================================================== */
/* ========================================================  CH2_CTR  ======================================================== */
/* ========================================================  CH2_CC  ========================================================= */
/* ========================================================  CH2_TOP  ======================================================== */
/* ========================================================  CH3_CSR  ======================================================== */
/* ==============================================  PWM CH3_CSR DIVMODE [4..5]  =============================================== */
typedef enum {                                  /*!< PWM_CH3_CSR_DIVMODE                                                       */
  PWM_CH3_CSR_DIVMODE_div              = 0,     /*!< div : Free-running counting at rate dictated by fractional divider        */
  PWM_CH3_CSR_DIVMODE_level            = 1,     /*!< level : Fractional divider operation is gated by the PWM B pin.           */
  PWM_CH3_CSR_DIVMODE_rise             = 2,     /*!< rise : Counter advances with each rising edge of the PWM B pin.           */
  PWM_CH3_CSR_DIVMODE_fall             = 3,     /*!< fall : Counter advances with each falling edge of the PWM B
                                                     pin.                                                                      */
} PWM_CH3_CSR_DIVMODE_Enum;

