mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ========================================================  CH3_DIV  ======================================================== */
/* ========================================================  CH3_CTR  ======================================================== */
/* ========================================================  CH3_CC  ========================================================= */
/* ========================================================  CH3_TOP  ======================================================== */
/* ========================================================  CH4_CSR  ======================================================== */
/* ==============================================  PWM CH4_CSR DIVMODE [4..5]  =============================================== */
typedef enum {                                  /*!< PWM_CH4_CSR_DIVMODE                                                       */
  PWM_CH4_CSR_DIVMODE_div              = 0,     /*!< div : Free-running counting at rate dictated by fractional divider        */
  PWM_CH4_CSR_DIVMODE_level            = 1,     /*!< level : Fractional divider operation is gated by the PWM B pin.           */
  PWM_CH4_CSR_DIVMODE_rise             = 2,     /*!< rise : Counter advances with each rising edge of the PWM B pin.           */
  PWM_CH4_CSR_DIVMODE_fall             = 3,     /*!< fall : Counter advances with each falling edge of the PWM B
                                                     pin.                                                                      */
} PWM_CH4_CSR_DIVMODE_Enum;

/* ========================================================  CH4_DIV  ======================================================== */
/* ========================================================  CH4_CTR  ======================================================== */
/* ========================================================  CH4_CC  ========================================================= */
/* ========================================================  CH4_TOP  ======================================================== */
/* ========================================================  CH5_CSR  ======================================================== */
/* ==============================================  PWM CH5_CSR DIVMODE [4..5]  =============================================== */
typedef enum {                                  /*!< PWM_CH5_CSR_DIVMODE                                                       */
  PWM_CH5_CSR_DIVMODE_div              = 0,     /*!< div : Free-running counting at rate dictated by fractional divider        */
  PWM_CH5_CSR_DIVMODE_level            = 1,     /*!< level : Fractional divider operation is gated by the PWM B pin.           */
  PWM_CH5_CSR_DIVMODE_rise             = 2,     /*!< rise : Counter advances with each rising edge of the PWM B pin.           */
  PWM_CH5_CSR_DIVMODE_fall             = 3,     /*!< fall : Counter advances with each falling edge of the PWM B
                                                     pin.                                                                      */
} PWM_CH5_CSR_DIVMODE_Enum;

/* ========================================================  CH5_DIV  ======================================================== */
/* ========================================================  CH5_CTR  ======================================================== */
/* ========================================================  CH5_CC  ========================================================= */
/* ========================================================  CH5_TOP  ======================================================== */
/* ========================================================  CH6_CSR  ======================================================== */
/* ==============================================  PWM CH6_CSR DIVMODE [4..5]  =============================================== */
typedef enum {                                  /*!< PWM_CH6_CSR_DIVMODE                                                       */
  PWM_CH6_CSR_DIVMODE_div              = 0,     /*!< div : Free-running counting at rate dictated by fractional divider        */
  PWM_CH6_CSR_DIVMODE_level            = 1,     /*!< level : Fractional divider operation is gated by the PWM B pin.           */
  PWM_CH6_CSR_DIVMODE_rise             = 2,     /*!< rise : Counter advances with each rising edge of the PWM B pin.           */
  PWM_CH6_CSR_DIVMODE_fall             = 3,     /*!< fall : Counter advances with each falling edge of the PWM B
                                                     pin.                                                                      */
} PWM_CH6_CSR_DIVMODE_Enum;

/* ========================================================  CH6_DIV  ======================================================== */
/* ========================================================  CH6_CTR  ======================================================== */
/* ========================================================  CH6_CC  ========================================================= */
/* ========================================================  CH6_TOP  ======================================================== */
/* ========================================================  CH7_CSR  ======================================================== */
/* ==============================================  PWM CH7_CSR DIVMODE [4..5]  =============================================== */
typedef enum {                                  /*!< PWM_CH7_CSR_DIVMODE                                                       */
  PWM_CH7_CSR_DIVMODE_div              = 0,     /*!< div : Free-running counting at rate dictated by fractional divider        */
  PWM_CH7_CSR_DIVMODE_level            = 1,     /*!< level : Fractional divider operation is gated by the PWM B pin.           */
  PWM_CH7_CSR_DIVMODE_rise             = 2,     /*!< rise : Counter advances with each rising edge of the PWM B pin.           */
  PWM_CH7_CSR_DIVMODE_fall             = 3,     /*!< fall : Counter advances with each falling edge of the PWM B
                                                     pin.                                                                      */
} PWM_CH7_CSR_DIVMODE_Enum;

/* ========================================================  CH7_DIV  ======================================================== */
/* ========================================================  CH7_CTR  ======================================================== */
/* ========================================================  CH7_CC  ========================================================= */
/* ========================================================  CH7_TOP  ======================================================== */
/* ==========================================================  EN  =========================================================== */
/* =========================================================  INTR  ========================================================== */
/* =========================================================  INTE  ========================================================== */
/* =========================================================  INTF  ========================================================== */
/* =========================================================  INTS  ========================================================== */


/* =========================================================================================================================== */
/* ================                                           TIMER                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  TIMEHW  ========================================================= */
/* ========================================================  TIMELW  ========================================================= */
/* ========================================================  TIMEHR  ========================================================= */
/* ========================================================  TIMELR  ========================================================= */
/* ========================================================  ALARM0  ========================================================= */
/* ========================================================  ALARM1  ========================================================= */
/* ========================================================  ALARM2  ========================================================= */
/* ========================================================  ALARM3  ========================================================= */
/* =========================================================  ARMED  ========================================================= */
/* =======================================================  TIMERAWH  ======================================================== */
/* =======================================================  TIMERAWL  ======================================================== */
/* =======================================================  DBGPAUSE  ======================================================== */
/* =========================================================  PAUSE  ========================================================= */
/* =========================================================  INTR  ========================================================== */
/* =========================================================  INTE  ========================================================== */
/* =========================================================  INTF  ========================================================== */
/* =========================================================  INTS  ========================================================== */


/* =========================================================================================================================== */
/* ================                                         WATCHDOG                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* =========================================================  LOAD  ========================================================== */
/* ========================================================  REASON  ========================================================= */
/* =======================================================  SCRATCH0  ======================================================== */
/* =======================================================  SCRATCH1  ======================================================== */
/* =======================================================  SCRATCH2  ======================================================== */
/* =======================================================  SCRATCH3  ======================================================== */
/* =======================================================  SCRATCH4  ======================================================== */
/* =======================================================  SCRATCH5  ======================================================== */
/* =======================================================  SCRATCH6  ======================================================== */
/* =======================================================  SCRATCH7  ======================================================== */
/* =========================================================  TICK  ========================================================== */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  CLKDIV_M1  ======================================================= */
/* ========================================================  SETUP_0  ======================================================== */
/* ========================================================  SETUP_1  ======================================================== */
/* =========================================================  CTRL  ========================================================== */
/* ======================================================  IRQ_SETUP_0  ====================================================== */
/* ======================================================  IRQ_SETUP_1  ====================================================== */
/* =========================================================  RTC_1  ========================================================= */
/* =========================================================  RTC_0  ========================================================= */
/* =========================================================  INTR  ========================================================== */
/* =========================================================  INTE  ========================================================== */
/* =========================================================  INTF  ========================================================== */
/* =========================================================  INTS  ========================================================== */


/* =========================================================================================================================== */
/* ================                                           ROSC                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* ===============================================  ROSC CTRL ENABLE [12..23]  =============================================== */
typedef enum {                                  /*!< ROSC_CTRL_ENABLE                                                          */
  ROSC_CTRL_ENABLE_DISABLE             = 3358,  /*!< DISABLE : DISABLE                                                         */
  ROSC_CTRL_ENABLE_ENABLE              = 4011,  /*!< ENABLE : ENABLE                                                           */
} ROSC_CTRL_ENABLE_Enum;

/* =============================================  ROSC CTRL FREQ_RANGE [0..11]  ============================================== */
typedef enum {                                  /*!< ROSC_CTRL_FREQ_RANGE                                                      */
  ROSC_CTRL_FREQ_RANGE_LOW             = 4004,  /*!< LOW : LOW                                                                 */
  ROSC_CTRL_FREQ_RANGE_MEDIUM          = 4005,  /*!< MEDIUM : MEDIUM                                                           */
  ROSC_CTRL_FREQ_RANGE_HIGH            = 4007,  /*!< HIGH : HIGH                                                               */
  ROSC_CTRL_FREQ_RANGE_TOOHIGH         = 4006,  /*!< TOOHIGH : TOOHIGH                                                         */
} ROSC_CTRL_FREQ_RANGE_Enum;

/* =========================================================  FREQA  ========================================================= */
/* ==============================================  ROSC FREQA PASSWD [16..31]  =============================================== */
typedef enum {                                  /*!< ROSC_FREQA_PASSWD                                                         */
  ROSC_FREQA_PASSWD_PASS               = 38550, /*!< PASS : PASS                                                               */
} ROSC_FREQA_PASSWD_Enum;

/* =========================================================  FREQB  ========================================================= */
/* ==============================================  ROSC FREQB PASSWD [16..31]  =============================================== */
typedef enum {                                  /*!< ROSC_FREQB_PASSWD                                                         */
  ROSC_FREQB_PASSWD_PASS               = 38550, /*!< PASS : PASS                                                               */
} ROSC_FREQB_PASSWD_Enum;

/* ========================================================  DORMANT  ======================================================== */
/* ==========================================================  DIV  ========================================================== */
/* =================================================  ROSC DIV DIV [0..11]  ================================================== */
typedef enum {                                  /*!< ROSC_DIV_DIV                                                              */
  ROSC_DIV_DIV_PASS                    = 2720,  /*!< PASS : PASS                                                               */
} ROSC_DIV_DIV_Enum;

/* =========================================================  PHASE  ========================================================= */
/* ========================================================  STATUS  ========================================================= */
/* =======================================================  RANDOMBIT  ======================================================= */
/* =========================================================  COUNT  ========================================================= */


/* =========================================================================================================================== */
/* ================                                    VREG_AND_CHIP_RESET                                    ================ */
/* =========================================================================================================================== */

/* =========================================================  VREG  ========================================================== */
/* ==========================================================  BOD  ========================================================== */
/* ======================================================  CHIP_RESET  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           TBMAN                                           ================ */
/* =========================================================================================================================== */

/* =======================================================  PLATFORM  ======================================================== */


/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */

