mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =====================================================  CH0_READ_ADDR  ===================================================== */
/* ====================================================  CH0_WRITE_ADDR  ===================================================== */
/* ====================================================  CH0_TRANS_COUNT  ==================================================== */
/* =====================================================  CH0_CTRL_TRIG  ===================================================== */
/* ==========================================  DMA CH0_CTRL_TRIG TREQ_SEL [15..20]  ========================================== */
typedef enum {                                  /*!< DMA_CH0_CTRL_TRIG_TREQ_SEL                                                */
  DMA_CH0_CTRL_TRIG_TREQ_SEL_TIMER0    = 59,    /*!< TIMER0 : Select Timer 0 as TREQ                                           */
  DMA_CH0_CTRL_TRIG_TREQ_SEL_TIMER1    = 60,    /*!< TIMER1 : Select Timer 1 as TREQ                                           */
  DMA_CH0_CTRL_TRIG_TREQ_SEL_TIMER2    = 61,    /*!< TIMER2 : Select Timer 2 as TREQ (Optional)                                */
  DMA_CH0_CTRL_TRIG_TREQ_SEL_TIMER3    = 62,    /*!< TIMER3 : Select Timer 3 as TREQ (Optional)                                */
  DMA_CH0_CTRL_TRIG_TREQ_SEL_PERMANENT = 63,    /*!< PERMANENT : Permanent request, for unpaced transfers.                     */
} DMA_CH0_CTRL_TRIG_TREQ_SEL_Enum;

/* ==========================================  DMA CH0_CTRL_TRIG RING_SIZE [6..9]  =========================================== */
typedef enum {                                  /*!< DMA_CH0_CTRL_TRIG_RING_SIZE                                               */
  DMA_CH0_CTRL_TRIG_RING_SIZE_RING_NONE = 0,    /*!< RING_NONE : RING_NONE                                                     */
} DMA_CH0_CTRL_TRIG_RING_SIZE_Enum;

/* ==========================================  DMA CH0_CTRL_TRIG DATA_SIZE [2..3]  =========================================== */
typedef enum {                                  /*!< DMA_CH0_CTRL_TRIG_DATA_SIZE                                               */
  DMA_CH0_CTRL_TRIG_DATA_SIZE_SIZE_BYTE = 0,    /*!< SIZE_BYTE : SIZE_BYTE                                                     */
  DMA_CH0_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD = 1,/*!< SIZE_HALFWORD : SIZE_HALFWORD                                             */
  DMA_CH0_CTRL_TRIG_DATA_SIZE_SIZE_WORD = 2,    /*!< SIZE_WORD : SIZE_WORD                                                     */
} DMA_CH0_CTRL_TRIG_DATA_SIZE_Enum;

/* =====================================================  CH0_AL1_CTRL  ====================================================== */
/* ===================================================  CH0_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH0_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH0_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH0_AL2_CTRL  ====================================================== */
/* ==================================================  CH0_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH0_AL2_READ_ADDR  =================================================== */
/* ================================================  CH0_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH0_AL3_CTRL  ====================================================== */
/* ==================================================  CH0_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH0_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH0_AL3_READ_ADDR_TRIG  ================================================= */
/* =====================================================  CH1_READ_ADDR  ===================================================== */
/* ====================================================  CH1_WRITE_ADDR  ===================================================== */
/* ====================================================  CH1_TRANS_COUNT  ==================================================== */
/* =====================================================  CH1_CTRL_TRIG  ===================================================== */
/* ==========================================  DMA CH1_CTRL_TRIG TREQ_SEL [15..20]  ========================================== */
typedef enum {                                  /*!< DMA_CH1_CTRL_TRIG_TREQ_SEL                                                */
  DMA_CH1_CTRL_TRIG_TREQ_SEL_TIMER0    = 59,    /*!< TIMER0 : Select Timer 0 as TREQ                                           */
  DMA_CH1_CTRL_TRIG_TREQ_SEL_TIMER1    = 60,    /*!< TIMER1 : Select Timer 1 as TREQ                                           */
  DMA_CH1_CTRL_TRIG_TREQ_SEL_TIMER2    = 61,    /*!< TIMER2 : Select Timer 2 as TREQ (Optional)                                */
  DMA_CH1_CTRL_TRIG_TREQ_SEL_TIMER3    = 62,    /*!< TIMER3 : Select Timer 3 as TREQ (Optional)                                */
  DMA_CH1_CTRL_TRIG_TREQ_SEL_PERMANENT = 63,    /*!< PERMANENT : Permanent request, for unpaced transfers.                     */
} DMA_CH1_CTRL_TRIG_TREQ_SEL_Enum;

/* ==========================================  DMA CH1_CTRL_TRIG RING_SIZE [6..9]  =========================================== */
typedef enum {                                  /*!< DMA_CH1_CTRL_TRIG_RING_SIZE                                               */
  DMA_CH1_CTRL_TRIG_RING_SIZE_RING_NONE = 0,    /*!< RING_NONE : RING_NONE                                                     */
} DMA_CH1_CTRL_TRIG_RING_SIZE_Enum;

/* ==========================================  DMA CH1_CTRL_TRIG DATA_SIZE [2..3]  =========================================== */
typedef enum {                                  /*!< DMA_CH1_CTRL_TRIG_DATA_SIZE                                               */
  DMA_CH1_CTRL_TRIG_DATA_SIZE_SIZE_BYTE = 0,    /*!< SIZE_BYTE : SIZE_BYTE                                                     */
  DMA_CH1_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD = 1,/*!< SIZE_HALFWORD : SIZE_HALFWORD                                             */
  DMA_CH1_CTRL_TRIG_DATA_SIZE_SIZE_WORD = 2,    /*!< SIZE_WORD : SIZE_WORD                                                     */
} DMA_CH1_CTRL_TRIG_DATA_SIZE_Enum;

