mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ==========================================  DMA CH3_CTRL_TRIG RING_SIZE [6..9]  =========================================== */
typedef enum {                                  /*!< DMA_CH3_CTRL_TRIG_RING_SIZE                                               */
  DMA_CH3_CTRL_TRIG_RING_SIZE_RING_NONE = 0,    /*!< RING_NONE : RING_NONE                                                     */
} DMA_CH3_CTRL_TRIG_RING_SIZE_Enum;

/* ==========================================  DMA CH3_CTRL_TRIG DATA_SIZE [2..3]  =========================================== */
typedef enum {                                  /*!< DMA_CH3_CTRL_TRIG_DATA_SIZE                                               */
  DMA_CH3_CTRL_TRIG_DATA_SIZE_SIZE_BYTE = 0,    /*!< SIZE_BYTE : SIZE_BYTE                                                     */
  DMA_CH3_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD = 1,/*!< SIZE_HALFWORD : SIZE_HALFWORD                                             */
  DMA_CH3_CTRL_TRIG_DATA_SIZE_SIZE_WORD = 2,    /*!< SIZE_WORD : SIZE_WORD                                                     */
} DMA_CH3_CTRL_TRIG_DATA_SIZE_Enum;

/* =====================================================  CH3_AL1_CTRL  ====================================================== */
/* ===================================================  CH3_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH3_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH3_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH3_AL2_CTRL  ====================================================== */
/* ==================================================  CH3_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH3_AL2_READ_ADDR  =================================================== */
/* ================================================  CH3_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH3_AL3_CTRL  ====================================================== */
/* ==================================================  CH3_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH3_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH3_AL3_READ_ADDR_TRIG  ================================================= */
/* =====================================================  CH4_READ_ADDR  ===================================================== */
/* ====================================================  CH4_WRITE_ADDR  ===================================================== */
/* ====================================================  CH4_TRANS_COUNT  ==================================================== */
/* =====================================================  CH4_CTRL_TRIG  ===================================================== */
/* ==========================================  DMA CH4_CTRL_TRIG TREQ_SEL [15..20]  ========================================== */
typedef enum {                                  /*!< DMA_CH4_CTRL_TRIG_TREQ_SEL                                                */
  DMA_CH4_CTRL_TRIG_TREQ_SEL_TIMER0    = 59,    /*!< TIMER0 : Select Timer 0 as TREQ                                           */
  DMA_CH4_CTRL_TRIG_TREQ_SEL_TIMER1    = 60,    /*!< TIMER1 : Select Timer 1 as TREQ                                           */
  DMA_CH4_CTRL_TRIG_TREQ_SEL_TIMER2    = 61,    /*!< TIMER2 : Select Timer 2 as TREQ (Optional)                                */
  DMA_CH4_CTRL_TRIG_TREQ_SEL_TIMER3    = 62,    /*!< TIMER3 : Select Timer 3 as TREQ (Optional)                                */
  DMA_CH4_CTRL_TRIG_TREQ_SEL_PERMANENT = 63,    /*!< PERMANENT : Permanent request, for unpaced transfers.                     */
} DMA_CH4_CTRL_TRIG_TREQ_SEL_Enum;

/* ==========================================  DMA CH4_CTRL_TRIG RING_SIZE [6..9]  =========================================== */
typedef enum {                                  /*!< DMA_CH4_CTRL_TRIG_RING_SIZE                                               */
  DMA_CH4_CTRL_TRIG_RING_SIZE_RING_NONE = 0,    /*!< RING_NONE : RING_NONE                                                     */
} DMA_CH4_CTRL_TRIG_RING_SIZE_Enum;

/* ==========================================  DMA CH4_CTRL_TRIG DATA_SIZE [2..3]  =========================================== */
typedef enum {                                  /*!< DMA_CH4_CTRL_TRIG_DATA_SIZE                                               */
  DMA_CH4_CTRL_TRIG_DATA_SIZE_SIZE_BYTE = 0,    /*!< SIZE_BYTE : SIZE_BYTE                                                     */
  DMA_CH4_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD = 1,/*!< SIZE_HALFWORD : SIZE_HALFWORD                                             */
  DMA_CH4_CTRL_TRIG_DATA_SIZE_SIZE_WORD = 2,    /*!< SIZE_WORD : SIZE_WORD                                                     */
} DMA_CH4_CTRL_TRIG_DATA_SIZE_Enum;

/* =====================================================  CH4_AL1_CTRL  ====================================================== */
/* ===================================================  CH4_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH4_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH4_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH4_AL2_CTRL  ====================================================== */
/* ==================================================  CH4_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH4_AL2_READ_ADDR  =================================================== */
/* ================================================  CH4_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH4_AL3_CTRL  ====================================================== */
/* ==================================================  CH4_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH4_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH4_AL3_READ_ADDR_TRIG  ================================================= */
/* =====================================================  CH5_READ_ADDR  ===================================================== */
/* ====================================================  CH5_WRITE_ADDR  ===================================================== */
/* ====================================================  CH5_TRANS_COUNT  ==================================================== */
/* =====================================================  CH5_CTRL_TRIG  ===================================================== */
/* ==========================================  DMA CH5_CTRL_TRIG TREQ_SEL [15..20]  ========================================== */
typedef enum {                                  /*!< DMA_CH5_CTRL_TRIG_TREQ_SEL                                                */
  DMA_CH5_CTRL_TRIG_TREQ_SEL_TIMER0    = 59,    /*!< TIMER0 : Select Timer 0 as TREQ                                           */
  DMA_CH5_CTRL_TRIG_TREQ_SEL_TIMER1    = 60,    /*!< TIMER1 : Select Timer 1 as TREQ                                           */
  DMA_CH5_CTRL_TRIG_TREQ_SEL_TIMER2    = 61,    /*!< TIMER2 : Select Timer 2 as TREQ (Optional)                                */
  DMA_CH5_CTRL_TRIG_TREQ_SEL_TIMER3    = 62,    /*!< TIMER3 : Select Timer 3 as TREQ (Optional)                                */
  DMA_CH5_CTRL_TRIG_TREQ_SEL_PERMANENT = 63,    /*!< PERMANENT : Permanent request, for unpaced transfers.                     */
} DMA_CH5_CTRL_TRIG_TREQ_SEL_Enum;

/* ==========================================  DMA CH5_CTRL_TRIG RING_SIZE [6..9]  =========================================== */
typedef enum {                                  /*!< DMA_CH5_CTRL_TRIG_RING_SIZE                                               */
  DMA_CH5_CTRL_TRIG_RING_SIZE_RING_NONE = 0,    /*!< RING_NONE : RING_NONE                                                     */
} DMA_CH5_CTRL_TRIG_RING_SIZE_Enum;

/* ==========================================  DMA CH5_CTRL_TRIG DATA_SIZE [2..3]  =========================================== */
typedef enum {                                  /*!< DMA_CH5_CTRL_TRIG_DATA_SIZE                                               */
  DMA_CH5_CTRL_TRIG_DATA_SIZE_SIZE_BYTE = 0,    /*!< SIZE_BYTE : SIZE_BYTE                                                     */
  DMA_CH5_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD = 1,/*!< SIZE_HALFWORD : SIZE_HALFWORD                                             */
  DMA_CH5_CTRL_TRIG_DATA_SIZE_SIZE_WORD = 2,    /*!< SIZE_WORD : SIZE_WORD                                                     */
} DMA_CH5_CTRL_TRIG_DATA_SIZE_Enum;

/* =====================================================  CH5_AL1_CTRL  ====================================================== */
/* ===================================================  CH5_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH5_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH5_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH5_AL2_CTRL  ====================================================== */
/* ==================================================  CH5_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH5_AL2_READ_ADDR  =================================================== */
/* ================================================  CH5_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH5_AL3_CTRL  ====================================================== */
/* ==================================================  CH5_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH5_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH5_AL3_READ_ADDR_TRIG  ================================================= */
/* =====================================================  CH6_READ_ADDR  ===================================================== */
/* ====================================================  CH6_WRITE_ADDR  ===================================================== */
/* ====================================================  CH6_TRANS_COUNT  ==================================================== */
/* =====================================================  CH6_CTRL_TRIG  ===================================================== */
/* ==========================================  DMA CH6_CTRL_TRIG TREQ_SEL [15..20]  ========================================== */
typedef enum {                                  /*!< DMA_CH6_CTRL_TRIG_TREQ_SEL                                                */
  DMA_CH6_CTRL_TRIG_TREQ_SEL_TIMER0    = 59,    /*!< TIMER0 : Select Timer 0 as TREQ                                           */
  DMA_CH6_CTRL_TRIG_TREQ_SEL_TIMER1    = 60,    /*!< TIMER1 : Select Timer 1 as TREQ                                           */
  DMA_CH6_CTRL_TRIG_TREQ_SEL_TIMER2    = 61,    /*!< TIMER2 : Select Timer 2 as TREQ (Optional)                                */
  DMA_CH6_CTRL_TRIG_TREQ_SEL_TIMER3    = 62,    /*!< TIMER3 : Select Timer 3 as TREQ (Optional)                                */
  DMA_CH6_CTRL_TRIG_TREQ_SEL_PERMANENT = 63,    /*!< PERMANENT : Permanent request, for unpaced transfers.                     */
} DMA_CH6_CTRL_TRIG_TREQ_SEL_Enum;

/* ==========================================  DMA CH6_CTRL_TRIG RING_SIZE [6..9]  =========================================== */
typedef enum {                                  /*!< DMA_CH6_CTRL_TRIG_RING_SIZE                                               */
  DMA_CH6_CTRL_TRIG_RING_SIZE_RING_NONE = 0,    /*!< RING_NONE : RING_NONE                                                     */
} DMA_CH6_CTRL_TRIG_RING_SIZE_Enum;

/* ==========================================  DMA CH6_CTRL_TRIG DATA_SIZE [2..3]  =========================================== */
typedef enum {                                  /*!< DMA_CH6_CTRL_TRIG_DATA_SIZE                                               */
  DMA_CH6_CTRL_TRIG_DATA_SIZE_SIZE_BYTE = 0,    /*!< SIZE_BYTE : SIZE_BYTE                                                     */
  DMA_CH6_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD = 1,/*!< SIZE_HALFWORD : SIZE_HALFWORD                                             */
  DMA_CH6_CTRL_TRIG_DATA_SIZE_SIZE_WORD = 2,    /*!< SIZE_WORD : SIZE_WORD                                                     */
} DMA_CH6_CTRL_TRIG_DATA_SIZE_Enum;

/* =====================================================  CH6_AL1_CTRL  ====================================================== */
/* ===================================================  CH6_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH6_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH6_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH6_AL2_CTRL  ====================================================== */
/* ==================================================  CH6_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH6_AL2_READ_ADDR  =================================================== */
/* ================================================  CH6_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH6_AL3_CTRL  ====================================================== */
/* ==================================================  CH6_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH6_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH6_AL3_READ_ADDR_TRIG  ================================================= */
/* =====================================================  CH7_READ_ADDR  ===================================================== */
/* ====================================================  CH7_WRITE_ADDR  ===================================================== */
/* ====================================================  CH7_TRANS_COUNT  ==================================================== */
/* =====================================================  CH7_CTRL_TRIG  ===================================================== */
/* ==========================================  DMA CH7_CTRL_TRIG TREQ_SEL [15..20]  ========================================== */
typedef enum {                                  /*!< DMA_CH7_CTRL_TRIG_TREQ_SEL                                                */
  DMA_CH7_CTRL_TRIG_TREQ_SEL_TIMER0    = 59,    /*!< TIMER0 : Select Timer 0 as TREQ                                           */
  DMA_CH7_CTRL_TRIG_TREQ_SEL_TIMER1    = 60,    /*!< TIMER1 : Select Timer 1 as TREQ                                           */
  DMA_CH7_CTRL_TRIG_TREQ_SEL_TIMER2    = 61,    /*!< TIMER2 : Select Timer 2 as TREQ (Optional)                                */
  DMA_CH7_CTRL_TRIG_TREQ_SEL_TIMER3    = 62,    /*!< TIMER3 : Select Timer 3 as TREQ (Optional)                                */
  DMA_CH7_CTRL_TRIG_TREQ_SEL_PERMANENT = 63,    /*!< PERMANENT : Permanent request, for unpaced transfers.                     */
} DMA_CH7_CTRL_TRIG_TREQ_SEL_Enum;

/* ==========================================  DMA CH7_CTRL_TRIG RING_SIZE [6..9]  =========================================== */
typedef enum {                                  /*!< DMA_CH7_CTRL_TRIG_RING_SIZE                                               */
  DMA_CH7_CTRL_TRIG_RING_SIZE_RING_NONE = 0,    /*!< RING_NONE : RING_NONE                                                     */
} DMA_CH7_CTRL_TRIG_RING_SIZE_Enum;

/* ==========================================  DMA CH7_CTRL_TRIG DATA_SIZE [2..3]  =========================================== */
typedef enum {                                  /*!< DMA_CH7_CTRL_TRIG_DATA_SIZE                                               */
  DMA_CH7_CTRL_TRIG_DATA_SIZE_SIZE_BYTE = 0,    /*!< SIZE_BYTE : SIZE_BYTE                                                     */
  DMA_CH7_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD = 1,/*!< SIZE_HALFWORD : SIZE_HALFWORD                                             */
  DMA_CH7_CTRL_TRIG_DATA_SIZE_SIZE_WORD = 2,    /*!< SIZE_WORD : SIZE_WORD                                                     */
} DMA_CH7_CTRL_TRIG_DATA_SIZE_Enum;

/* =====================================================  CH7_AL1_CTRL  ====================================================== */
/* ===================================================  CH7_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH7_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH7_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH7_AL2_CTRL  ====================================================== */
/* ==================================================  CH7_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH7_AL2_READ_ADDR  =================================================== */
/* ================================================  CH7_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH7_AL3_CTRL  ====================================================== */
/* ==================================================  CH7_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH7_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH7_AL3_READ_ADDR_TRIG  ================================================= */
/* =====================================================  CH8_READ_ADDR  ===================================================== */
/* ====================================================  CH8_WRITE_ADDR  ===================================================== */
/* ====================================================  CH8_TRANS_COUNT  ==================================================== */
/* =====================================================  CH8_CTRL_TRIG  ===================================================== */
/* ==========================================  DMA CH8_CTRL_TRIG TREQ_SEL [15..20]  ========================================== */
typedef enum {                                  /*!< DMA_CH8_CTRL_TRIG_TREQ_SEL                                                */
  DMA_CH8_CTRL_TRIG_TREQ_SEL_TIMER0    = 59,    /*!< TIMER0 : Select Timer 0 as TREQ                                           */
  DMA_CH8_CTRL_TRIG_TREQ_SEL_TIMER1    = 60,    /*!< TIMER1 : Select Timer 1 as TREQ                                           */
  DMA_CH8_CTRL_TRIG_TREQ_SEL_TIMER2    = 61,    /*!< TIMER2 : Select Timer 2 as TREQ (Optional)                                */
  DMA_CH8_CTRL_TRIG_TREQ_SEL_TIMER3    = 62,    /*!< TIMER3 : Select Timer 3 as TREQ (Optional)                                */
  DMA_CH8_CTRL_TRIG_TREQ_SEL_PERMANENT = 63,    /*!< PERMANENT : Permanent request, for unpaced transfers.                     */
} DMA_CH8_CTRL_TRIG_TREQ_SEL_Enum;

/* ==========================================  DMA CH8_CTRL_TRIG RING_SIZE [6..9]  =========================================== */
typedef enum {                                  /*!< DMA_CH8_CTRL_TRIG_RING_SIZE                                               */
  DMA_CH8_CTRL_TRIG_RING_SIZE_RING_NONE = 0,    /*!< RING_NONE : RING_NONE                                                     */
} DMA_CH8_CTRL_TRIG_RING_SIZE_Enum;

/* ==========================================  DMA CH8_CTRL_TRIG DATA_SIZE [2..3]  =========================================== */
typedef enum {                                  /*!< DMA_CH8_CTRL_TRIG_DATA_SIZE                                               */
  DMA_CH8_CTRL_TRIG_DATA_SIZE_SIZE_BYTE = 0,    /*!< SIZE_BYTE : SIZE_BYTE                                                     */
  DMA_CH8_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD = 1,/*!< SIZE_HALFWORD : SIZE_HALFWORD                                             */
  DMA_CH8_CTRL_TRIG_DATA_SIZE_SIZE_WORD = 2,    /*!< SIZE_WORD : SIZE_WORD                                                     */
} DMA_CH8_CTRL_TRIG_DATA_SIZE_Enum;

