mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =====================================================  CH8_AL1_CTRL  ====================================================== */
/* ===================================================  CH8_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH8_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH8_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH8_AL2_CTRL  ====================================================== */
/* ==================================================  CH8_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH8_AL2_READ_ADDR  =================================================== */
/* ================================================  CH8_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH8_AL3_CTRL  ====================================================== */
/* ==================================================  CH8_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH8_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH8_AL3_READ_ADDR_TRIG  ================================================= */
/* =====================================================  CH9_READ_ADDR  ===================================================== */
/* ====================================================  CH9_WRITE_ADDR  ===================================================== */
/* ====================================================  CH9_TRANS_COUNT  ==================================================== */
/* =====================================================  CH9_CTRL_TRIG  ===================================================== */
/* ==========================================  DMA CH9_CTRL_TRIG TREQ_SEL [15..20]  ========================================== */
typedef enum {                                  /*!< DMA_CH9_CTRL_TRIG_TREQ_SEL                                                */
  DMA_CH9_CTRL_TRIG_TREQ_SEL_TIMER0    = 59,    /*!< TIMER0 : Select Timer 0 as TREQ                                           */
  DMA_CH9_CTRL_TRIG_TREQ_SEL_TIMER1    = 60,    /*!< TIMER1 : Select Timer 1 as TREQ                                           */
  DMA_CH9_CTRL_TRIG_TREQ_SEL_TIMER2    = 61,    /*!< TIMER2 : Select Timer 2 as TREQ (Optional)                                */
  DMA_CH9_CTRL_TRIG_TREQ_SEL_TIMER3    = 62,    /*!< TIMER3 : Select Timer 3 as TREQ (Optional)                                */
  DMA_CH9_CTRL_TRIG_TREQ_SEL_PERMANENT = 63,    /*!< PERMANENT : Permanent request, for unpaced transfers.                     */
} DMA_CH9_CTRL_TRIG_TREQ_SEL_Enum;

/* ==========================================  DMA CH9_CTRL_TRIG RING_SIZE [6..9]  =========================================== */
typedef enum {                                  /*!< DMA_CH9_CTRL_TRIG_RING_SIZE                                               */
  DMA_CH9_CTRL_TRIG_RING_SIZE_RING_NONE = 0,    /*!< RING_NONE : RING_NONE                                                     */
} DMA_CH9_CTRL_TRIG_RING_SIZE_Enum;

/* ==========================================  DMA CH9_CTRL_TRIG DATA_SIZE [2..3]  =========================================== */
typedef enum {                                  /*!< DMA_CH9_CTRL_TRIG_DATA_SIZE                                               */
  DMA_CH9_CTRL_TRIG_DATA_SIZE_SIZE_BYTE = 0,    /*!< SIZE_BYTE : SIZE_BYTE                                                     */
  DMA_CH9_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD = 1,/*!< SIZE_HALFWORD : SIZE_HALFWORD                                             */
  DMA_CH9_CTRL_TRIG_DATA_SIZE_SIZE_WORD = 2,    /*!< SIZE_WORD : SIZE_WORD                                                     */
} DMA_CH9_CTRL_TRIG_DATA_SIZE_Enum;

/* =====================================================  CH9_AL1_CTRL  ====================================================== */
/* ===================================================  CH9_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH9_AL1_WRITE_ADDR  =================================================== */
/* ===============================================  CH9_AL1_TRANS_COUNT_TRIG  ================================================ */
/* =====================================================  CH9_AL2_CTRL  ====================================================== */
/* ==================================================  CH9_AL2_TRANS_COUNT  ================================================== */
/* ===================================================  CH9_AL2_READ_ADDR  =================================================== */
/* ================================================  CH9_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH9_AL3_CTRL  ====================================================== */
/* ==================================================  CH9_AL3_WRITE_ADDR  =================================================== */
/* ==================================================  CH9_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH9_AL3_READ_ADDR_TRIG  ================================================= */
/* ====================================================  CH10_READ_ADDR  ===================================================== */
/* ====================================================  CH10_WRITE_ADDR  ==================================================== */
/* ===================================================  CH10_TRANS_COUNT  ==================================================== */
/* ====================================================  CH10_CTRL_TRIG  ===================================================== */
/* =========================================  DMA CH10_CTRL_TRIG TREQ_SEL [15..20]  ========================================== */
typedef enum {                                  /*!< DMA_CH10_CTRL_TRIG_TREQ_SEL                                               */
  DMA_CH10_CTRL_TRIG_TREQ_SEL_TIMER0   = 59,    /*!< TIMER0 : Select Timer 0 as TREQ                                           */
  DMA_CH10_CTRL_TRIG_TREQ_SEL_TIMER1   = 60,    /*!< TIMER1 : Select Timer 1 as TREQ                                           */
  DMA_CH10_CTRL_TRIG_TREQ_SEL_TIMER2   = 61,    /*!< TIMER2 : Select Timer 2 as TREQ (Optional)                                */
  DMA_CH10_CTRL_TRIG_TREQ_SEL_TIMER3   = 62,    /*!< TIMER3 : Select Timer 3 as TREQ (Optional)                                */
  DMA_CH10_CTRL_TRIG_TREQ_SEL_PERMANENT = 63,   /*!< PERMANENT : Permanent request, for unpaced transfers.                     */
} DMA_CH10_CTRL_TRIG_TREQ_SEL_Enum;

/* ==========================================  DMA CH10_CTRL_TRIG RING_SIZE [6..9]  ========================================== */
typedef enum {                                  /*!< DMA_CH10_CTRL_TRIG_RING_SIZE                                              */
  DMA_CH10_CTRL_TRIG_RING_SIZE_RING_NONE = 0,   /*!< RING_NONE : RING_NONE                                                     */
} DMA_CH10_CTRL_TRIG_RING_SIZE_Enum;

/* ==========================================  DMA CH10_CTRL_TRIG DATA_SIZE [2..3]  ========================================== */
typedef enum {                                  /*!< DMA_CH10_CTRL_TRIG_DATA_SIZE                                              */
  DMA_CH10_CTRL_TRIG_DATA_SIZE_SIZE_BYTE = 0,   /*!< SIZE_BYTE : SIZE_BYTE                                                     */
  DMA_CH10_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD = 1,/*!< SIZE_HALFWORD : SIZE_HALFWORD                                            */
  DMA_CH10_CTRL_TRIG_DATA_SIZE_SIZE_WORD = 2,   /*!< SIZE_WORD : SIZE_WORD                                                     */
} DMA_CH10_CTRL_TRIG_DATA_SIZE_Enum;

/* =====================================================  CH10_AL1_CTRL  ===================================================== */
/* ==================================================  CH10_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH10_AL1_WRITE_ADDR  ================================================== */
/* ===============================================  CH10_AL1_TRANS_COUNT_TRIG  =============================================== */
/* =====================================================  CH10_AL2_CTRL  ===================================================== */
/* =================================================  CH10_AL2_TRANS_COUNT  ================================================== */
/* ==================================================  CH10_AL2_READ_ADDR  =================================================== */
/* ===============================================  CH10_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH10_AL3_CTRL  ===================================================== */
/* ==================================================  CH10_AL3_WRITE_ADDR  ================================================== */
/* =================================================  CH10_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH10_AL3_READ_ADDR_TRIG  ================================================ */
/* ====================================================  CH11_READ_ADDR  ===================================================== */
/* ====================================================  CH11_WRITE_ADDR  ==================================================== */
/* ===================================================  CH11_TRANS_COUNT  ==================================================== */
/* ====================================================  CH11_CTRL_TRIG  ===================================================== */
/* =========================================  DMA CH11_CTRL_TRIG TREQ_SEL [15..20]  ========================================== */
typedef enum {                                  /*!< DMA_CH11_CTRL_TRIG_TREQ_SEL                                               */
  DMA_CH11_CTRL_TRIG_TREQ_SEL_TIMER0   = 59,    /*!< TIMER0 : Select Timer 0 as TREQ                                           */
  DMA_CH11_CTRL_TRIG_TREQ_SEL_TIMER1   = 60,    /*!< TIMER1 : Select Timer 1 as TREQ                                           */
  DMA_CH11_CTRL_TRIG_TREQ_SEL_TIMER2   = 61,    /*!< TIMER2 : Select Timer 2 as TREQ (Optional)                                */
  DMA_CH11_CTRL_TRIG_TREQ_SEL_TIMER3   = 62,    /*!< TIMER3 : Select Timer 3 as TREQ (Optional)                                */
  DMA_CH11_CTRL_TRIG_TREQ_SEL_PERMANENT = 63,   /*!< PERMANENT : Permanent request, for unpaced transfers.                     */
} DMA_CH11_CTRL_TRIG_TREQ_SEL_Enum;

/* ==========================================  DMA CH11_CTRL_TRIG RING_SIZE [6..9]  ========================================== */
typedef enum {                                  /*!< DMA_CH11_CTRL_TRIG_RING_SIZE                                              */
  DMA_CH11_CTRL_TRIG_RING_SIZE_RING_NONE = 0,   /*!< RING_NONE : RING_NONE                                                     */
} DMA_CH11_CTRL_TRIG_RING_SIZE_Enum;

/* ==========================================  DMA CH11_CTRL_TRIG DATA_SIZE [2..3]  ========================================== */
typedef enum {                                  /*!< DMA_CH11_CTRL_TRIG_DATA_SIZE                                              */
  DMA_CH11_CTRL_TRIG_DATA_SIZE_SIZE_BYTE = 0,   /*!< SIZE_BYTE : SIZE_BYTE                                                     */
  DMA_CH11_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD = 1,/*!< SIZE_HALFWORD : SIZE_HALFWORD                                            */
  DMA_CH11_CTRL_TRIG_DATA_SIZE_SIZE_WORD = 2,   /*!< SIZE_WORD : SIZE_WORD                                                     */
} DMA_CH11_CTRL_TRIG_DATA_SIZE_Enum;

/* =====================================================  CH11_AL1_CTRL  ===================================================== */
/* ==================================================  CH11_AL1_READ_ADDR  =================================================== */
/* ==================================================  CH11_AL1_WRITE_ADDR  ================================================== */
/* ===============================================  CH11_AL1_TRANS_COUNT_TRIG  =============================================== */
/* =====================================================  CH11_AL2_CTRL  ===================================================== */
/* =================================================  CH11_AL2_TRANS_COUNT  ================================================== */
/* ==================================================  CH11_AL2_READ_ADDR  =================================================== */
/* ===============================================  CH11_AL2_WRITE_ADDR_TRIG  ================================================ */
/* =====================================================  CH11_AL3_CTRL  ===================================================== */
/* ==================================================  CH11_AL3_WRITE_ADDR  ================================================== */
/* =================================================  CH11_AL3_TRANS_COUNT  ================================================== */
/* ================================================  CH11_AL3_READ_ADDR_TRIG  ================================================ */
/* =========================================================  INTR  ========================================================== */
/* =========================================================  INTE0  ========================================================= */
/* =========================================================  INTF0  ========================================================= */
/* =========================================================  INTS0  ========================================================= */
/* =========================================================  INTE1  ========================================================= */
/* =========================================================  INTF1  ========================================================= */
/* =========================================================  INTS1  ========================================================= */
/* ========================================================  TIMER0  ========================================================= */
/* ========================================================  TIMER1  ========================================================= */
/* ========================================================  TIMER2  ========================================================= */
/* ========================================================  TIMER3  ========================================================= */
/* ==================================================  MULTI_CHAN_TRIGGER  =================================================== */
/* ======================================================  SNIFF_CTRL  ======================================================= */
/* ==============================================  DMA SNIFF_CTRL CALC [5..8]  =============================================== */
typedef enum {                                  /*!< DMA_SNIFF_CTRL_CALC                                                       */
  DMA_SNIFF_CTRL_CALC_CRC32            = 0,     /*!< CRC32 : Calculate a CRC-32 (IEEE802.3 polynomial)                         */
  DMA_SNIFF_CTRL_CALC_CRC32R           = 1,     /*!< CRC32R : Calculate a CRC-32 (IEEE802.3 polynomial) with bit
                                                     reversed data                                                             */
  DMA_SNIFF_CTRL_CALC_CRC16            = 2,     /*!< CRC16 : Calculate a CRC-16-CCITT                                          */
  DMA_SNIFF_CTRL_CALC_CRC16R           = 3,     /*!< CRC16R : Calculate a CRC-16-CCITT with bit reversed data                  */
  DMA_SNIFF_CTRL_CALC_EVEN             = 14,    /*!< EVEN : XOR reduction over all data. == 1 if the total 1 population
                                                     count is odd.                                                             */
  DMA_SNIFF_CTRL_CALC_SUM              = 15,    /*!< SUM : Calculate a simple 32-bit checksum (addition with a 32
                                                     bit accumulator)                                                          */
} DMA_SNIFF_CTRL_CALC_Enum;

