mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ======================================================  SNIFF_DATA  ======================================================= */
/* ======================================================  FIFO_LEVELS  ====================================================== */
/* ======================================================  CHAN_ABORT  ======================================================= */
/* ======================================================  N_CHANNELS  ======================================================= */
/* ====================================================  CH0_DBG_CTDREQ  ===================================================== */
/* ======================================================  CH0_DBG_TCR  ====================================================== */
/* ====================================================  CH1_DBG_CTDREQ  ===================================================== */
/* ======================================================  CH1_DBG_TCR  ====================================================== */
/* ====================================================  CH2_DBG_CTDREQ  ===================================================== */
/* ======================================================  CH2_DBG_TCR  ====================================================== */
/* ====================================================  CH3_DBG_CTDREQ  ===================================================== */
/* ======================================================  CH3_DBG_TCR  ====================================================== */
/* ====================================================  CH4_DBG_CTDREQ  ===================================================== */
/* ======================================================  CH4_DBG_TCR  ====================================================== */
/* ====================================================  CH5_DBG_CTDREQ  ===================================================== */
/* ======================================================  CH5_DBG_TCR  ====================================================== */
/* ====================================================  CH6_DBG_CTDREQ  ===================================================== */
/* ======================================================  CH6_DBG_TCR  ====================================================== */
/* ====================================================  CH7_DBG_CTDREQ  ===================================================== */
/* ======================================================  CH7_DBG_TCR  ====================================================== */
/* ====================================================  CH8_DBG_CTDREQ  ===================================================== */
/* ======================================================  CH8_DBG_TCR  ====================================================== */
/* ====================================================  CH9_DBG_CTDREQ  ===================================================== */
/* ======================================================  CH9_DBG_TCR  ====================================================== */
/* ====================================================  CH10_DBG_CTDREQ  ==================================================== */
/* =====================================================  CH10_DBG_TCR  ====================================================== */
/* ====================================================  CH11_DBG_CTDREQ  ==================================================== */
/* =====================================================  CH11_DBG_TCR  ====================================================== */


/* =========================================================================================================================== */
/* ================                                       USBCTRL_DPRAM                                       ================ */
/* =========================================================================================================================== */

/* ===================================================  SETUP_PACKET_LOW  ==================================================== */
/* ===================================================  SETUP_PACKET_HIGH  =================================================== */
/* ====================================================  EP1_IN_CONTROL  ===================================================== */
/* ==================================  USBCTRL_DPRAM EP1_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE                                */
  USBCTRL_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                                */
  USBCTRL_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                    */
  USBCTRL_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                         */
  USBCTRL_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                          */
} USBCTRL_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP1_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP1_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP2_IN_CONTROL  ===================================================== */
/* ==================================  USBCTRL_DPRAM EP2_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE                                */
  USBCTRL_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                                */
  USBCTRL_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                    */
  USBCTRL_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                         */
  USBCTRL_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                          */
} USBCTRL_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP2_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP2_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP3_IN_CONTROL  ===================================================== */
/* ==================================  USBCTRL_DPRAM EP3_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP3_IN_CONTROL_ENDPOINT_TYPE                                */
  USBCTRL_DPRAM_EP3_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                                */
  USBCTRL_DPRAM_EP3_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                    */
  USBCTRL_DPRAM_EP3_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                         */
  USBCTRL_DPRAM_EP3_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                          */
} USBCTRL_DPRAM_EP3_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP3_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP3_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP3_OUT_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP3_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP3_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP3_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP3_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP3_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP4_IN_CONTROL  ===================================================== */
/* ==================================  USBCTRL_DPRAM EP4_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP4_IN_CONTROL_ENDPOINT_TYPE                                */
  USBCTRL_DPRAM_EP4_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                                */
  USBCTRL_DPRAM_EP4_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                    */
  USBCTRL_DPRAM_EP4_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                         */
  USBCTRL_DPRAM_EP4_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                          */
} USBCTRL_DPRAM_EP4_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP4_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP4_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP4_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP5_IN_CONTROL  ===================================================== */
/* ==================================  USBCTRL_DPRAM EP5_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE                                */
  USBCTRL_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                                */
  USBCTRL_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                    */
  USBCTRL_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                         */
  USBCTRL_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                          */
} USBCTRL_DPRAM_EP5_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP5_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP5_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP5_OUT_CONTROL_ENDPOINT_TYPE_Enum;

