mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ====================================================  EP6_IN_CONTROL  ===================================================== */
/* ==================================  USBCTRL_DPRAM EP6_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE                                */
  USBCTRL_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                                */
  USBCTRL_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                    */
  USBCTRL_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                         */
  USBCTRL_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                          */
} USBCTRL_DPRAM_EP6_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP6_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP6_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP6_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP7_IN_CONTROL  ===================================================== */
/* ==================================  USBCTRL_DPRAM EP7_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE                                */
  USBCTRL_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                                */
  USBCTRL_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                    */
  USBCTRL_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                         */
  USBCTRL_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                          */
} USBCTRL_DPRAM_EP7_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP7_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP7_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP7_OUT_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP7_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP7_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP7_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP7_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP7_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP8_IN_CONTROL  ===================================================== */
/* ==================================  USBCTRL_DPRAM EP8_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP8_IN_CONTROL_ENDPOINT_TYPE                                */
  USBCTRL_DPRAM_EP8_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                                */
  USBCTRL_DPRAM_EP8_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                    */
  USBCTRL_DPRAM_EP8_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                         */
  USBCTRL_DPRAM_EP8_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                          */
} USBCTRL_DPRAM_EP8_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP8_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP8_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP8_OUT_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP8_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP8_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP8_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP8_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP8_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP9_IN_CONTROL  ===================================================== */
/* ==================================  USBCTRL_DPRAM EP9_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP9_IN_CONTROL_ENDPOINT_TYPE                                */
  USBCTRL_DPRAM_EP9_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                                */
  USBCTRL_DPRAM_EP9_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                    */
  USBCTRL_DPRAM_EP9_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                         */
  USBCTRL_DPRAM_EP9_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                          */
} USBCTRL_DPRAM_EP9_IN_CONTROL_ENDPOINT_TYPE_Enum;

