mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ====================================================  EP9_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP9_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP9_OUT_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP9_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP9_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP9_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP9_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP9_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP10_IN_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP10_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP10_IN_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP10_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP10_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP10_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP10_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP10_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ===================================================  EP10_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP10_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP10_OUT_CONTROL_ENDPOINT_TYPE                              */
  USBCTRL_DPRAM_EP10_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                              */
  USBCTRL_DPRAM_EP10_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                  */
  USBCTRL_DPRAM_EP10_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                       */
  USBCTRL_DPRAM_EP10_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                        */
} USBCTRL_DPRAM_EP10_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP11_IN_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP11_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP11_IN_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP11_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP11_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP11_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP11_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP11_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ===================================================  EP11_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP11_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP11_OUT_CONTROL_ENDPOINT_TYPE                              */
  USBCTRL_DPRAM_EP11_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                              */
  USBCTRL_DPRAM_EP11_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                  */
  USBCTRL_DPRAM_EP11_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                       */
  USBCTRL_DPRAM_EP11_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                        */
} USBCTRL_DPRAM_EP11_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP12_IN_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP12_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP12_IN_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP12_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP12_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP12_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP12_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP12_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ===================================================  EP12_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP12_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP12_OUT_CONTROL_ENDPOINT_TYPE                              */
  USBCTRL_DPRAM_EP12_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                              */
  USBCTRL_DPRAM_EP12_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                  */
  USBCTRL_DPRAM_EP12_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                       */
  USBCTRL_DPRAM_EP12_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                        */
} USBCTRL_DPRAM_EP12_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP13_IN_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP13_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP13_IN_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP13_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP13_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP13_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP13_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP13_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ===================================================  EP13_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP13_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE                              */
  USBCTRL_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                              */
  USBCTRL_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                  */
  USBCTRL_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                       */
  USBCTRL_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                        */
} USBCTRL_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP14_IN_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP14_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ===================================================  EP14_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP14_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE                              */
  USBCTRL_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                              */
  USBCTRL_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                  */
  USBCTRL_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                       */
  USBCTRL_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                        */
} USBCTRL_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* ====================================================  EP15_IN_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP15_IN_CONTROL ENDPOINT_TYPE [26..27]  ================================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE                               */
  USBCTRL_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                               */
  USBCTRL_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                   */
  USBCTRL_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                        */
  USBCTRL_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                         */
} USBCTRL_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_Enum;

/* ===================================================  EP15_OUT_CONTROL  ==================================================== */
/* =================================  USBCTRL_DPRAM EP15_OUT_CONTROL ENDPOINT_TYPE [26..27]  ================================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE                              */
  USBCTRL_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_Control = 0,/*!< Control : Control                                              */
  USBCTRL_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_Isochronous = 1,/*!< Isochronous : Isochronous                                  */
  USBCTRL_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_Bulk = 2,/*!< Bulk : Bulk                                                       */
  USBCTRL_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_Interrupt = 3,/*!< Interrupt : Interrupt                                        */
} USBCTRL_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_Enum;

/* =================================================  EP0_IN_BUFFER_CONTROL  ================================================= */
/* =========================  USBCTRL_DPRAM EP0_IN_BUFFER_CONTROL DOUBLE_BUFFER_ISO_OFFSET [27..28]  ========================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP0_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET              */
  USBCTRL_DPRAM_EP0_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_128 = 0,/*!< 128 : 128                                          */
  USBCTRL_DPRAM_EP0_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_256 = 1,/*!< 256 : 256                                          */
  USBCTRL_DPRAM_EP0_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_512 = 2,/*!< 512 : 512                                          */
  USBCTRL_DPRAM_EP0_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_1024 = 3,/*!< 1024 : 1024                                       */
} USBCTRL_DPRAM_EP0_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_Enum;

/* ================================================  EP0_OUT_BUFFER_CONTROL  ================================================= */
/* ========================  USBCTRL_DPRAM EP0_OUT_BUFFER_CONTROL DOUBLE_BUFFER_ISO_OFFSET [27..28]  ========================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP0_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET             */
  USBCTRL_DPRAM_EP0_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_128 = 0,/*!< 128 : 128                                         */
  USBCTRL_DPRAM_EP0_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_256 = 1,/*!< 256 : 256                                         */
  USBCTRL_DPRAM_EP0_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_512 = 2,/*!< 512 : 512                                         */
  USBCTRL_DPRAM_EP0_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_1024 = 3,/*!< 1024 : 1024                                      */
} USBCTRL_DPRAM_EP0_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_Enum;

/* =================================================  EP1_IN_BUFFER_CONTROL  ================================================= */
/* =========================  USBCTRL_DPRAM EP1_IN_BUFFER_CONTROL DOUBLE_BUFFER_ISO_OFFSET [27..28]  ========================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP1_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET              */
  USBCTRL_DPRAM_EP1_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_128 = 0,/*!< 128 : 128                                          */
  USBCTRL_DPRAM_EP1_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_256 = 1,/*!< 256 : 256                                          */
  USBCTRL_DPRAM_EP1_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_512 = 2,/*!< 512 : 512                                          */
  USBCTRL_DPRAM_EP1_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_1024 = 3,/*!< 1024 : 1024                                       */
} USBCTRL_DPRAM_EP1_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_Enum;

