mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* ================================================  EP13_IN_BUFFER_CONTROL  ================================================= */
/* ========================  USBCTRL_DPRAM EP13_IN_BUFFER_CONTROL DOUBLE_BUFFER_ISO_OFFSET [27..28]  ========================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP13_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET             */
  USBCTRL_DPRAM_EP13_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_128 = 0,/*!< 128 : 128                                         */
  USBCTRL_DPRAM_EP13_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_256 = 1,/*!< 256 : 256                                         */
  USBCTRL_DPRAM_EP13_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_512 = 2,/*!< 512 : 512                                         */
  USBCTRL_DPRAM_EP13_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_1024 = 3,/*!< 1024 : 1024                                      */
} USBCTRL_DPRAM_EP13_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_Enum;

/* ================================================  EP13_OUT_BUFFER_CONTROL  ================================================ */
/* ========================  USBCTRL_DPRAM EP13_OUT_BUFFER_CONTROL DOUBLE_BUFFER_ISO_OFFSET [27..28]  ======================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP13_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET            */
  USBCTRL_DPRAM_EP13_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_128 = 0,/*!< 128 : 128                                        */
  USBCTRL_DPRAM_EP13_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_256 = 1,/*!< 256 : 256                                        */
  USBCTRL_DPRAM_EP13_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_512 = 2,/*!< 512 : 512                                        */
  USBCTRL_DPRAM_EP13_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_1024 = 3,/*!< 1024 : 1024                                     */
} USBCTRL_DPRAM_EP13_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_Enum;

/* ================================================  EP14_IN_BUFFER_CONTROL  ================================================= */
/* ========================  USBCTRL_DPRAM EP14_IN_BUFFER_CONTROL DOUBLE_BUFFER_ISO_OFFSET [27..28]  ========================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP14_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET             */
  USBCTRL_DPRAM_EP14_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_128 = 0,/*!< 128 : 128                                         */
  USBCTRL_DPRAM_EP14_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_256 = 1,/*!< 256 : 256                                         */
  USBCTRL_DPRAM_EP14_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_512 = 2,/*!< 512 : 512                                         */
  USBCTRL_DPRAM_EP14_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_1024 = 3,/*!< 1024 : 1024                                      */
} USBCTRL_DPRAM_EP14_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_Enum;

/* ================================================  EP14_OUT_BUFFER_CONTROL  ================================================ */
/* ========================  USBCTRL_DPRAM EP14_OUT_BUFFER_CONTROL DOUBLE_BUFFER_ISO_OFFSET [27..28]  ======================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP14_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET            */
  USBCTRL_DPRAM_EP14_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_128 = 0,/*!< 128 : 128                                        */
  USBCTRL_DPRAM_EP14_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_256 = 1,/*!< 256 : 256                                        */
  USBCTRL_DPRAM_EP14_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_512 = 2,/*!< 512 : 512                                        */
  USBCTRL_DPRAM_EP14_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_1024 = 3,/*!< 1024 : 1024                                     */
} USBCTRL_DPRAM_EP14_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_Enum;

/* ================================================  EP15_IN_BUFFER_CONTROL  ================================================= */
/* ========================  USBCTRL_DPRAM EP15_IN_BUFFER_CONTROL DOUBLE_BUFFER_ISO_OFFSET [27..28]  ========================= */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP15_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET             */
  USBCTRL_DPRAM_EP15_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_128 = 0,/*!< 128 : 128                                         */
  USBCTRL_DPRAM_EP15_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_256 = 1,/*!< 256 : 256                                         */
  USBCTRL_DPRAM_EP15_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_512 = 2,/*!< 512 : 512                                         */
  USBCTRL_DPRAM_EP15_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_1024 = 3,/*!< 1024 : 1024                                      */
} USBCTRL_DPRAM_EP15_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_Enum;

/* ================================================  EP15_OUT_BUFFER_CONTROL  ================================================ */
/* ========================  USBCTRL_DPRAM EP15_OUT_BUFFER_CONTROL DOUBLE_BUFFER_ISO_OFFSET [27..28]  ======================== */
typedef enum {                                  /*!< USBCTRL_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET            */
  USBCTRL_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_128 = 0,/*!< 128 : 128                                        */
  USBCTRL_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_256 = 1,/*!< 256 : 256                                        */
  USBCTRL_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_512 = 2,/*!< 512 : 512                                        */
  USBCTRL_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_1024 = 3,/*!< 1024 : 1024                                     */
} USBCTRL_DPRAM_EP15_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_Enum;



/* =========================================================================================================================== */
/* ================                                       USBCTRL_REGS                                        ================ */
/* =========================================================================================================================== */

/* =======================================================  ADDR_ENDP  ======================================================= */
/* ======================================================  ADDR_ENDP1  ======================================================= */
/* ======================================================  ADDR_ENDP2  ======================================================= */
/* ======================================================  ADDR_ENDP3  ======================================================= */
/* ======================================================  ADDR_ENDP4  ======================================================= */
/* ======================================================  ADDR_ENDP5  ======================================================= */
/* ======================================================  ADDR_ENDP6  ======================================================= */
/* ======================================================  ADDR_ENDP7  ======================================================= */
/* ======================================================  ADDR_ENDP8  ======================================================= */
/* ======================================================  ADDR_ENDP9  ======================================================= */
/* ======================================================  ADDR_ENDP10  ====================================================== */
/* ======================================================  ADDR_ENDP11  ====================================================== */
/* ======================================================  ADDR_ENDP12  ====================================================== */
/* ======================================================  ADDR_ENDP13  ====================================================== */
/* ======================================================  ADDR_ENDP14  ====================================================== */
/* ======================================================  ADDR_ENDP15  ====================================================== */
/* =======================================================  MAIN_CTRL  ======================================================= */
/* ========================================================  SOF_WR  ========================================================= */
/* ========================================================  SOF_RD  ========================================================= */
/* =======================================================  SIE_CTRL  ======================================================== */
/* ======================================================  SIE_STATUS  ======================================================= */
/* ======================================================  INT_EP_CTRL  ====================================================== */
/* ======================================================  BUFF_STATUS  ====================================================== */
/* ================================================  BUFF_CPU_SHOULD_HANDLE  ================================================= */
/* =======================================================  EP_ABORT  ======================================================== */
/* =====================================================  EP_ABORT_DONE  ===================================================== */
/* =====================================================  EP_STALL_ARM  ====================================================== */
/* =======================================================  NAK_POLL  ======================================================== */
/* ==================================================  EP_STATUS_STALL_NAK  ================================================== */
/* ======================================================  USB_MUXING  ======================================================= */
/* ========================================================  USB_PWR  ======================================================== */
/* =====================================================  USBPHY_DIRECT  ===================================================== */
/* ================================================  USBPHY_DIRECT_OVERRIDE  ================================================= */
/* ======================================================  USBPHY_TRIM  ====================================================== */
/* =========================================================  INTR  ========================================================== */
/* =========================================================  INTE  ========================================================== */
/* =========================================================  INTF  ========================================================== */
/* =========================================================  INTS  ========================================================== */


/* =========================================================================================================================== */
/* ================                                           PIO0                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* =========================================================  FSTAT  ========================================================= */
/* ========================================================  FDEBUG  ========================================================= */
/* ========================================================  FLEVEL  ========================================================= */
/* =========================================================  TXF0  ========================================================== */
/* =========================================================  TXF1  ========================================================== */
/* =========================================================  TXF2  ========================================================== */
/* =========================================================  TXF3  ========================================================== */
/* =========================================================  RXF0  ========================================================== */
/* =========================================================  RXF1  ========================================================== */
/* =========================================================  RXF2  ========================================================== */
/* =========================================================  RXF3  ========================================================== */
/* ==========================================================  IRQ  ========================================================== */
/* =======================================================  IRQ_FORCE  ======================================================= */
/* ===================================================  INPUT_SYNC_BYPASS  =================================================== */
/* ======================================================  DBG_PADOUT  ======================================================= */
/* =======================================================  DBG_PADOE  ======================================================= */
/* ======================================================  DBG_CFGINFO  ====================================================== */
/* ======================================================  INSTR_MEM0  ======================================================= */
/* ======================================================  INSTR_MEM1  ======================================================= */
/* ======================================================  INSTR_MEM2  ======================================================= */
/* ======================================================  INSTR_MEM3  ======================================================= */
/* ======================================================  INSTR_MEM4  ======================================================= */
/* ======================================================  INSTR_MEM5  ======================================================= */
/* ======================================================  INSTR_MEM6  ======================================================= */
/* ======================================================  INSTR_MEM7  ======================================================= */
/* ======================================================  INSTR_MEM8  ======================================================= */
/* ======================================================  INSTR_MEM9  ======================================================= */
/* ======================================================  INSTR_MEM10  ====================================================== */
/* ======================================================  INSTR_MEM11  ====================================================== */
/* ======================================================  INSTR_MEM12  ====================================================== */
/* ======================================================  INSTR_MEM13  ====================================================== */
/* ======================================================  INSTR_MEM14  ====================================================== */
/* ======================================================  INSTR_MEM15  ====================================================== */
/* ======================================================  INSTR_MEM16  ====================================================== */
/* ======================================================  INSTR_MEM17  ====================================================== */
/* ======================================================  INSTR_MEM18  ====================================================== */
/* ======================================================  INSTR_MEM19  ====================================================== */
/* ======================================================  INSTR_MEM20  ====================================================== */
/* ======================================================  INSTR_MEM21  ====================================================== */
/* ======================================================  INSTR_MEM22  ====================================================== */
/* ======================================================  INSTR_MEM23  ====================================================== */
/* ======================================================  INSTR_MEM24  ====================================================== */
/* ======================================================  INSTR_MEM25  ====================================================== */
/* ======================================================  INSTR_MEM26  ====================================================== */
/* ======================================================  INSTR_MEM27  ====================================================== */
/* ======================================================  INSTR_MEM28  ====================================================== */
/* ======================================================  INSTR_MEM29  ====================================================== */
/* ======================================================  INSTR_MEM30  ====================================================== */
/* ======================================================  INSTR_MEM31  ====================================================== */
/* ======================================================  SM0_CLKDIV  ======================================================= */
/* =====================================================  SM0_EXECCTRL  ====================================================== */
/* ==========================================  PIO0 SM0_EXECCTRL STATUS_SEL [4..4]  ========================================== */
typedef enum {                                  /*!< PIO0_SM0_EXECCTRL_STATUS_SEL                                              */
  PIO0_SM0_EXECCTRL_STATUS_SEL_TXLEVEL = 0,     /*!< TXLEVEL : All-ones if TX FIFO level < N, otherwise all-zeroes             */
  PIO0_SM0_EXECCTRL_STATUS_SEL_RXLEVEL = 1,     /*!< RXLEVEL : All-ones if RX FIFO level < N, otherwise all-zeroes             */
} PIO0_SM0_EXECCTRL_STATUS_SEL_Enum;

