mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =====================================================  SM0_SHIFTCTRL  ===================================================== */
/* =======================================================  SM0_ADDR  ======================================================== */
/* =======================================================  SM0_INSTR  ======================================================= */
/* ======================================================  SM0_PINCTRL  ====================================================== */
/* ======================================================  SM1_CLKDIV  ======================================================= */
/* =====================================================  SM1_EXECCTRL  ====================================================== */
/* ==========================================  PIO0 SM1_EXECCTRL STATUS_SEL [4..4]  ========================================== */
typedef enum {                                  /*!< PIO0_SM1_EXECCTRL_STATUS_SEL                                              */
  PIO0_SM1_EXECCTRL_STATUS_SEL_TXLEVEL = 0,     /*!< TXLEVEL : All-ones if TX FIFO level < N, otherwise all-zeroes             */
  PIO0_SM1_EXECCTRL_STATUS_SEL_RXLEVEL = 1,     /*!< RXLEVEL : All-ones if RX FIFO level < N, otherwise all-zeroes             */
} PIO0_SM1_EXECCTRL_STATUS_SEL_Enum;

/* =====================================================  SM1_SHIFTCTRL  ===================================================== */
/* =======================================================  SM1_ADDR  ======================================================== */
/* =======================================================  SM1_INSTR  ======================================================= */
/* ======================================================  SM1_PINCTRL  ====================================================== */
/* ======================================================  SM2_CLKDIV  ======================================================= */
/* =====================================================  SM2_EXECCTRL  ====================================================== */
/* ==========================================  PIO0 SM2_EXECCTRL STATUS_SEL [4..4]  ========================================== */
typedef enum {                                  /*!< PIO0_SM2_EXECCTRL_STATUS_SEL                                              */
  PIO0_SM2_EXECCTRL_STATUS_SEL_TXLEVEL = 0,     /*!< TXLEVEL : All-ones if TX FIFO level < N, otherwise all-zeroes             */
  PIO0_SM2_EXECCTRL_STATUS_SEL_RXLEVEL = 1,     /*!< RXLEVEL : All-ones if RX FIFO level < N, otherwise all-zeroes             */
} PIO0_SM2_EXECCTRL_STATUS_SEL_Enum;

/* =====================================================  SM2_SHIFTCTRL  ===================================================== */
/* =======================================================  SM2_ADDR  ======================================================== */
/* =======================================================  SM2_INSTR  ======================================================= */
/* ======================================================  SM2_PINCTRL  ====================================================== */
/* ======================================================  SM3_CLKDIV  ======================================================= */
/* =====================================================  SM3_EXECCTRL  ====================================================== */
/* ==========================================  PIO0 SM3_EXECCTRL STATUS_SEL [4..4]  ========================================== */
typedef enum {                                  /*!< PIO0_SM3_EXECCTRL_STATUS_SEL                                              */
  PIO0_SM3_EXECCTRL_STATUS_SEL_TXLEVEL = 0,     /*!< TXLEVEL : All-ones if TX FIFO level < N, otherwise all-zeroes             */
  PIO0_SM3_EXECCTRL_STATUS_SEL_RXLEVEL = 1,     /*!< RXLEVEL : All-ones if RX FIFO level < N, otherwise all-zeroes             */
} PIO0_SM3_EXECCTRL_STATUS_SEL_Enum;

/* =====================================================  SM3_SHIFTCTRL  ===================================================== */
/* =======================================================  SM3_ADDR  ======================================================== */
/* =======================================================  SM3_INSTR  ======================================================= */
/* ======================================================  SM3_PINCTRL  ====================================================== */
/* =========================================================  INTR  ========================================================== */
/* =======================================================  IRQ0_INTE  ======================================================= */
/* =======================================================  IRQ0_INTF  ======================================================= */
/* =======================================================  IRQ0_INTS  ======================================================= */
/* =======================================================  IRQ1_INTE  ======================================================= */
/* =======================================================  IRQ1_INTF  ======================================================= */
/* =======================================================  IRQ1_INTS  ======================================================= */


/* =========================================================================================================================== */
/* ================                                            SIO                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CPUID  ========================================================= */
/* ========================================================  GPIO_IN  ======================================================== */
/* ======================================================  GPIO_HI_IN  ======================================================= */
/* =======================================================  GPIO_OUT  ======================================================== */
/* =====================================================  GPIO_OUT_SET  ====================================================== */
/* =====================================================  GPIO_OUT_CLR  ====================================================== */
/* =====================================================  GPIO_OUT_XOR  ====================================================== */
/* ========================================================  GPIO_OE  ======================================================== */
/* ======================================================  GPIO_OE_SET  ====================================================== */
/* ======================================================  GPIO_OE_CLR  ====================================================== */
/* ======================================================  GPIO_OE_XOR  ====================================================== */
/* ======================================================  GPIO_HI_OUT  ====================================================== */
/* ====================================================  GPIO_HI_OUT_SET  ==================================================== */
/* ====================================================  GPIO_HI_OUT_CLR  ==================================================== */
/* ====================================================  GPIO_HI_OUT_XOR  ==================================================== */
/* ======================================================  GPIO_HI_OE  ======================================================= */
/* ====================================================  GPIO_HI_OE_SET  ===================================================== */
/* ====================================================  GPIO_HI_OE_CLR  ===================================================== */
/* ====================================================  GPIO_HI_OE_XOR  ===================================================== */
/* ========================================================  FIFO_ST  ======================================================== */
/* ========================================================  FIFO_WR  ======================================================== */
/* ========================================================  FIFO_RD  ======================================================== */
/* ======================================================  SPINLOCK_ST  ====================================================== */
/* =====================================================  DIV_UDIVIDEND  ===================================================== */
/* =====================================================  DIV_UDIVISOR  ====================================================== */
/* =====================================================  DIV_SDIVIDEND  ===================================================== */
/* =====================================================  DIV_SDIVISOR  ====================================================== */
/* =====================================================  DIV_QUOTIENT  ====================================================== */
/* =====================================================  DIV_REMAINDER  ===================================================== */
/* ========================================================  DIV_CSR  ======================================================== */
/* ====================================================  INTERP0_ACCUM0  ===================================================== */
/* ====================================================  INTERP0_ACCUM1  ===================================================== */
/* =====================================================  INTERP0_BASE0  ===================================================== */
/* =====================================================  INTERP0_BASE1  ===================================================== */
/* =====================================================  INTERP0_BASE2  ===================================================== */
/* ===================================================  INTERP0_POP_LANE0  =================================================== */
/* ===================================================  INTERP0_POP_LANE1  =================================================== */
/* ===================================================  INTERP0_POP_FULL  ==================================================== */
/* ==================================================  INTERP0_PEEK_LANE0  =================================================== */
/* ==================================================  INTERP0_PEEK_LANE1  =================================================== */
/* ===================================================  INTERP0_PEEK_FULL  =================================================== */
/* ==================================================  INTERP0_CTRL_LANE0  =================================================== */
/* ==================================================  INTERP0_CTRL_LANE1  =================================================== */
/* ==================================================  INTERP0_ACCUM0_ADD  =================================================== */
/* ==================================================  INTERP0_ACCUM1_ADD  =================================================== */
/* ==================================================  INTERP0_BASE_1AND0  =================================================== */
/* ====================================================  INTERP1_ACCUM0  ===================================================== */
/* ====================================================  INTERP1_ACCUM1  ===================================================== */
/* =====================================================  INTERP1_BASE0  ===================================================== */
/* =====================================================  INTERP1_BASE1  ===================================================== */
/* =====================================================  INTERP1_BASE2  ===================================================== */
/* ===================================================  INTERP1_POP_LANE0  =================================================== */
/* ===================================================  INTERP1_POP_LANE1  =================================================== */
/* ===================================================  INTERP1_POP_FULL  ==================================================== */
/* ==================================================  INTERP1_PEEK_LANE0  =================================================== */
/* ==================================================  INTERP1_PEEK_LANE1  =================================================== */
/* ===================================================  INTERP1_PEEK_FULL  =================================================== */
/* ==================================================  INTERP1_CTRL_LANE0  =================================================== */
/* ==================================================  INTERP1_CTRL_LANE1  =================================================== */
/* ==================================================  INTERP1_ACCUM0_ADD  =================================================== */
/* ==================================================  INTERP1_ACCUM1_ADD  =================================================== */
/* ==================================================  INTERP1_BASE_1AND0  =================================================== */
/* =======================================================  SPINLOCK0  ======================================================= */
/* =======================================================  SPINLOCK1  ======================================================= */
/* =======================================================  SPINLOCK2  ======================================================= */
/* =======================================================  SPINLOCK3  ======================================================= */
/* =======================================================  SPINLOCK4  ======================================================= */
/* =======================================================  SPINLOCK5  ======================================================= */
/* =======================================================  SPINLOCK6  ======================================================= */
/* =======================================================  SPINLOCK7  ======================================================= */
/* =======================================================  SPINLOCK8  ======================================================= */
/* =======================================================  SPINLOCK9  ======================================================= */
/* ======================================================  SPINLOCK10  ======================================================= */
/* ======================================================  SPINLOCK11  ======================================================= */
/* ======================================================  SPINLOCK12  ======================================================= */
/* ======================================================  SPINLOCK13  ======================================================= */
/* ======================================================  SPINLOCK14  ======================================================= */
/* ======================================================  SPINLOCK15  ======================================================= */
/* ======================================================  SPINLOCK16  ======================================================= */
/* ======================================================  SPINLOCK17  ======================================================= */
/* ======================================================  SPINLOCK18  ======================================================= */
/* ======================================================  SPINLOCK19  ======================================================= */
/* ======================================================  SPINLOCK20  ======================================================= */
/* ======================================================  SPINLOCK21  ======================================================= */
/* ======================================================  SPINLOCK22  ======================================================= */
/* ======================================================  SPINLOCK23  ======================================================= */
/* ======================================================  SPINLOCK24  ======================================================= */
/* ======================================================  SPINLOCK25  ======================================================= */
/* ======================================================  SPINLOCK26  ======================================================= */
/* ======================================================  SPINLOCK27  ======================================================= */
/* ======================================================  SPINLOCK28  ======================================================= */
/* ======================================================  SPINLOCK29  ======================================================= */
/* ======================================================  SPINLOCK30  ======================================================= */
/* ======================================================  SPINLOCK31  ======================================================= */


/* =========================================================================================================================== */
/* ================                                            PPB                                            ================ */
/* =========================================================================================================================== */

