mavaneerden/pi-pico-bare-metal/libs/CMSIS/rp2040_cmsis.h
/* =======================================================  SYST_CSR  ======================================================== */
/* =======================================================  SYST_RVR  ======================================================== */
/* =======================================================  SYST_CVR  ======================================================== */
/* ======================================================  SYST_CALIB  ======================================================= */
/* =======================================================  NVIC_ISER  ======================================================= */
/* =======================================================  NVIC_ICER  ======================================================= */
/* =======================================================  NVIC_ISPR  ======================================================= */
/* =======================================================  NVIC_ICPR  ======================================================= */
/* =======================================================  NVIC_IPR0  ======================================================= */
/* =======================================================  NVIC_IPR1  ======================================================= */
/* =======================================================  NVIC_IPR2  ======================================================= */
/* =======================================================  NVIC_IPR3  ======================================================= */
/* =======================================================  NVIC_IPR4  ======================================================= */
/* =======================================================  NVIC_IPR5  ======================================================= */
/* =======================================================  NVIC_IPR6  ======================================================= */
/* =======================================================  NVIC_IPR7  ======================================================= */
/* =========================================================  CPUID  ========================================================= */
/* =========================================================  ICSR  ========================================================== */
/* =========================================================  VTOR  ========================================================== */
/* =========================================================  AIRCR  ========================================================= */
/* ==========================================================  SCR  ========================================================== */
/* ==========================================================  CCR  ========================================================== */
/* =========================================================  SHPR2  ========================================================= */
/* =========================================================  SHPR3  ========================================================= */
/* =========================================================  SHCSR  ========================================================= */
/* =======================================================  MPU_TYPE  ======================================================== */
/* =======================================================  MPU_CTRL  ======================================================== */
/* ========================================================  MPU_RNR  ======================================================== */
/* =======================================================  MPU_RBAR  ======================================================== */
/* =======================================================  MPU_RASR  ======================================================== */

/** @} */ /* End of group EnumValue_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* RP2040_H */


/** @} */ /* End of group RP2040 */

/** @} */ /* End of group Raspberry Pi */
